{"title":"Shooters Bible - 108th Edition (2016) (Epub) Gooner","uid":15971032,"size":101598823,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0090ef43fd7a9e10a6b4790191df17757f789099&amp;dn=Shooters+Bible+-+108th+Edition+%282016%29+%28Epub%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":42,"leechers":3,"uploader":"GoonerTPB","files":2,"time":1475778352,"description":"Shooters Bible - The Worlds Bestselling Firearms Reference - 108th Edition (2016) (Epub) Gooner\r\n\r\nPublisher: Sky Pony Press; 108 edition (20 Oct. 2016)\r\nLanguage: English\r\nISBN-10: 1510710914\r\nISBN-13: 978-1510710917\r\n\r\nPublished annually for more than eighty years, the Shooter s Bible is the most comprehensive and sought-after reference guide for new firearms and their specifications, as well as for thousands of guns that have been in production and are currently on the market. Nearly every firearms manufacturer in the world is included in this renowned compendium. The 108th edition also contains new and existing product sections on ammunition, optics, and accessories, plus updated handgun and rifle ballistic tables along with extensive charts of currently available bullets and projectiles for handloading. With a timely feature on the newest products on the market, and complete with color and black-and-white photographs featuring various makes and models of firearms and equipment, the Shooter s Bible is an essential authority for any beginner or experienced hunter, firearm collector, or gun enthusiast. Skyhorse Publishing is proud to publish a broad range of books for hunters and firearms enthusiasts. We publish books about shotguns, rifles, handguns, target shooting, gun collecting, self-defense, archery, ammunition, knives, gunsmithing, gun repair, and wilderness survival. We publish books on deer hunting, big game hunting, small game hunting, wing shooting, turkey hunting, deer stands, duck blinds, bowhunting, wing shooting, hunting dogs, and more. While not every title we publish becomes a New York Times bestseller or a national bestseller, we are committed to publishing books on subjects that are sometimes overlooked by other publishers and to authors whose work might not otherwise find a home.&quot;","torrent":{"xt":"urn:btih:0090ef43fd7a9e10a6b4790191df17757f789099","amp;dn":"Shooters+Bible+-+108th+Edition+%282016%29+%28Epub%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0090ef43fd7a9e10a6b4790191df17757f789099","infoHashBuffer":{"type":"Buffer","data":[0,144,239,67,253,122,158,16,166,180,121,1,145,223,23,117,127,120,144,153]},"announce":[],"urlList":[]}}