{"title":"Stargate Atlantis Season 1, 2, 3, 4 &amp; 5 + Extras DVDRip TSV","uid":6505088,"size":36847533590,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:00ba5d5bd985bf4aedff2c26531cd66dd492c7cc&amp;dn=Stargate+Atlantis+Season+1%2C+2%2C+3%2C+4+%26+5+%2B+Extras+DVDRip+TSV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":101,"leechers":205,"uploader":"TSV","files":-1,"time":1309400799,"description":"All 5 seasons complete + subtitles + extras.\n\nThis is being uploaded from a 1 gig broadband connection. Please seed.\n\n\n\n\nStargate Atlantis (often abbreviated as SGA) is a Canadian-American science fiction television series and part of MGM's Stargate franchise. The show was created by Brad Wright and Robert C. Cooper as a spin-off series of Stargate SG-1, which was created by Wright and Jonathan Glassner and was itself based on the feature film Stargate (1994). The first three seasons of Stargate Atlantis were broadcast by The Sci-Fi Channel and The Movie Network, while the final two seasons aired exclusively on Sci-Fi. The show premiered on July 16, 2004; its final episode aired on January 9, 2009. The series was filmed in and around Vancouver, Canada.\n\nThe story of Stargate Atlantis follows the events of Stargate SG-1's seventh season finale episode &quot;Lost City&quot;, in which the cast of that series discovered an outpost created by the alien race known as the Ancients in Antarctica. In the pilot episode, Stargate Command sends an international team to investigate the outpost, where Dr. Daniel Jackson discovers the location of the legendary city created by the Ancients, Atlantis.\n\nThe series was a ratings success for the Sci Fi Channel, and was particularly popular in Europe and Australia. Although it received little critical response, Stargate Atlantis was honored with numerous awards and award nominations in its five-season run. After Stargate Atlantis was canceled, the show's co-creators began working on the already conceptualized Stargate Universe which the network had approved to have a bigger budget, be less mythology dependent, and have more focus on character development. Stargate Universe was released on October 2, 2009, and then canceled after just two seasons. Merchandise for Stargate Atlantis includes games and toys, print media and an original audio series. With the cancellation of Stargate Universe, the intended direct-to-DVD film entitled Stargate: Extinction has been shelved indefinitely.","torrent":{"xt":"urn:btih:00ba5d5bd985bf4aedff2c26531cd66dd492c7cc","amp;dn":"Stargate+Atlantis+Season+1%2C+2%2C+3%2C+4+%26+5+%2B+Extras+DVDRip+TSV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00ba5d5bd985bf4aedff2c26531cd66dd492c7cc","infoHashBuffer":{"type":"Buffer","data":[0,186,93,91,217,133,191,74,237,255,44,38,83,28,214,109,212,146,199,204]},"announce":[],"urlList":[]}}