{"title":"Libricide: Regime-sponsored Destruction of Books and Libraries","uid":15890695,"size":2109767,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0127a0e2b82f994ce35ebe92430ca55cfe01e0f0&amp;dn=Libricide%3A+Regime-sponsored+Destruction+of+Books+and+Libraries&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":44,"leechers":2,"uploader":"marty14","files":1,"time":1474736436,"description":"Libricide: The Regime-sponsored Destruction of Books and Libraries in the Twentieth Century - Rebecca Knuth [epub]\r\n\r\nWhere they have burned books, they will end in burning human beings, declared German poet Heinrich Heine. This book identifies the regime-sponsored, ideologically driven, and systemic destruction of books and libraries in the 20th century that often served as a prelude or accompaniment to the massive human tragedies that have characterized a most violent century. Using case studies of libricide committed by Nazis, Serbs in Bosnia, Iraqis in Kuwait, Maoists during the Cultural Revolution in China, and Chinese Communists in Tibet, Knuth argues that the destruction of books and libraries by authoritarian regimes was sparked by the same impulses toward negation that provoked acts of genocide or ethnocide.\r\n\r\nReaders will learn why some people―even those not subject to authoritarian regimes―consider the destruction of books a positive process. Knuth promotes understanding of the reasons behind extremism and patterns of cultural terrorism, and concludes that what is at stake with libricide is nothing less than the preservation and continuation of the common cultural heritage of the world. Anyone committed to freedom of expression and humanistic values will embrace this passionate and valuable book","torrent":{"xt":"urn:btih:0127a0e2b82f994ce35ebe92430ca55cfe01e0f0","amp;dn":"Libricide%3A+Regime-sponsored+Destruction+of+Books+and+Libraries","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0127a0e2b82f994ce35ebe92430ca55cfe01e0f0","infoHashBuffer":{"type":"Buffer","data":[1,39,160,226,184,47,153,76,227,94,190,146,67,12,165,92,254,1,224,240]},"announce":[],"urlList":[]}}