{
  "title": "GloryholeSwallow: Gretchen (Gretchens 1st Gloryhole Visit) 09.16",
  "uid": 15840893,
  "size": 2000923099,
  "categoryP": "porn",
  "categoryS": "other",
  "magnet": "?xt=urn:btih:012a90cb8d3a4608f781ce29b0180aa11669493c&amp;dn=GloryholeSwallow%3A+Gretchen+%28Gretchens+1st+Gloryhole+Visit%29+09.16&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 71,
  "leechers": 15,
  "uploader": "EndYou",
  "files": 1,
  "time": 1474040000,
  "description": "... : More exclusive porn at : ...\r\n    https://thepiratebay.org/user/EndYou\r\n\r\n          ... : Screenshots : ... \nhttp://imgpremium.com/img-57dbf3a90da99.html  \nhttp://imgpremium.com/img-57dbf3a9820df.html \r\n\r\nI'm not sure if showing you guys the interviews early in the week helps or makes the week seem like it takes forever until you get to see the girl in action sucking and fucking at the Gloryhole. I'm sure some of you enjoy it but some probably have a tough time waiting.\r\n\r\nThe wait is over and now you get to see Gretchen sucking and fucking in crystal clear HD! This hot blonde really got the guys going and showed us some amazing cock sucking skills. She came prepared to suck lots of random cocks but wasn't sure if she was going to let anyone fuck her. Some girls will suck strangers all day long but are funny about fucking guys they don't know. This is primarily a blowjob site but I think we all like to see each girl get fucked at least once during a visit or in Gretchen's case, twice.\r\n\r\nThe sucking and fucking action is great in this visit but the part that stands out for me is when some black dude with huge fingers made her squirt for the very first time. Remember in the interview when she said she had a bad interracial experience once so my goal today was to turn that around and I think I succeeded.\r\n\r\nShe was blowing one black cock through the Gloryhole and another black dude was finger banging her pretty good from the adjacent booth. I was going back and forth but focusing on the blowjob because some guys don't give a courtesy knock and I didn't want to miss the pop-shot. That's when I heard the distinctive sound of a squirt coming on so I quickly got the camera between her legs just in time to catch the flood. She never told me she could squirt so I wasn't expecting it. She didn't tell me because she didn't know she could squirt...duh! Well, she released a big one and drenched the booth. The guy in the other booth got so turned on that he wanted a try so she spun around and gave him some soaking wet pussy to play with.\r\n\r\nI was going to get her to masturbate but after that one I doubt she had anything left in her. Now the goal is to get her to squirt while someone bangs the hell out of that amazing pussy. I think a rock hard upward curved cock while she's in the swing should do the trick.\r\n\r\nMPEG4 Video (H264) 960x540",
  "parsed": {
    "xt": "urn:btih:012a90cb8d3a4608f781ce29b0180aa11669493c",
    "dn": "GloryholeSwallow: Gretchen (Gretchens 1st Gloryhole Visit) 09.16",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "012a90cb8d3a4608f781ce29b0180aa11669493c",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        1,
        42,
        144,
        203,
        141,
        58,
        70,
        8,
        247,
        129,
        206,
        41,
        176,
        24,
        10,
        161,
        22,
        105,
        73,
        60
      ]
    },
    "name": "GloryholeSwallow: Gretchen (Gretchens 1st Gloryhole Visit) 09.16",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 86,
  "peers": 36,
  "last_updated": "2016-12-24T15:24:57.891Z"
}