{
  "title": "The Subtle Art of Not Giving a Fck (2016) (Epub) Gooner",
  "uid": 15836627,
  "size": 507637,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:01c227c8c9aac311f9365b163ea94708c27a7db4&amp;dn=The+Subtle+Art+of+Not+Giving+a+Fck+%282016%29+%28Epub%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 151,
  "leechers": 3,
  "uploader": "GoonerTPB",
  "files": 2,
  "time": 1473978340,
  "description": "The Subtle Art of Not Giving a Fck - A Counterintuitive Approach to Living a Good Life (2016) (Epub) Gooner\r\n\r\nPublisher: Harperone (13 Sept. 2016)\r\nLanguage: English\r\nISBN-10: 0062641549\r\nISBN-13: 978-0062641540\r\n\r\nIn this generation-defining self-help guide, a superstar blogger cuts through the crap to show us how to stop trying to be &quot;positive&quot; all the time so that we can truly become better, happier people.\r\n\r\nFor decades, we ve been told that positive thinking is the key to a happy, rich life. &quot;F**k positivity,&quot; Mark Manson says. &quot;Let s be honest, shit is f**ked and we have to live with it.&quot; In his wildly popular Internet blog, Manson doesn t sugarcoat or equivocate. He tells it like it is a dose of raw, refreshing, honest truth that is sorely lacking today. The Subtle Art of Not Giving a F**k is his antidote to the coddling, let s-all-feel-good mindset that has infectedmodern society and spoiled a generation, rewarding them with gold medals just for showing up.\r\n\r\nManson makes the argument, backed both by academic research and well-timed poop jokes, that improving our lives hinges not on our ability to turn lemons into lemonade, but on learning to stomach lemons better. Human beings are flawed and limited &quot;not everybody can be extraordinary, there are winners and losers in society, and some of it is not fair or your fault.&quot; Manson advises us to get to know our limitations and accept them. Once we embrace our fears, faults, and uncertainties, once we stop running and avoiding and start confronting painful truths, we can begin to find the courage, perseverance, honesty, responsibility, curiosity, and forgiveness we seek.\r\n\r\nThere are only so many things we can give a f**k about so we need to figure out which ones really matter, Manson makes clear. While money is nice, caring about what you do with your life is better, because true wealth is about experience. A much-needed grab-you-by-the-shoulders-and-look-you-in-the-eye moment of real-talk, filled with entertaining stories and profane, ruthless humor, The Subtle Art of Not Giving a F**k is a refreshing slap for a generation to help them lead contented, grounded lives.&quot;",
  "parsed": {
    "xt": "urn:btih:01c227c8c9aac311f9365b163ea94708c27a7db4",
    "dn": "The Subtle Art of Not Giving a Fck (2016) (Epub) Gooner",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "01c227c8c9aac311f9365b163ea94708c27a7db4",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        1,
        194,
        39,
        200,
        201,
        170,
        195,
        17,
        249,
        54,
        91,
        22,
        62,
        169,
        71,
        8,
        194,
        122,
        125,
        180
      ]
    },
    "name": "The Subtle Art of Not Giving a Fck (2016) (Epub) Gooner",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 154,
  "peers": 100,
  "last_updated": "2016-12-24T15:29:26.624Z"
}