{
  "title": "NubileFilms: Stella Cox (Waiting On You) 09.19.16",
  "uid": 15860340,
  "size": 355833654,
  "categoryP": "porn",
  "categoryS": "movie_clips",
  "magnet": "?xt=urn:btih:024cc21d3f8d6227d79097437f5a115e126d5776&amp;dn=NubileFilms%3A+Stella+Cox+%28Waiting+On+You%29+09.19.16&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 39,
  "leechers": 6,
  "uploader": "EndYou",
  "files": 1,
  "time": 1474288683,
  "description": "... : More exclusive porn at : ...\r\n    https://thepiratebay.org/user/EndYou\r\n\r\n          ... : Screenshots : ... \nhttp://imgpremium.com/img-57dfc0115b7f1.html  \nhttp://imgpremium.com/img-57dfc011d5372.html \r\n\r\nDecked out in lingerie that hugs her big boobs and sexy curves, Stella Cox waits impatiently for Ryan Driller to come home. Her hands wander her sensitive skin as she works herself closer and closer to a sexual frenzy. By the time Ryan walks in, Stella has gone to town massaging her tits and finger fucking her greedy puss beneath her thong.\r\nHappy to join Stella in action, Ryan drops to his belly on the bed and starts licking his girlfriend's glistening snatch with long laps of his tongue. Sliding his fingers deep into her needy twat, he focuses his attention on her clit. With such devoted loving to her most sensitive spots, Stella is soon gasping and moaning.\r\n\r\nPulling out Ryan's rock hard cock, Stella leans forward and opens her mouth wide. Instead of just letting his girlfriend suck, Ryan uses shallow thrusts of his hips to urge his fuck rod deeper and deeper down Stella's throat. She is happy to deep throat, and then when Ryan lets up a bit she keeps on sucking at her own pace.\r\n\r\nFinally ready to take things to the next level, Stella turns around and hovers doggy style while Ryan presses deep into her juicy twat. His first few thrusts are slow as he enjoys the feeling of Stella's fuck hole. From there, he picks up the face until he's delivering a ball slapping pussy pounding. Stella's pleasure continues to grow as she reaches down to rub her own clit, driving herself ever closer to climax.\r\n\r\nRolling onto her back, Stella lifts her legs high in the air to give Ryan full access to her puss. He doesn't hesitate to take advantage of this new position. Soon he is once again going to town on Stella's snatch. His rough strokes are complimented by both Ryan's hands and Stella's as they work in tandem to fondle and grope her jiggling breasts.\r\n\r\nClimbing up on top of Ryan, Stella holds herself in place while he goes to town from underneath. This position is perfect for getting the blonde off, especially as Ryan continues to squeeze her tits extra hard while she rubs her clit at light speed. Once Ryan is assured that Stella is well satisfied, pulls out to cum all over her bare mound and belly, leaving her sticky and full of love.\r\n\r\nMPEG4 Video (H264) 960x540",
  "parsed": {
    "xt": "urn:btih:024cc21d3f8d6227d79097437f5a115e126d5776",
    "dn": "NubileFilms: Stella Cox (Waiting On You) 09.19.16",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "024cc21d3f8d6227d79097437f5a115e126d5776",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        2,
        76,
        194,
        29,
        63,
        141,
        98,
        39,
        215,
        144,
        151,
        67,
        127,
        90,
        17,
        94,
        18,
        109,
        87,
        118
      ]
    },
    "name": "NubileFilms: Stella Cox (Waiting On You) 09.19.16",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 45,
  "peers": 27,
  "last_updated": "2016-12-24T15:33:23.251Z"
}