{
  "title": "Learn French with Michel Thomas",
  "uid": 3772073,
  "size": 262676287,
  "categoryP": "audio",
  "categoryS": "audio_books",
  "magnet": "?xt=urn:btih:03cabd511ccd75b5ada67de553f028e67a9da631&amp;dn=Learn+French+with+Michel+Thomas&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 92,
  "leechers": 10,
  "uploader": "Hal440",
  "files": 82,
  "time": 1187045038,
  "description": "==My Message==\nPart of living life to the full is getting the most out of your time... This audio book is the perfect way to learn a language without using up any time. Put this on your mp3 player and listen to it when you&amp;#039;re cleaning, using transport, exercising... anything that doesn&amp;#039;t require any thought. You&amp;#039;re meant to say the French out loud but it also works pretty well saying it in your head (but you can&amp;#039;t just listen!)\n\nDon&amp;#039;t stop there... there&amp;#039;s 1000s of useful audio books- I can get them for free because I work in a library. I&amp;#039;m going to make as many as possible into torrents. I&amp;#039;ll try to add one every week.\n\nanother good thing about this course is that it?s split into short lessons of 5-10 minutes. What I do is listen to a playlist that alternates between chilled out music and learning French. That way I don&amp;#039;t work my brain too hard.\n\n==Live longer==\nI used to sleep for 8.25 hours per night... thats pretty average. Then I read that its recommended that we sleep 6-8 hours, so i thought why not sleep for 6? That way i can spend more time awake. I gain 2.25 hours per day... thats 17.75 hours in a week, which is exactly the same amount of time i used to spend awake when i slept for 8.25 hours a night. Its like having an extra day a week for the rest of your life!\n\nit takes a couple of days to get used to, but after it does it you feel more alert. You get lucid dreams as well! If you find it hard to get up, try getting in the habit of going for a 10 minute jog as soon as you awake. It wakes you up and sets you up for the morning!\n\n==One Last thing==\nI can&amp;#039;t seed this torrent forever... please don&amp;#039;t destroy my torrent by taking without seeding.\n\n\npeace and love guys and girls, keep it real\n\n_Hal440_\n\n\n\n=================================================================================\nBook Description\n\nAnyone can learn a language with Michel Thomas--The World&amp;#039;s Greatest Language Teacher.\n\nNo books. No writing. No drills. And nothing to memorize--ever! With his unique program, Michel Thomas has taught celebrities, corporate leaders, and schoolchildren--with immediate and amazing results. Now the Language Teacher to the Stars invites everyone to join his class!\n\nUsing Spanish with Michel Thomas, listeners learn in real time--fully understanding as they go along, turning words into short sentences, and then building them into longer, more complex sentences, until they are conversing in Spanish.\n\nMichel will have listeners formulating their own thoughts and sentences from the very beginning, even if they have never succeeded in learning a language before. Michel has used this very method to teach celebrities such as Mel Gibson, Woody Allen, Barbra Streisand, Warren Beatty, and Princess Grace of Monaco.\n\n\nFrom the Back Cover\n\nNo books. No writing. No drills. And nothing to memorize?ever! With his unique program, Michel Thomas has taught French, Italian, Spanish, and German to celebrities, corporate leaders, and school children?with immediate and amazing results. Now, the Language Teacher to the Stars invites you to join his class!\n\n    * So effortless, natural, and stimulating is Michel&amp;#039;s system for learning, once you get started you won&amp;#039;t want to stop. You will learn in real time?fully understanding as you go along, turning words into short sentences, and then building them into longer, more complex sentences, until you are conversing in a foreign language.\n    * Immediately, you will feel the excitement of understanding and expressing yourself in Spanish. Michel will have you formulating your own thoughts and sentences from the very beginning, even if you have never succeeded in learning a language before.\n    * This Deluxe Edition contains eight hours of instruction on 8 CDs. Starting as a beginner, you can progress to a level of language proficiency that will enable you to converse naturally and communicate comfortably in a wide variety of situations.\n\n      Michel has used this very method to teach celebrities such as Mel Gibson, Woody Allen, Barbra Streisand, Emma Thompson, Warren Beatty, and Princess Grace of Monaco.\n\n      At home or in the car? in any place and at any time? you can learn from a world-class language teacher and become one of Michel&amp;#039;s star students today!\n\n      &quot;Michel Thomas has developed a truly revolutionary method of language instruction. All you have to do is follow his lead: no memorization, homework, or stress. I was amazed by my success using Michel&amp;#039;s method.&quot; -- Warren Keegan, Professor of Business at Pace University in New York\n",
  "parsed": {
    "xt": "urn:btih:03cabd511ccd75b5ada67de553f028e67a9da631",
    "dn": "Learn French with Michel Thomas",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "03cabd511ccd75b5ada67de553f028e67a9da631",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        3,
        202,
        189,
        81,
        28,
        205,
        117,
        181,
        173,
        166,
        125,
        229,
        83,
        240,
        40,
        230,
        122,
        157,
        166,
        49
      ]
    },
    "name": "Learn French with Michel Thomas",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 51,
  "peers": 134,
  "last_updated": "2016-12-26T14:54:50.511Z"
}