{
  "title": "The Complete Jazz Guitar Method by Jody Fisher (4 pdf + 4 cd)",
  "uid": 4819400,
  "size": 289715305,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:046b78e8bc6c64bc44317763f5608be99e4c0688&amp;dn=The+Complete+Jazz+Guitar+Method+by+Jody+Fisher+%284+pdf+%2B+4+cd%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 44,
  "leechers": 0,
  "uploader": "david.o.louco",
  "files": 204,
  "time": 1238681825,
  "description": "The Complete Jazz Guitar Method \nby Jody Fisher \n\n\n\nContents:\n\n\nVol. 1 - Beginning Jazz Guitar (.pdf)+ CD (MP3)\n\nAnyone with a knowledge of basic chords, and guitar scale fingerings can dig right in and start learning to play jazz right away. Spanning from the major scale and basic triad theory all the way up to extended chords and the modes, this book features a full length etude or song to go with every new concept introduced in the book. Clearly organized, each chapter is divided into separate lessons on harmony or improvisation. Beginning Jazz Guitar breaks the age-old tradition of dry, intimidating and confusing jazz books, and provides an actual step-by-step and enjoyable method for learning to play in this style.\n\n\n\nVol. 2 - Intermediate Jazz Guitar (.pdf)+ CD (MP3)\n\nThis book is great for guitarists who have learned the basics of jazz harmony and improvisation. Topics include the ii-V-I progression, creating solo lines, altered chord formulas, and comping in different jazz feels such as Latin, swing, ballad, and even funk. Continuing in the format of Beginning Jazz Guitar, every new concept is accompanied by etudes and songs for practice, and every chapter is clearly divided into lessons on harmony and improvisation. Packed with literally hundreds of chord voicings and improv ideas, this book is a must for any serious student of jazz guitar. All music is shown in standard notation and TAB, and the CD demonstrates the examples in the book.\n\n\n\nVol. 3 - Mastering Chord Melody (.pdf)+ CD (MP3)\n\nLearn to play the harmony, melody, rhythm and bass parts of any song simultaneously! Your guitar will become the ultimate jazz solo instrument when you master the techniques and concepts in this book. This book picks up where the harmony lessons in Intermediate Jazz Guitar leave off. Topics include integrating melody and harmony, developing bass lines, chord enhancement, quartal harmonies and arranging a guitar solo. Concepts are illustrated with lots of examples to practice, including arrangements of some traditional melodies.\n\n\nVol. 4 - Mastering Improvisation (.pdf)+ CD (MP3)\n\nExpand the boundaries of your knowledge and improvisation skills with this exciting book, which picks up where the improv lessons in Intermediate Jazz Guitar leave off. Topics include improvising over altered dominant chords, the diminished scale, the whole-tone scale, targeting the altered chords, revamping licks, modes of the minor scales and more! Loaded with easy-to-read scale diagrams and example phrases, this book is packed with essential information for the improvising jazz guitarist. All music is shown in standard notation and TAB, and the CD demonstrates the examples in the book.\n\n\n\n\nThis is really good stuff\n\nenjoy ;)\n\n\n\nCheck out my other torrents for more music/guitar related stuff ;)",
  "parsed": {
    "xt": "urn:btih:046b78e8bc6c64bc44317763f5608be99e4c0688",
    "dn": "The Complete Jazz Guitar Method by Jody Fisher (4 pdf   4 cd)",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "046b78e8bc6c64bc44317763f5608be99e4c0688",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        4,
        107,
        120,
        232,
        188,
        108,
        100,
        188,
        68,
        49,
        119,
        99,
        245,
        96,
        139,
        233,
        158,
        76,
        6,
        136
      ]
    },
    "name": "The Complete Jazz Guitar Method by Jody Fisher (4 pdf   4 cd)",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 44,
  "peers": 0,
  "last_updated": "2016-12-24T15:48:51.702Z"
}