{
  "title": "Grow a Living Wall (2015).pdf Gooner",
  "uid": 12423469,
  "size": 72612563,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:04e8f829b487c2cc9d67aa015d6b4f4013f05084&amp;dn=Grow+a+Living+Wall+%282015%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 161,
  "leechers": 5,
  "uploader": "GoonerTPB",
  "files": 1,
  "time": 1442337618,
  "description": "Publisher: Cool Springs Press (March 20, 2015)\nLanguage: English\nISBN-10: 1591866243\nISBN-13: 978-1591866244\n\nMake a beautiful, practical, environmentally conscious garden, even in a small space - grow UP with a living wall!\n\nA living wall is a vertical structure, usually outside the home, that is built with live plants growing in containers hung in a decorative arrangement.\n\nSometimes called &quot;Green Walls&quot; and &quot;Vertical Gardens,&quot; living walls are easier than ever to plan and grow! Grow a Living Wall is the first wall-gardening book to focus exclusively on the needs of home gardeners.\n\nMake your vertical garden environmentally friendly and sustainable. It's easy with author Shawna Coronado's help! One of her themed vertical gardens is stocked mostly with flowers to make it a haven for bees and other pollinators. Other gardens are filled with vegetables and herbs so anyone with an outdoor wall can grow their own food - beautifully! Even more gardens promote aromatherapy or medicinal plants. Some are designed to provide a green net of air filtration near a living area, or to protect exterior walls from exposure to direct sunlight, which helps to keep the indoors cool.\n\nIn addition to the comprehensive, step-by-step information that explains the basics of vertical gardening, each of the 20 featured gardens has its own chapter filled with useful tips, stunning photography, and fascinating background stories that point out how much difference a small garden can make. Like author Shawna herself, the gardens you'll find in Grow a Living Wall are positive, life affirming, and sure to produce a smile or two",
  "parsed": {
    "xt": "urn:btih:04e8f829b487c2cc9d67aa015d6b4f4013f05084",
    "dn": "Grow a Living Wall (2015).pdf Gooner",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "04e8f829b487c2cc9d67aa015d6b4f4013f05084",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        4,
        232,
        248,
        41,
        180,
        135,
        194,
        204,
        157,
        103,
        170,
        1,
        93,
        107,
        79,
        64,
        19,
        240,
        80,
        132
      ]
    },
    "name": "Grow a Living Wall (2015).pdf Gooner",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 3,
  "peers": 26,
  "last_updated": "2016-12-26T15:02:56.002Z"
}