{"title":"The.Witcher.2.Assassins.of.Kings-SKIDROW","uid":6397985,"size":15022558807,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:065f60abe875b3a9d4b9bcac0b1bcc9e0e684584&amp;dn=The.Witcher.2.Assassins.of.Kings-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":54,"leechers":11,"uploader":"MAFIAA.","files":-1,"time":1305576653,"description":"                          S  K  I  D  R  O  W\n\n                          .the leading force.\n\n\n\n                           proudly presents\n\n             The Witcher 2: Assassins of Kings (c) Atari\n\n\n\n\n\n  16-05-2011........Release Date &lt;-&gt; Protection.............SecuROM\n\n  RPG..................Game Type &lt;-&gt; Disk(s)..................2 DVD\n\n\n\n\n\n  RELEASE NOTES\n\n\n\n\n\nThe second installment in the RPG saga about the Witcher, Geralt of\n\nRivia, features a thoroughly engrossing, mature storyline defining new\n\nstandards for thought-provoking, non-linear game narration. In addition\n\nto an epic story, the game features an original, brutal combat system\n\nthat uniquely combines tactical elements with dynamic action. A new,\n\nmodern game engine, responsible both for beautiful visuals and\n\nsophisticated game mechanics puts players in the most lively and\n\nbelievable world ever created in an RPG game. A captivating story,\n\ndynamic combat system, beautiful graphics, and everything else that\n\nmade the original Witcher such a great game are now executed in a much\n\nmore advanced and sophisticated way.\n\n\n\nFeatures:\n\n\n\nA truly epic, intense, emotionally charged adventure with non-linear\n\ngame narration. Three independent plot lines with several alternative\n\nevents are dependent on the player s choices and lead to multiple\n\ndifferent game endings and several additional plot forks. This time\n\ngameplay time will be shorter than The Witcher 1, but more intense and\n\npacked with events.\n\n\n\nA complex, realistic and mature story touching upon subject matter\n\nseldom seen in other RPGs, told in a manner that is understandable and\n\nattractive to contemporary gamers. We investigate the assassinations of\n\nthe rulers of the Northern Kingdoms and follow Geralt s personal theme,\n\nin which he's looking for his own identity. Gradually we learn how\n\npowerful forces influence our situation and what role they order us to\n\nplay.\n\n\n\nRich, mature dialogue as found in Andrzej Sapkowski's book series and\n\nThe Witcher 1, presented in highly filmic cutscenes and dialogues\n\nsequences, thanks to a new game engine.\n\n\n\nNew, improved system of flashbacks. Now the reminiscences of Geralt, in\n\nwhich we observe the link between our past choices with current\n\nactions, are realistically and smoothly woven into the gameplay.\n\n\n\nUnique, deep, consistent and rich game world established in a series of\n\nbest-selling books by A. Sapkowski and recreated in the game to provide\n\nan incredible, believable story-driven experience.\n\n\n\nBelievable, true-to-life characters with their own motivations and\n\ngoals. During our journey we meet ordinary men, soldiers, rebels,\n\npowerful mages, rulers and their assassins. Depending on our decisions\n\nwe meet different game characters, and our relationships shape further\n\nactions in the game.\n\n\n\nHighly varied, breathtaking locations, which thanks to the new engine\n\ncreate a cohesive, fully accessible world!\n\n\n\nRich, living world in which every character has their own way of life\n\nand unique occupations. Our actions modify the relationship with the\n\ngame-world population and, in the case of the main plot line, open or\n\nclose the possibilities of interaction with the game world.\n\n\n\nGreater freedom of exploration to provide increased game realism and a\n\nwider range of new tactical options. Geralt will surmount barriers,\n\njump over fences, scale walls and ascend rock formations.\n\n\n\n\n\n  INSTALL NOTES\n\n\n\n\n\n1. Unpack the release\n\n2. Mount or burn image\n\n3. Install (game will auto start with a activation screen, quit that)\n\n4. Run Patcher_EFIGS.exe from the SKIDROW folder on DVD 2\n\n5. Copy all files from the SKIDROW folder on DVD 2 to the The Witcher 2\n\n  installation folder\n\n6. Play the game\n\n7. Support the companies, which software you actually enjoy!\n\n\n\n\n\n  GREETINGS\n\n\n\n\n\n Unleashed - TiNYiSO - MRN - RADIKAL - POSTMORTEM - GENESIS - SHOCK","torrent":{"xt":"urn:btih:065f60abe875b3a9d4b9bcac0b1bcc9e0e684584","amp;dn":"The.Witcher.2.Assassins.of.Kings-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"065f60abe875b3a9d4b9bcac0b1bcc9e0e684584","infoHashBuffer":{"type":"Buffer","data":[6,95,96,171,232,117,179,169,212,185,188,172,11,27,204,158,14,104,69,132]},"announce":[],"urlList":[]}}