{
  "title": "Mr. Mercedes By Stephen King (epub,mobi,pdf)",
  "uid": 10286996,
  "size": 4296145,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:069da09aaf10ce649d29c8a643851d176586a56e&amp;dn=Mr.+Mercedes+By+Stephen+King+%28epub%2Cmobi%2Cpdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 122,
  "leechers": 30,
  "uploader": "maxdesolate",
  "files": 5,
  "time": 1401755381,
  "description": "In a mega-stakes, high-suspense race against time, three of the most unlikely and winning heroes Stephen King has ever created try to stop a lone killer from blowing up thousands.\nIn the frigid pre-dawn hours, in a distressed Midwestern city, hundreds of desperate unemployed folks are lined up for a spot at a job fair. Without warning, a lone driver plows through the crowd in a stolen Mercedes, running over the innocent, backing up, and charging again. Eight people are killed; fifteen are wounded. The killer escapes.\nIn another part of town, months later, a retired cop named Bill Hodges is still haunted by the unsolved crime. When he gets a crazed letter from someone who self-identifies as the perp; and threatens an even more diabolical attack, Hodges wakes up from his depressed and vacant retirement, hell-bent on preventing another tragedy.\nBrady Hartfield lives with his alcoholic mother in the house where he was born. He loved the feel of death under the wheels of the Mercedes, and he wants that rush again. Only Bill Hodges, with a couple of highly unlikely allies, can apprehend the killer before he strikes again. And they have no time to lose, because Brady's next mission, if it succeeds, will kill or maim thousands. Mr. Mercedes is a war between good and evil, from the master of suspense whose insight into the mind of this obsessed, insane killer is chilling and unforgettable.\n\nEPUB,MOBI AND PDF. ",
  "parsed": {
    "xt": "urn:btih:069da09aaf10ce649d29c8a643851d176586a56e",
    "dn": "Mr. Mercedes By Stephen King (epub,mobi,pdf)",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "069da09aaf10ce649d29c8a643851d176586a56e",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        6,
        157,
        160,
        154,
        175,
        16,
        206,
        100,
        157,
        41,
        200,
        166,
        67,
        133,
        29,
        23,
        101,
        134,
        165,
        110
      ]
    },
    "name": "Mr. Mercedes By Stephen King (epub,mobi,pdf)",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 43,
  "peers": 11,
  "last_updated": "2016-12-26T15:16:26.441Z"
}