{"title":"WWE 2K15-RELOADED","uid":11860610,"size":20692343817,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:06ab1a6d2ace1dd1672535c32afd5a90d5720c1e&amp;dn=WWE+2K15-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":505,"leechers":364,"uploader":"HeroMaster","files":2,"time":1430253412,"description":"nERv\n\nWWE 2K15 (c) 2K\n\n04/2015: RELEASE.DATE .. PROTECTION: Steam\n1: DISC(S) .. GAME.TYPE: Action, Simulation\nSports\n\nAbout This Game WWE 2K15 ushers in a new era of WWE video games! WWE 2K15\nbrings the hardest hitting and most fluid WWE gameplay to date, closer than\never to what fans see on WWE TV. With significant gameplay enhancements, a\npresentation overhaul, and all-new MyCAREER and 2K Showcase game modes, WWE\n2K15 delivers the most authentic and action-packed WWE video game experience\nto date\n\nFeel every blow, hear every impact. WWE 2K15. Feel It\n\nIncludes every single piece of downloadable content*:\n* Immediate access to Playable Hulk Hogan and Hollywood Hogan:\n* What'cha gonna do when TWO versions of Hulk Hogan run wild on you? Receive\nHollywood Hulk Hogan, as well as the classic red and yellow Hulk Hogan. *\nImmediate access to Sting Playable Characters Pack:\n* For the first time EVER in a WWE ring, It's showtime! Receive two versions\nof the legend Sting! Play as blonde-haired retro Sting clad in neon colors\nor as the intimidating silent warrior that battled the nWo! * WCW Character\nPack*:\n* During the Monday Night Wars, WCW dominated WWE for 83 straight weeks\nRelive the Monday Night Wars with five of the toughest legends from WCW the\nBelfast Bruiser Fit Finlay, Lord Steven Regal, &quot;the Beast from the East&quot; Bam\nBam Bigelow, Diamond Dallas Page, and &quot;the Total Package&quot; Lex Luger, all in\none add-on pack. WCW...Where the Big Boys Play. * NXT Arrival Character\nPack*:\n* Play as some of the brightest Superstars to ever step foot in an NXT ring\nwith the all new NXT ArRIVAL pack! The future starts now with playable NXT\ncharacters such as Adam Rose, Konnor and Viktor of The Ascension, NXT Diva\nEmma and Former WWE Champion and Monday Night Raw Announcer JBL! * New Moves\nPack*:\n* Gain access to over 30 new moves to add to your arsenal with the WWE 2K15\nNew Moves Pack add-on! Perform exciting new moves like Uso Crazy and the\nSpinning Powerbomb, as well as variations of Bray Wyatt's Sister Abigail and\nCesaro's Gutwrench Suplex. * Accelerator*:\n* Decide the overall rankings and attribute levels of every WWE Superstar\nLegend, and Diva in the game. Unlock every WWE Superstar, Legend, and Diva\nincluding alternate attires and all arenas and championships in WWE 2K15. *\nShowcase One More Match*:\n* Relive the heated Randy Orton and Christian rivalry with hours of new 2K\nShowcase action in One More Match! Battle through epic matches as their story\nis told through your gameplay and historical WWE footage. Also get playable\nWWE Superstars from 2011: Christian, Randy Orton, Edge, Mark Henry and\nSheamus and 2011 arenas: SmackDown, Extreme Rules, Over the Limit and Capitol\nPunishment. * Showcase Hall of Pain*:\n* World's Strongest Slam your way through the competition in this new WWE\n2K15 2K Showcase Hall Of Pain! Relive Mark Henry's rise to dominance from\n2011-2013 through classic WWE footage and bone-crushing matches. Unlock new\nhistorical versions of Mark Henry, Big Show, Kane, The Usos, Sheamus, The\nGreat Khali and more! Also receive playable arenas such as Vengeance(2011)\nand WrestleMania 29. * Showcase Path of the Warrior*:\n* Feel the power of the Ultimate Warrior with the WWE 2K15 Path Of The\nWarrior 2K Showcase! Relive his career through historic WWE footage and\nreceive playable legends such as: Ultimate Warrior, Hulk Hogan, Andr the\nGiant, Sgt. Slaughter, Macho King and more!. Also receive playable arenas\nsuch as: WrestleMania VI, VII and XII; SummerSlam; Saturday Night's Main\nEvent and Madison Square Garden\n*Does not include Paige. Some Content will be available via free download\nSpring 2015\n\n1. Unrar\n2. Burn or mount the image\n3. Install the game\n4. Copy over the cracked content from the /Crack directory on the image to\nyour game install directory\n5. Play the game\n6. Support the software developers. If you like this game, BUY IT!\n\n\nSystem Requirements:\n\n\nOS: 64-bit: Windows Vista SP2 \nProcessor: Core 2 Duo E6600, AMD Athlon 64 X2 5400+ \nMemory: 4 GB RAM \nGraphics: NVIDIA GeForce GTX 450 or AMD Radeon HD 5770, 1GB GDDR (DirectX11 compatible)\nDirectX: Version 11 \nNetwork: Broadband Internet connection \nHard Drive: 22 GB available space \nSound Card: DirectX 9.0c compatible sound card\n\n\nPoster:\n\n &lt;a href=&quot;\nhttp://i.imgur.com/jFJ3BkU.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/jFJ3BkU.png&lt;/a&gt;\n\n\nScreenshots:\n\n &lt;a href=&quot;\nhttp://i.imgur.com/LC5SqRd.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/LC5SqRd.jpg&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://i.imgur.com/kQv96xg.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/kQv96xg.jpg&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://i.imgur.com/QeXDHfR.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/QeXDHfR.jpg&lt;/a&gt;\n\n\nSEED AND ENJOY PIRATES!","torrent":{"xt":"urn:btih:06ab1a6d2ace1dd1672535c32afd5a90d5720c1e","amp;dn":"WWE+2K15-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06ab1a6d2ace1dd1672535c32afd5a90d5720c1e","infoHashBuffer":{"type":"Buffer","data":[6,171,26,109,42,206,29,209,103,37,53,195,42,253,90,144,213,114,12,30]},"announce":[],"urlList":[]}}