{"title":"Pro Evolution Soccer 2012-RELOADED","uid":6743739,"size":6531455952,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:08802d5ce6a450abf66987b80f628390ff1cdf02&amp;dn=Pro+Evolution+Soccer+2012-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":173,"leechers":34,"uploader":"extremezone","files":-1,"time":1318603317,"description":" &lt;a href=&quot;http://www.hotimg.com/direct/GrcMJq8.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.hotimg.com/direct/GrcMJq8.jpg&lt;/a&gt;\n\nScreens:\n &lt;a href=&quot;\nhttp://www.hotimg.com/direct/hJGTDrU.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.hotimg.com/direct/hJGTDrU.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.hotimg.com/direct/vYnrhSV.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.hotimg.com/direct/vYnrhSV.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.hotimg.com/direct/2QTKZ6B.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.hotimg.com/direct/2QTKZ6B.jpg&lt;/a&gt;\n\nAlternative:\n &lt;a href=&quot;\nhttp://www.postimg.com/image/50000/photo-49311.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.postimg.com/image/50000/photo-49311.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.postimg.com/image/50000/photo-49312.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.postimg.com/image/50000/photo-49312.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.postimg.com/image/50000/photo-49313.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.postimg.com/image/50000/photo-49313.jpg&lt;/a&gt;\n\nPro Evolution Soccer 2012-RELOADED\nPro Evolution Soccer 2012 (c) Konami\n\n     10/2011 :..... RELEASE.DATE .. PROTECTION .......: Serial / Securom\n           1 :.......... DISC(S) .. GAME.TYPE ........: Sports\n\n\nPES 2012 continues KONAMI's determination to listen to its fanbase and make\nkey improvements to the aspects the audience demands. Thus, the focus for\nPES 2012 is to ensure the highest level of playability, challenge and\nrealism for the game, whilst also improving the level of control offered to\nusers. Fundamental changes to all areas of its AI have been made following\nuser feedback. Similarly, teamwork is central to how the game moves and\nfeels, enabling fans to replicate anything they would see in a real match.\nActive AI: PES 2012 strives to recreate the movement and team ethic of real\nfootball, and Active AI plays a vital role in this. Players will no longer\nflock to a ball, but will make intelligent runs to create space and draw\nmarkers, while others will make themselves available, instigate runs, and\nvisibly call for the ball. In the box, support players will make diagonal\ndecoy runs, full backs will overlap on the wings and midfielders will\nprovide support from behind the ball. The new Active AI routines ensure the\nflow of a match is more natural, with specific routines for both attack and\ndefence. Hold-up play implemented last year has been improved for easier\ncontrol with more effectiveness. Defending as a unit plays a key role, and\nplayers now hold a tight line, check on the distance between each other,\ntrack back as a unit, and fill in for each other. As individuals they also\nmake better decisions to close space, block and tackle.\n\nJostling: Physicality is a key component in PES 2012, with player strength\none of their key individual attributes, and having a vital effect on how\nthey can use their strength to win the ball in a one-on-one situation.\nPlayers now fall depending on how they are challenged, with more realistic\nanimations used to show the challenges between two jostling players.\n\nGraphics: Several aspects of the game have enjoyed a huge overhaul. Player\nfacial expression is now much richer and the lighting effects are more\nnatural, while new cameras show off the huge variety of pitch-side\nmovement, with more detail on and around the game than ever before.\n\nOff The Ball Control: Equally key to opening up PES 2012 is the ability to\nhighlight any player at any time. A new system has been implemented,\nallowing users to switch players with ease. In defence, the right stick is\nnow used to select any outfield player, while set pieces are also enhanced\nthrough its use. Goal kicks, corners, free kicks and throw-ins now let the\nuser quickly take control of any player off the ball, enabling clever runs\nwhich create space for an attack.\n\nReferee AI: Referees are also crucial to general game flow and their AI has\nbeen greatly enhanced to ensure fewer interruptions to play. Decisions are\nimproved, and advantage is played much more regularly in offside and free\nkick scenarios. As such, refs will only intervene when truly necessary, but\nthey will show cards if necessary once play has broken down.\n\nPass Support: Accessed through the new personal player settings, Pass\nSupport allows users to determine the level of AI assistance when passing\nthe ball. Players can opt for one of five settings from full support, right\nup to full veteran setting which switches off all assistance so that the\ndirection, weight and speed of every pass is at their disposal\n\n2. Burn or mount the image.\n3. Install the game. When prompted for a serial use one of the following:\n 4VRE-P766-LL3F-MYLP-YUTT\n S2D9-M3XC-HE3C-5R9P-TASM\n 9R9U-MUXR-JHTJ-2MFN-F329\n XT44-6AV3-HLEC-23TC-67PR\n SEHM-S2NT-24M7-9LJ4-VP6K\n4. Copy over the cracked content from the Crack dir on the disc to your\n dir. We've also included patch 1.01 and a crack for that.\n5. Play the game. Don't allow it to go online, use the firewall if need be.\n6. Support the software developers. If you like this game, BUY IT!\n\nPro Evolution Soccer 2012-RELOADED Torrent Free Download\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/extremezone/0/7&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/extremezone/0/7&lt;/a&gt;\n\nHow To Get Your Maxspeed (uTorrent)\n\nTorrent Client - Preferences - Bandwidth - Number of connections - Set aprox. 500 for each \nTorrent Client - Preferences - BiTorrent - Protocol Encryption - Forced\nBandwidth Allocation - High (Set download/upload limit - Unlimited)\nStop Other Active Torrents - Start downloading and wait for connections.\nEnjoy and Seed for at least 1:1 ratio. Don't forget to say thanks/leave reviews.\nFor more info,crack only,PATCH,serial,keygen,trainers,CRACKFIX,UPDATES,\nsystem requirements,cheats,NFO,gameplay trailers,free downloads,\npc iso,demos,screenshots,visit some RELEASE SITES or official web pages. \nSearch here for any future updates/working status/etc http://orlydb.com/s/games\nor any other quality PreDatabase, Scene Release &amp; Dupecheck sites.\nStop using stupid av's as AVG reporting false positive viruses-disable or use Nod32","torrent":{"xt":"urn:btih:08802d5ce6a450abf66987b80f628390ff1cdf02","amp;dn":"Pro+Evolution+Soccer+2012-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08802d5ce6a450abf66987b80f628390ff1cdf02","infoHashBuffer":{"type":"Buffer","data":[8,128,45,92,230,164,80,171,246,105,135,184,15,98,131,144,255,28,223,2]},"announce":[],"urlList":[]}}