{"title":"Jinnah  DVDrip","uid":4116883,"size":1206176346,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0950408f8b98850e76e9cc8f5ced7ace81c2f3b6&amp;dn=Jinnah++DVDrip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":52,"leechers":5,"uploader":"Hedgehogstar","files":1,"time":1207355278,"description":"&gt; F i L E i N F O\n&gt;\n&gt; TiTLE......[ Jinnah\n&gt; YEAR.......[ 1998\n&gt; GENRE......[ Historical/ Drama\n&gt; RUNTiME....[ 01:49:05\n&gt; STORE DATE.[ 2005\n\n&gt;\n&gt; AUDiO......[ MP3 48000Hz 256 kb/s VBR (2 chnls)\n&gt; LANGUAGE...[ English\n&gt; ViDEO......[ 1200 kbps DivX 29.97 FPS\n&gt; Q. FRAME...[ 0.176 bits*pixel\n&gt; RESOLUTiON.[ 720 x 480\n&gt; SUBS.......[ None\n&gt; FiLES......[ 1\n&gt; SiZE.......[ 1120 MB\n&gt; SOURCE.....[ NTSC DVD\n\n&gt;Cast\nChristopher Lee ... Mohammed Ali Jinnah\nJames Fox ... Mountbatten\nMaria Aitken ... Edwina\nShashi Kapoor ... Narrator\n\nRichard Lintern ... Jinnah (Younger)\nShireen Shah ... Fatima Jinnah\nRobert Ashby ... Nehru\nIndira Varma ... Ruttie Jinnah\nSam Dastor ... Gandhi\nShakeel ... Liaquat Ali Khan\n\n\n&gt;Description : This film traces the footsteps of one of the forgotten men of history, Mohammed Ali Jinnah (Lee), as he tries to establish a separate state after the British withdrawal from India in 1947. Concerned that their departure will mean his fellow Muslims will not be properly represented in a self-governing, de-colonized country with a large Hindu majority, the eponymous statesmen attempts to create the nation of Pakistan.\nIn order to portray this, this picture strays away from the convention biopic, as it uses a fragmented timeframe and a narrator (Kapoor). His job is to guide a dying Jinnah, who in an unusual twist wakes up shortly after India &amp;#039;s partition in a computer room with his data file missing, through some of the moments of his past life. Only after this, can a decision be made about what will happen to the esteemed diplomat&amp;#039;s eternal soul after his death. Indeed, as we retrace the founder of Pakistan &amp;#039;s steps, he even meets and has discussions with a younger version of himself (Lintern). This adds a surreal quality to the feature, which counteracts the often-wearisome nature of similar celluloid biographies.\nAs we are escorted back and forth in time, we see Jinnah&amp;#039;s fortitude and bravery, as he has to witness the desperation and mayhem of an Indian sub-continent, which is being torn asunder by religious strife. Nowhere are these divisions more apparent than in the region&amp;#039;s old political system. Thus, we see Jinnah in his younger days, as an ally of Gandhi (Sam Dastor) and Nehru (Robert Ashby) in the Indian National Congress. However, once he believes that this body is no longer listening to the voice of the people in his particular faith, he leaves and helps to re-organise the Muslim League. Eventually, under his leadership, it is this assembly that will push for an independent state.\nBy depicting Pakistan &amp;#039;s first governor-general in this way, this movie is a repudiation of Richard Attenborough&amp;#039;s Oscar-laden epic Ghandi. Although his film undoubtedly had its merits, it characterized Jinnah as a sulking villain, who pushed ahead with separation because of a personal enmity with Gandhi and Nehru, and for political self-aggrandizement. Here then, we are offered a more rounded view of the former head of state&amp;#039;s qualities. However, despite this, the film&amp;#039;s director, Jamil Dehlavi, has not spared us from the main character&amp;#039;s contradictions and peccadilloes. Thus, Jinnah disowns his daughter for marrying a Parsee even though her mother and his wife was one too, despite the fact he made her convert to the Muslim faith.\nEven though Jinnah&amp;#039;s imperfections are shown throughout the movie, it can perhaps still be criticized for making him appear to be too much of a Latter-day Saint. Nevertheless, in the film&amp;#039;s defense, extensive research was carried out to try and delineate the story with as much verisimilitude as possible. Nowhere is this authenticity more apparent than in the representation of the Mountbatten&amp;#039;s. Louis (Fox) is a complete cad in all but name, who is a metaphor for an archaic, callous Britain , which carved up the world as if it was a giant chocolate cake. Whilst his wife (Aitken) is symbolically dragging her country through the mire as she conducts a seedy affair with Nehru.\nFrom a visual point-of-view, Nic Knowland&amp;#039;s cinematography is striking. Different mixtures of lush green fauna and dirt-brown roads highlight the Indian sub-continent&amp;#039;s beauty, whilst its gruesome underbelly is illustrated by the only reds on view: the blood-drenched victims of the religious conflict. An evocative soundtrack that blends Eastern and Western sounds skillfully augments this juxtaposition of extreme pathos and idyllic scenery.\nAll of the acting in the movie is outstanding. None more so than that of Christopher Lee: his mesmerizing performance as Jinnah adds gravitas to the whole picture. In essence, by drawing us into the theological conflict through the eyes of Pakistan &amp;#039;s foremost politician, Dehlavi makes us vividly aware of the carnage and loss that resulted from a legacy of colonialism and partition. Unfortunately, the problems of this hasty and blundering split are still with us today, as the intransigent rancor between India and Pakistan over Kashmir, and a whole host of other issues testifies.\n\n &lt;a href=&quot;\nhttp://www.amazon.co.uk/Jinnah-Christopher-Lee/dp/B00032Q52C&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.co.uk/Jinnah-Christopher-Lee/dp/B00032Q52C&lt;/a&gt;","torrent":{"xt":"urn:btih:0950408f8b98850e76e9cc8f5ced7ace81c2f3b6","amp;dn":"Jinnah++DVDrip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0950408f8b98850e76e9cc8f5ced7ace81c2f3b6","infoHashBuffer":{"type":"Buffer","data":[9,80,64,143,139,152,133,14,118,233,204,143,92,237,122,206,129,194,243,182]},"announce":[],"urlList":[]}}