{"title":"Theme Hospital [1997][PC][GOG]","uid":7194185,"size":175367198,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:09a3ab5926598e5b3e530f90405cdf74212055f7&amp;dn=Theme+Hospital+%5B1997%5D%5BPC%5D%5BGOG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":145,"leechers":2,"uploader":"ontotita","files":5,"time":1334739368,"description":"What's cool about it:\n\n  ï¿½ Polished &amp; detailed management sim with extra helpings of crazy.\n  ï¿½ Hilarious humour will accompany you throughout the entire game, in this strange hospital of yours there is always something weird and funny going on.\n  ï¿½ Be everything the national health care system shouldn't be; there is no place for mercy and altruism in this game - you canï¿½t buy yourself a new car with that, can you?\n\nOverview:\nIt's a matter of laugh or death in Theme Hospitalï¿½, another installment of the Theme series. Design, maintain and manage a hi-tech hospital facility, making the most of limited resources and turning cures into cash. The Grim Reaper stalks the corridors, the ill have some very odd ailments, and the staff want to play doctors and nurses together. No matter how you look at it, you're in control of a very sick hospital.\n\nIf there is one word that describes Theme Hospital then it has to be ï¿½hilarious.ï¿½ Almost everything in this game is made with great dose of humour. You might think that someone's illness is not a laughing matter but wait till you see a patient with KingComplex dressed as Elvis or serious case of Hairyitis caused from prolonged exposure to the moon. Finding treatments for such diseases is a part of your job, but thereï¿½s no prescription to cure the insanity that may result from trying to figure out those cures. You start off small with an empty building, a few doctors, a general diagnostic, a pharmacy, a reception desk, and a few other necessities. From there itï¿½s up to you to move your way up in the health care industry.\n\nA hospital simulator is not something you might consider a good theme for a game but the guys from Bullfrog Productions were famous for creating innovative and fun titles from the craziest idea--and Theme Hospital no exception. This game is a piece of art and definitely the best ï¿½hospitalï¿½ simulation so check it out. Our diagnosis: fun!\n\nBonus content included for FREE with purchase:\n    * manual\n    * 2 avatars\n\nAge requirements: ESRB Rating: EVERYONE with Comic Mischief.\n\nInstallation: Just click the installer then PLAY.\n","torrent":{"xt":"urn:btih:09a3ab5926598e5b3e530f90405cdf74212055f7","amp;dn":"Theme+Hospital+%5B1997%5D%5BPC%5D%5BGOG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09a3ab5926598e5b3e530f90405cdf74212055f7","infoHashBuffer":{"type":"Buffer","data":[9,163,171,89,38,89,142,91,62,83,15,144,64,92,223,116,33,32,85,247]},"announce":[],"urlList":[]}}