{"title":"Data Mining: The Textbook [2015] [PDF]","uid":12171022,"size":17266727,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0a064ae49699d2df97102e6d737d7657562ef1c8&amp;dn=Data+Mining%3A+The+Textbook+%5B2015%5D+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":37,"leechers":1,"uploader":"NoctDeath","files":3,"time":1438184912,"description":"Title: Data Mining: The Textbook \nAuthor: Charu Aggarwal \nFormat: PDF \nHardcover: 734 pages \nPublisher: Springer; 2015 edition (April 14, 2015) \nLanguage: English \nISBN: 978-3319141411 \n\n\nThis textbook explores the different aspects of data mining from the fundamentals to the complex data types and their applications, capturing the wide diversity of problem domains for data mining issues. It goes beyond the traditional focus on data mining problems to introduce advanced data types such as text, time series, discrete sequences, spatial data, graph data, and social networks. Until now, no single book has addressed all these topics in a comprehensive and integrated way. The chapters of this book fall into one of three categories:\n\n- Fundamental chapters: Data mining has four main problems, which correspond to clustering, classification, association pattern mining, and outlier analysis. These chapters comprehensively discuss a wide variety of methods for these problems.\n- Domain chapters: These chapters discuss the specific methods used for different domains of data such as text data, time-series data, sequence data, graph data, and spatial data.\n- Application chapters: These chapters study important applications such as stream mining, Web mining, ranking, recommendations, social networks, and privacy preservation. The domain chapters also have an applied flavor.\n\nAppropriate for both introductory and advanced data mining courses, Data Mining: The Textbook balances mathematical details and intuition. It contains the necessary mathematical details for professors and researchers, but it is presented in a simple and intuitive style to improve accessibility for students and industrial practitioners (including those with a limited mathematical background). Numerous illustrations, examples, and exercises are included, with an emphasis on semantically interpretable examples","torrent":{"xt":"urn:btih:0a064ae49699d2df97102e6d737d7657562ef1c8","amp;dn":"Data+Mining%3A+The+Textbook+%5B2015%5D+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a064ae49699d2df97102e6d737d7657562ef1c8","infoHashBuffer":{"type":"Buffer","data":[10,6,74,228,150,153,210,223,151,16,46,109,115,125,118,87,86,46,241,200]},"announce":[],"urlList":[]}}