{
  "title": "[NubileFilms] Jillian Janson, Mia Malkova (Swingers / 08.11.2015",
  "uid": 12217878,
  "size": 358834133,
  "categoryP": "porn",
  "categoryS": "movies",
  "magnet": "?xt=urn:btih:0aa5acd86f1e5680e9a85487863596609ce6c557&amp;dn=%5BNubileFilms%5D+Jillian+Janson%2C+Mia+Malkova+%28Swingers+%2F+08.11.2015&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 357,
  "leechers": 64,
  "uploader": "chkm8te",
  "files": 1,
  "time": 1439288509,
  "description": "[NubileFilms] Jillian Janson, Mia Malkova (Swingers / 08.11.2015)\n\nMia Malkova and Jillian Janson are dressed in lingerie and ready to play! Getting down on her hands and knees on the bed, Mia does a little booty shake while Jillian lets her hips sway as she stands nearby. When they can't resist the allure of each other's bodies a moment longer, Jillian joins Mia on the bed so that they can work each other out of their bras in between searing kisses.\n\nThat's how Johnny Castle finds them, and without a moment's hesitation the girls invite him to join in for some pussy party fun. They lie down on the bed side by side and peel off their thongs in unison to bare their landing strip pussies for Johnny's pleasure. He dives in moments later, burying his face in Mia's soft twat.\n\nMia's soft whimpers fill the room, making it a no-brainer for Johnny to keep up his pussy feast while Jillian finishes removing Mia's clothes. When Johnny leans back and slips two fingers into Mia's slick slit so that he can drive her to the first climax of the day and then pull them out for Jillian to lick clean.\n\nTurning their attention to Jillian, Jonny and Mia combine forces to go hard and fast at her twat. Johnny slides his fingers deep into her juicy channel while Mia rubs Jillian's clit with the same fast and furious pace. When Johnny disengages so that he can suck on Jillian's toes, Mia uses her magic fingers in place of her man's.\n\nNow that both girls are nude and fully warmed up, they turn their attention to Johnny. Laying him down on the bed, they peel off his briefs and then lean forward to enjoy a mutually pleasurable double blowjob. They alternate between working together and individually, and even explore some acrobatic positions, but their ultimate goal is to get Johnny's fuck stick nice and hard for their enjoyment.\n\nJillian is the first to brave the sex swing that has waited in the wings for their attention. Climbing into the sling, she leans into Mia for support and then spreads her legs for Johnny to press his cock deep into her horny snatch. The swing keeps her at the perfect height for Ryan to go all out pounding that creamy pussy, especially once Mia helps to adjust Jillian's position so that she is resting on her back instead of her bottom. That adjustment puts Jillian's face at perfect pussy licking level so that the horny coed can eat out Mia's pussy while having her own twat filled.\n\nMia loves the feel of Jillian's lips on her pussy, but she wants a turn on the swing, too! Using the straps for support, she turns her back to Johnny and gasps her approval when he slips into her dripping fuck hole from behind. The swing holds her steady while Johnny delivers a proper pussy pounding that leaves Jillian breathless and throbbing her ecstasy.\n\nThe girls take a break from the swing when they lay Johnny down on the bed so that Mia can go for a stiffie ride while Jillian mirrors her movements facing the other way. The girls switch after a few hot moments, with Mia pressing Johnny's cock backwards so that he fills and fucks Jillian's twat instead of hers for a few strokes before they switch again. That kicks off a booty bumping fuck fest as the girls each thrust their hips in time so that their bottoms bump with the force of their strokes.\n\nAs Johnny grows close to the end of his endurance, the girls know what they have to do. Arranging themselves on either side of Jonny's dick, they use their hands and mouths to coax out an explosive climax that fills Mia's mouth with creamy goodness. The girls exchange a lingering kiss so that Jillian can share in Johnny's salty surprise, ending their lovemaking with a smile.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=8z1dbnwagh28lt1d2am1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=8z1dbnwagh28lt1d2am1.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=sp6slsrdgbmbo20f197v.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=sp6slsrdgbmbo20f197v.jpg&lt;/a&gt;",
  "parsed": {
    "xt": "urn:btih:0aa5acd86f1e5680e9a85487863596609ce6c557",
    "dn": "[NubileFilms] Jillian Janson, Mia Malkova (Swingers / 08.11.2015",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "0aa5acd86f1e5680e9a85487863596609ce6c557",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        10,
        165,
        172,
        216,
        111,
        30,
        86,
        128,
        233,
        168,
        84,
        135,
        134,
        53,
        150,
        96,
        156,
        230,
        197,
        87
      ]
    },
    "name": "[NubileFilms] Jillian Janson, Mia Malkova (Swingers / 08.11.2015",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 421,
  "peers": 20,
  "last_updated": "2016-12-24T16:35:46.321Z"
}