{
  "title": "Connectify Hotspot &amp; Dispatch Pro 9.1.0.3270",
  "uid": 16035732,
  "size": 25954394,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:0aee8d12228c799ed129b9c245b654bb8fac1bd2&amp;dn=Connectify+Hotspot+%26amp%3B+Dispatch+Pro+9.1.0.3270&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 161,
  "leechers": 26,
  "uploader": "0Fallen173c",
  "files": 9,
  "time": 1476480949,
  "description": "Connectify Hotspot &amp; Dispatch Pro 9.1.0.3270 | 10 Mb\r\n\r\nConnectify Hotspot lets you share your computer's Internet connection with other devices over Wi-Fi. Works with any Internet connection including Wi-Fi, Ethernet, cable, DSL, 3G, 4G, even tethered cellphones! As long as your computer is online, your other nearby devices - and friends and colleagues - will be, too.\r\n\r\nShare any Connection with any Device\r\nGot a 3G or 4G adapter for your laptop How about a tethering plan for your mobile phone With Connectify Hotspot PRO, all your other Wi-Fi enabled devices can use those connections too. Gain all the benefits of a travel router right inside your PC and start sharing the Internet with tablets, media players, e-readers, other laptops - you name it.\r\n\r\nDrag and Drop to Share Files\r\nConnectify Hotspot's Fling feature lets you easily send any file from one device to another within Wi-Fi range. Stop emailing files to yourself and passing USB drives. You don't even need an Internet connection. Even works with mobile phones.\r\n\r\nConnectify Dispatch is an easy-to-use software load balancer that lets you use from all your computer's Internet connections at the same time. Got Wi-Fi AND 4G Two Wi-Fi adapters Ethernet AND 3G Connectify Dispatch will work with any and all of these technologies to increase your bandwidth.\r\n\r\nTorrential Torrents, Whirlwind Web\r\nConnectify Dispatch is particularly well-suited for activities that involve downloading multiple files such as BitTorrent and web browsing. While a single large stream like Netflix can't be split across multiple Internet connections with Connectify Dispatch, it will be assigned to the fastest one while other requests will be intelligently routed to other connections.\r\n\r\nUse Data, not Dollars\r\nWith Connectify Dispatch's metered connections you can avoid costly overages by assigning bandwidth caps to your expensive 3G and 4G connections. Additionally, by setting their Priority level to Backup, Connectify Dispatch will only route traffic through them if your Primary connections fail. Fast, smart, AND frugal",
  "parsed": {
    "xt": "urn:btih:0aee8d12228c799ed129b9c245b654bb8fac1bd2",
    "dn": "Connectify Hotspot &amp; Dispatch Pro 9.1.0.3270",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "0aee8d12228c799ed129b9c245b654bb8fac1bd2",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        10,
        238,
        141,
        18,
        34,
        140,
        121,
        158,
        209,
        41,
        185,
        194,
        69,
        182,
        84,
        187,
        143,
        172,
        27,
        210
      ]
    },
    "name": "Connectify Hotspot &amp; Dispatch Pro 9.1.0.3270",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 2,
  "peers": 2,
  "last_updated": "2016-12-26T15:48:34.540Z"
}