{"title":"Lego.Star.Wars.The.Complete.Saga.PC.Game(djDEVASTATEâ„¢)","uid":5738081,"size":4480292470,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0b723d1d6dbafac918cfc8923a4d1ab5314f2922&amp;dn=Lego.Star.Wars.The.Complete.Saga.PC.Game%28djDEVASTATE%E2%84%A2%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":156,"leechers":23,"uploader":"djDEVASTATE2009","files":8,"time":1280894554,"description":"Building on the success of both Lego Star Wars videogames, Lego Star Wars: The Complete Saga enables families to play through the events of all six Star Wars movies in one videogame for the first time ever. Motion-sensitive inputs give you exciting new ways to control your Lego Star Wars characters, while also adding new characters, new levels and new features. The upgraded Character Customizer includes all Prequel Trilogy characters for the first time, while also expanding its customization options well beyond those in Lego Star Wars II, for millions more possibilities. Create cross-Trilogy mash-up characters like Han Windu and Lando Amidala New game features include enhanced Force powers, new power-ups, and a new Challenge Mode Levels from the original Lego Star Wars are revamped to meet the game play evolutions of Lego Star Wars II \n\n\n\n\n* Commemorate the 30th anniversary of Star Wars by playing through the events of all six Star Wars movies in one   videogame for the first time ever\n* Solve puzzles that encourage creative thinking through the use of teamwork and unique building situations\n* New levels, new characters and new features join the fun, creativity and humor that made the first two Lego Star   Wars games such huge hits\n* New levels, such as Episode II's never-before-played high-speed pursuit of bounty hunter Zam Wessell, further   complete the entire Star Wars story\n* New playable characters like Watto, Zam Wessell, Boss Nass and more bring the total count to over 160\n\n\n\nExtract Archive To Any Desired Directory With Winrar Or 7zip etc.........\n\n\nNO INSTALL JUST EXTRACT AND PLAY \n\nStart Game With &quot;LEGOStarWarsSaga.exe&quot; \n\n\nENJOY AND PLEASE SEED\n\n\n\n","torrent":{"xt":"urn:btih:0b723d1d6dbafac918cfc8923a4d1ab5314f2922","amp;dn":"Lego.Star.Wars.The.Complete.Saga.PC.Game%28djDEVASTATE%E2%84%A2%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b723d1d6dbafac918cfc8923a4d1ab5314f2922","infoHashBuffer":{"type":"Buffer","data":[11,114,61,29,109,186,250,201,24,207,200,146,58,77,26,181,49,79,41,34]},"announce":[],"urlList":[]}}