{
  "title": "Forgotten Genocides: Oblivion, Denial, and Memory",
  "uid": 15896883,
  "size": 1391519,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:0c459981d02c974089bb84632c3ef59fc0283057&amp;dn=Forgotten+Genocides%3A+Oblivion%2C+Denial%2C+and+Memory&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 55,
  "leechers": 1,
  "uploader": "marty14",
  "files": 1,
  "time": 1474818244,
  "description": "Forgotten Genocides: Oblivion, Denial, and Memory - René Lemarchand (ed.) [epub]\r\n\r\nUnlike the Holocaust, Rwanda, Cambodia, or Armenia, scant attention has been paid to the human tragedies analyzed in this book. From German Southwest Africa (now Namibia), Burundi, and eastern Congo to Tasmania, Tibet, and Kurdistan, from the mass killings of the Roms by the Nazis to the extermination of the Assyrians in Ottoman Turkey, the mind reels when confronted with the inhuman acts that have been consigned to oblivion.\r\n\r\nForgotten Genocides: Oblivion, Denial, and Memory gathers eight essays about genocidal conflicts that are unremembered and, as a consequence, understudied. The contributors, scholars in political science, anthropology, history, and other fields, seek to restore these mass killings to the place they deserve in the public consciousness. Remembrance of long forgotten crimes is not the volume's only purpose—equally significant are the rich quarry of empirical data offered in each chapter, the theoretical insights provided, and the comparative perspectives suggested for the analysis of genocidal phenomena. While each genocide is unique in its circumstances and motives, the essays in this volume explain that deliberate concealment and manipulation of the facts by the perpetrators are more often the rule than the exception, and that memory often tends to distort the past and blame the victims while exonerating the killers.\r\n\r\nAlthough the cases discussed here are but a sample of a litany going back to biblical times, Forgotten Genocides offers an important examination of the diversity of contexts out of which repeatedly emerge the same hideous realities",
  "parsed": {
    "xt": "urn:btih:0c459981d02c974089bb84632c3ef59fc0283057",
    "dn": "Forgotten Genocides: Oblivion, Denial, and Memory",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "0c459981d02c974089bb84632c3ef59fc0283057",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        12,
        69,
        153,
        129,
        208,
        44,
        151,
        64,
        137,
        187,
        132,
        99,
        44,
        62,
        245,
        159,
        192,
        40,
        48,
        87
      ]
    },
    "name": "Forgotten Genocides: Oblivion, Denial, and Memory",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 56,
  "peers": 39,
  "last_updated": "2016-12-24T16:48:59.679Z"
}