{
  "title": "3D Girl Evolution (aka 3D Girl Custom Evolution",
  "uid": 9410835,
  "size": 1895460760,
  "categoryP": "porn",
  "categoryS": "games",
  "magnet": "?xt=urn:btih:0c97fae8e882807c75ad35fcb6da1f769c3fda26&amp;dn=3D+Girl+Evolution+%28aka+3D+Girl+Custom+Evolution&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 56,
  "leechers": 6,
  "uploader": "kealkeal",
  "files": 14,
  "time": 1388286576,
  "description": "3D Girl Evolution, the successor to the long-running hentai PC game, 3D Custom Girl.  While the original game had you dress up a custom-created girl, then place her in a setting and perform adulterated actions with a transparent male character, this new version has you playing the male character.\n\nYou have a house, and you have a wife.  Find her in the house at the start of the game, and you can customize her to your liking.  Have her follow you through the game by holding hands, and you can take her out of the house, to meet nearly 2 dozen female characters, sprawled out over a beautiful japanese island landscape - a school, a hospital, a shrine, an inn... and more!  Interact with these NPCs by yourself, or have threesomes including your wife!  Level-up your wife (currently the maximum level is 3) by having intercourse with her and ejaculating inside of her over and over.  Future DLCs may expand the limit of level 3, but who knows?\n\nA great successor to the original.\n\nStep-by-step instructions included to get this game running on Windows 8.  Should work find on Windows 7 by following the same instructions.  I'll try to help anyone with installation problems, but please... try to do your best to follow the instructions.  I can only help to the limit of my own knowledge, and I'm not a computer guru!\n\nFiles include the installation files, the discontinued AppLocale program (needed to save your games and characters but not needed if you're just checking out the game) and the few essential upgrades and mods.  All you can get up to the date of this posting.\n\nEnjoy!",
  "parsed": {
    "xt": "urn:btih:0c97fae8e882807c75ad35fcb6da1f769c3fda26",
    "dn": "3D Girl Evolution (aka 3D Girl Custom Evolution",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "0c97fae8e882807c75ad35fcb6da1f769c3fda26",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        12,
        151,
        250,
        232,
        232,
        130,
        128,
        124,
        117,
        173,
        53,
        252,
        182,
        218,
        31,
        118,
        156,
        63,
        218,
        38
      ]
    },
    "name": "3D Girl Evolution (aka 3D Girl Custom Evolution",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 94,
  "peers": 30,
  "last_updated": "2016-12-26T16:02:07.053Z"
}