{"title":"Pink Floyd - The Endless River (Limited Edition) mp3 320k 2014","uid":11449217,"size":157500701,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0cdba36e3115528274f71253a84e776df391b8a1&amp;dn=Pink+Floyd+-+The+Endless+River+%28Limited+Edition%29+mp3+320k+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":83,"leechers":3,"uploader":"analogkid6103","files":22,"time":1415874560,"description":"he Endless River is the fifteenth and final studio album by the British progressive rock band Pink Floyd. It was released by Parlophone and Columbia Records in Friday-release countries on 7 November 2014 and in the United Kingdom and United States on 10 November 2014. It is Pink Floyd's first and only studio album since the death of keyboardist and founding member Richard Wright, who appears posthumously, and the third by the David Gilmour-led Pink Floyd after Roger Waters' departure in 1985. It is also the first and only Pink Floyd album distributed by Parlophone and Warner Bros. Records following the purchase of EMI and its assets by the Universal Music Group in 2012, their transfer to Parlophone and the purchase of Parlophone by Warner Bros. in 2013.\nTrack listing\nimage\nAll tracks produced by David Gilmour, Phil Manzanera, Youth and Andy Jackson\nSide one\nNo. Title Writer(s) Length\n1. &quot;Things Left Unsaid...&quot; David Gilmour, Richard Wright 4:24\n2. &quot;It's What We Do&quot; Gilmour, Wright 6:21\n3. &quot;Ebb and Flow&quot; Gilmour, Wright 1:50\nTotal length:\n12:35\nSide two\nNo. Title Writer(s) Length\n4. &quot;Sum&quot; Gilmour, Nick Mason, Wright 4:49\n5. &quot;Skins&quot; Gilmour, Mason, Wright 2:37\n6. &quot;Unsung&quot; Wright 1:06\n7. &quot;Anisina&quot; Gilmour 3:15\nTotal length:\n11:47\nSide three\nNo. Title Writer(s) Length\n8. &quot;The Lost Art of Conversation&quot; Wright 1:43\n9. &quot;On Noodle Street&quot; Gilmour, Wright 1:42\n10. &quot;Night Light&quot; Gilmour, Wright 1:42\n11. &quot;Allons-y (1)&quot; Gilmour 1:56\n12. &quot;Autumn '68&quot; Wright 1:35\n13. &quot;Allons-y (2)&quot; Gilmour 1:35\n14. &quot;Talkin' Hawkin'&quot; Gilmour, Wright 3:25\nTotal length:\n13:38\nSide four\nNo. Title Writer(s) Length\n15. &quot;Calling&quot; Gilmour, Anthony Moore 3:38\n16. &quot;Eyes to Pearls&quot; Gilmour 1:51\n17. &quot;Surfacing&quot; Gilmour 2:46\n18. &quot;Louder than Words&quot; Gilmour, Polly Samson 6:32\nTotal length:\n14:47\nThe Endless River deluxe edition \t\nNo. \tTitle \tWriter(s) \tLength \t\n19. \t&quot;TBS9&quot;   \tGilmour, Wright \t2:27\n20. \t&quot;TBS14&quot;   \tGilmour, Wright \t4:11\n21. \t&quot;Nervana&quot;   \tGilmour \t5:39\nDescribed as a &quot;swan song&quot; for Wright, The Endless River mostly comprises instrumental and ambient music. It is based on 20 hours of unreleased material the band wrote, recorded and produced with Wright during sessions for Pink Floyd's previous studio album The Division Bell (1994). Work on the album was completed in 2013 and 2014 in Gilmour's studios the Astoria and Medina Studios in Hove, England. It was produced by Gilmour, Youth, Andy Jackson and Phil Manzanera.\n\nInformation about the The Endless River was leaked via social media, after which Pink Floyd made a formal announcement. The band, Parlophone and Columbia Records (outside Europe) launched a promotional campaign in the lead-up to its release with television advertisements and installations of the album artwork placed in cities around the world, including London, New York, Paris, Berlin and Milan. The cover concept is by Ahmed Emad Eldin with sleeve design by Stylorouge. Aubrey Powell served as creative director for the artwork. The album received mixed reviews.Composition\n\nThe Endless River has been described by the band as a predominantly ambient and instrumental album. The closing track &quot;Louder Than Words&quot; is the album's only song to have a lead vocal track, with lyrics by David Gilmour's wife Polly Samson, who also shares writing credits on Pink Floyd's The Division Bell and Gilmour's On an Island. In a statement, Mason described the album as a tribute to Wright: &quot;I think this record is a good way of recognising a lot of what he does and how his playing was at the heart of the Pink Floyd sound. Listening back to the sessions, it really brought home to me what a special player he was.&quot;The Endless River is based on material recorded in 1993 and 1994 during the Division Bell sessions at Britannia Row Studios and aboard the Astoria, where Pink Floyd's A Momentary Lapse of Reason (1987) and David Gilmour's On an Island (2006) were also partly recorded. In 1994, Wright said the band had recorded &quot;four 90-minute DATs of five or six hours of music. The hardest thing was to throw things out and decide what we're gonna work on ... but they are not lost. They are in my head, they are in Dave's head.&quot; In the same year, Pink Floyd engineer Andy Jackson edited the material, described by Mason as ambient music, to an hour-long composition tentatively titled The Big Spliff. Pink Floyd decided not to release it.\n\nIn 2012, Gilmour and Mason decided to revisit recordings made with Wright prior to his death in 2008 to create a new Pink Floyd album. Gilmour said: &quot;We listened to over 20 hours of the three of us playing together and selected the music we wanted to work on for the new album. Over the last year we've added new parts, re-recorded others and generally harnessed studio technology to make a 21st century Pink Floyd album. With Rick gone, and with him the chance of ever doing it again, it feels right that these revisited and reworked tracks should be made available as part of our repertoire.&quot; Only a small part from The Big Spliff was used.\n\nGilmour asked guitarist and producer Phil Manzanera, who played on and co-produced On an Island, to work on the material. Manzanera listened to 20 hours of recordings and, with Jackson and engineer Damon Iddins, spent six weeks assembling four 14-minute pieces. Gilmour gave the first two of these pieces to producer Youth, who added guitar and bass parts. In November 2013, Gilmour led sessions with Manzanera, Youth and Jackson to record material with Mason, saxophonist Gilad Atzmon and bassist Guy Pratt. Backing vocalists including Durga McBroom recorded parts and Gilmour recorded lead vocals on &quot;Louder than Words&quot;, with lyrics written by Gilmour's wife Polly Samson. The final album comprises four pieces each taking a side of the record, with parts of a 1968 Wright rehearsal and additional drum and guitar overdubs. Mason stated that unreleased sessions Wright recorded for Gilmour's solo projects could appear on Gilmour's future solo albums.\nGilmour stated that there will be no tour to support the album, saying it was &quot;impossible&quot; without Wright.\nBassist and songwriter Roger Waters, who left Pink Floyd in 1985, was not involved in the recording. Thus Pink Floyd &quot;A Waterless River&quot;","torrent":{"xt":"urn:btih:0cdba36e3115528274f71253a84e776df391b8a1","amp;dn":"Pink+Floyd+-+The+Endless+River+%28Limited+Edition%29+mp3+320k+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0cdba36e3115528274f71253a84e776df391b8a1","infoHashBuffer":{"type":"Buffer","data":[12,219,163,110,49,21,82,130,116,247,18,83,168,78,119,109,243,145,184,161]},"announce":[],"urlList":[]}}