{
  "title": "Penumbra: Black Plague",
  "uid": 6156563,
  "size": 576247422,
  "categoryP": "games",
  "categoryS": "pc",
  "magnet": "?xt=urn:btih:0ce9b52e2c1561c0a68ff5dce35b4f62133784f3&amp;dn=Penumbra%3A+Black+Plague&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 48,
  "leechers": 4,
  "uploader": "IronBox",
  "files": 1,
  "time": 1297057850,
  "description": "Penumbra is a first person horror adventure focussing on story, immersion and puzzle solving. Violence and combat is hardly an option - the player has to use wits to guide Philip through his final test, and this makes the series unique in offering a truly dangerous and terrifying experience.\n\nPlayed from a first person perspective and powered by a 3D engine utilising cutting edge technology, Penumbra is a true advancement to the adventure genre. The unique physics system allows for true environmental interaction: The player can open drawers, pull levers, pick up objects and manipulate those objects in 3D space - all using natural mouse movements, creating a highly interactive and immersive game world.\n\nThe Penumbra series' central character, Philip, is realistically vulnerable, while enemies are fierce and intelligent. Any object can be picked up and thrown in defence, but the end result might only be to buy some time, or more likely, anger enemies further. Avoiding, outwitting and sneaking past enemies entirely provide the best chance of survival.\n\nPenumbra will put players on edge like never before as they explore bizarre and mysterious environments, the unknown awaiting them behind every corner. The world is detailed both in terms of graphical fidelity and narrative character - The Penumbra Series is a horrific experience that will grip players from its opening thrills to it chilling denouement.\n\n*This is not mine, I just simplified it*\n\nINSTALL INSTRUCTIONS\n\n- Just double click on the penumbra_bp_ger.exe\n- Then apply the crack to C:\\Program Files (x86)\\Paradox Interactive\\Penumbra Black Plague\\redist\n\nREMEMBER TO SEED!",
  "parsed": {
    "xt": "urn:btih:0ce9b52e2c1561c0a68ff5dce35b4f62133784f3",
    "dn": "Penumbra: Black Plague",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "0ce9b52e2c1561c0a68ff5dce35b4f62133784f3",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        12,
        233,
        181,
        46,
        44,
        21,
        97,
        192,
        166,
        143,
        245,
        220,
        227,
        91,
        79,
        98,
        19,
        55,
        132,
        243
      ]
    },
    "name": "Penumbra: Black Plague",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 15,
  "peers": 43,
  "last_updated": "2016-12-26T16:04:23.461Z"
}