{"title":"Castlevania.Lords.of.Shadow.2.Repack-R.G. Mechanics","uid":9851630,"size":5238235120,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0d131e78a4042aad31bb2bf13f57a593294be933&amp;dn=Castlevania.Lords.of.Shadow.2.Repack-R.G.+Mechanics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":86,"leechers":14,"uploader":"Taker009","files":-1,"time":1396155253,"description":"Castlevania.Lords.of.Shadow.2.Repack-R.G. Mechanics\n\nReleased: 2014 \nGenre: Action, Slasher, 3D, 3rd Person \nPublication Type: Repack \nPlatform: PC \nLanguage: RUS | ENG \nVoice set Language: ENG \nTablet: CODEX / SKIDROW \n\n\nSYSTEM REQUIREMENTS \n\nOperating system: Windows XP Service Pack 3 / Windows 7 / Windows 8 \nProcessor: 2.4Ghz Intel Core 2 Duo or AMD equivalent \nMemory: 2 GB \nVideo Card: Direct X9 compatible video card 512Mb RAM \nSound Card: Sound device compatible with DirectX Â® 9.0 \nFree space on hard disk: 6.5 GB \n\n\nDESCRIPTION \n_______________ \n&quot;He who fights with monsters will not be able to keep yourself to yourself  \ndo not become a monster.&quot; The first part of the saga of Castlevania: Lords \nof Shadow revealed the secret of the Belmont clan. In the continuation of \nthe history you face new challenges and unexpected plot twists. In the \nfinal grand saga Dracula returns - weakened and eager to get rid of the \nshackles of immortality. However, a new threat will make a great vampire \nlook for ways to regain their strength. The key to this - in his own castle. \nBut do not hurry to write off the Belmont clan ... \n\n\nGame Features:\n\nSequel of the famous game created in 2010 in close cooperation with the fans. \nGet ready for an exciting new stories and new clashes with various opponents. \nEvents Castlevania: Lords of Shadow 2 begin immediately after the final of \nthe first part - in the modern world, where the weakened Dracula seeks to get \nrid of his immortality. His longtime associate Sobek offers vampire to battle \nwith Satan, who returned to the world to make a doomsday. \n\nWorld of Castlevania: Lords of Shadow 2 has changed beyond recognition. Offers \na huge area that you can learn as much as you want, gloomy city in the Gothic style, \nand countless enemies - powerful minions of Satan. \nTravel the open world, returning to previously explored places after gaining new \nabilities. Brand new mobile camera will allow you to explore all corners of the \nworld and to fully enjoy the inimitable visual style Castlevania. \nKey elements of the combat system underwent a thorough revision. A variety of \nweapons has its own unique properties - for example, by Void Sword you can pull \nthe life of the wounded opponents, and Chaos Claw breaks any protection. Besides \nDracula becomes stronger through the blood of his enemies. Properly allocating \n\nFeatures RePack'a:\n\nIncludesUpdate1 \nDo not cut / recoded \nCrack the text from ZoG Forum Team v 1.1 \n\nAdditions: \n- Revelations \n- Relic Rune Pack \n- Dark Dracula Costume \n- Armored Dracula Costume","torrent":{"xt":"urn:btih:0d131e78a4042aad31bb2bf13f57a593294be933","amp;dn":"Castlevania.Lords.of.Shadow.2.Repack-R.G.+Mechanics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d131e78a4042aad31bb2bf13f57a593294be933","infoHashBuffer":{"type":"Buffer","data":[13,19,30,120,164,4,42,173,49,187,43,241,63,87,165,147,41,75,233,51]},"announce":[],"urlList":[]}}