{"title":"CSI ETABS 2015 version 15.0.0.1221 [32-64 Bit] - [FirstUploads]","uid":11743411,"size":1067297783,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0d518227aa9d5974789734838436ace82029ce3c&amp;dn=CSI+ETABS+2015+version+15.0.0.1221+%5B32-64+Bit%5D+-+%5BFirstUploads%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":37,"leechers":12,"uploader":"FirstUploads","files":7,"time":1425887208,"description":"CSI ETABS 2015 version 15.0.0.1221 [32-64 Bit] - [FirstUploads]\n\n\nComputers and Structures, Inc. (CSI), leader in software tools for structural and earthquake engineering, has announced the new release of ETABS 2015, is a civil engineering program that design and analyse steel and concrete structures using finite element method.\n\nETABS 2015 provides an unequaled suite of tools for structural engineers designing buildings, whether they are working on one-story industrial structures or the tallest commercial high-rises. Immensely capable, yet easy-to-use, has been the hallmark of ETABS since its introduction decades ago, and this latest release continues that tradition by providing engineers with the technologically-advanced, yet intuitive, software they require to be their most productive.\n\nETABS 2015 Enhancements:\n\nPerformance Based Design (PBD) is a major shift from traditional structural design concepts and represents the future of earthquake engineering. These new procedures help assure that the design will reliably meet a desired level of performance during a given earthquake.\n\nThe fundamental component of PBD is nonlinear dynamic analysis where an attempt is made to capture the real behavior of the structure by explicitly modeling and evaluating post-yield ductility and energy dissipation when subjected to earthquake ground motions. ETABS 2015 introduces new special purpose options and algorithms for the practical and efficient application of these procedures","torrent":{"xt":"urn:btih:0d518227aa9d5974789734838436ace82029ce3c","amp;dn":"CSI+ETABS+2015+version+15.0.0.1221+%5B32-64+Bit%5D+-+%5BFirstUploads%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d518227aa9d5974789734838436ace82029ce3c","infoHashBuffer":{"type":"Buffer","data":[13,81,130,39,170,157,89,116,120,151,52,131,132,54,172,232,32,41,206,60]},"announce":[],"urlList":[]}}