{
  "title": "Encyclopedia of World History (7 Volumes Set) Pdf Gooner",
  "uid": 12032650,
  "size": 153303195,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:0d8a0cc16a371f9e2008360ece891e48ba175e40&amp;dn=Encyclopedia+of+World+History+%287+Volumes+Set%29+Pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 39,
  "leechers": 2,
  "uploader": "GoonerTPB",
  "files": 1,
  "time": 1434640829,
  "description": "Pages: 3760\nPublisher: Facts on File; 1 edition (June 1, 2008)\nLanguage: English\nISBN-10: 0816063869\nISBN-13: 978-0816063864\n\nIn today's world of globalization, there is a growing trend among historians and students alike to study the common challenges and experiences that unite the human past. &quot;Facts On File&quot; is pleased to announce its new seven-volume &quot;Encyclopedia of World History&quot;, a truly groundbreaking work and one of the first to offer a balanced presentation of human history for a global perspective of the past. A team of distinguished world history academics has brought together scores of specialists in writing signed entries based on the latest scholarship.Based on the National Standards for World History and influenced by the National Standards for World History, this comprehensive and authoritative set is rich in features to make the study of world history easier for students to understand. Arranged in six chronological eras that span from prehistory to the present day, this chronological approach follows the way world history is taught and studied in the classroom. Each volume era begins with essays that tackle large themes - such as agriculture, science and technology, social and class relationships, trade and cultural exchanges, and warfare - that allow students to make connections and trace key global patterns over time. The final volume contains primary documents, a chronology, and a master index for the set.It contains thematic essays that help students make comparisons and connections across regions and time periods. It is based on primary source documents, carefully chosen to be representative of the six world eras. It is informative with cross-referenced entries. It also includes: Chronologies in every volume to help students place events in context; More than 600 illustrations, including a 32-page insert of full-color maps in each volume designed to convey the importance of geography in world history; An appendix in each volume; Further reading sections that encourage further research; Individual volume indexes; And a comprehensive set index",
  "parsed": {
    "xt": "urn:btih:0d8a0cc16a371f9e2008360ece891e48ba175e40",
    "dn": "Encyclopedia of World History (7 Volumes Set) Pdf Gooner",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "0d8a0cc16a371f9e2008360ece891e48ba175e40",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        13,
        138,
        12,
        193,
        106,
        55,
        31,
        158,
        32,
        8,
        54,
        14,
        206,
        137,
        30,
        72,
        186,
        23,
        94,
        64
      ]
    },
    "name": "Encyclopedia of World History (7 Volumes Set) Pdf Gooner",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 35,
  "peers": 23,
  "last_updated": "2016-12-26T16:08:58.346Z"
}