{"title":"Splinter.Cell.Blacklist-RELOADED","uid":8835063,"size":22331545299,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0eb69459a28b08400c5f05bad3e63235b9853021&amp;dn=Splinter.Cell.Blacklist-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":157,"leechers":147,"uploader":"Mr.Stifmeister","files":2,"time":1377092904,"description":"\nnERv\n\nTom Clancy's Splinter Cell Blacklist Deluxe Edition (c) Ubisoft\n\n08/2013 :..... RELEASE.DATE .. PROTECTION .......: Ubidrm\n1 :.......... DISC(S) .. GAME.TYPE ........: Action\n\nDigital Deluxe Edition\n\nA group of terrorists calling themselves The Engineers has had enough of US\nmilitary occupation all over the world and initiates a terror ultimatum\ncalled the Blacklist  a deadly countdown of escalating attacks on US\ninterests. When our nation is threatened, the president turns to one man and\none man only: Sam Fisher. Armed with state-of-the-art technology,\ntop-of-the-line gadgets, deadly combat abilities, and an elite team of\nexperts, Sam Fisher holds nothing back to get the job done using whatever\nmeans necessary\n\nTom Clancys Splinter Cell Blacklist Deluxe Edition comes with all the\nessential weapons, gadgets, and gear for you to become Sam Fisher and stop\nthe escalating Blacklist threats. With two bonus missions and five bonus\nsuits, armor upgrades, and weapons, youll be prepared to stop the attacks\n\nContent Includes\n\n- Single-player and multiplayer co-op missions: Dead Coast and\nBillionaires Yacht\n\n- Bonus suits, weapons, and gear: Five powerful weapons for any play style:\nVSS Sniper Rifle, M1014 Shotgun, 416 Assault Rifle, F40 Pistol, and\nTactical Crossbow with Sleeping Gas Bolts.\n\n- Five enhanced combat suits: Elite Digital Ghillie Suit, Spy Suit,\nand Mercenary Suit for Spies vs. Mercs Upper Echelon Suit and\n4E Eclipse Ops Suit for the single-player storyline.\n\n- Five armor accessories: Gold Sonar Goggles, Amber Sonar Goggles,\nGhost Boots, Armored Boots, and Tactical Gloves\n\nAbout the Game\n\nThe United States has a military presence in two-thirds of countries around\nthe world, and some of them have had enough. A group of terrorists calling\nthemselves The Engineers initiate a terror ultimatum called the Blacklist\na deadly countdown of escalating attacks on U.S. interests\n\nKey Features\n\n- Operate without Restrictions\nSam is back in his tactical suit and goggles, and hes more lethal and\nagile than ever. Granted the freedom to do whatever it takes to stop\nthe Blacklist, Sam flies from exotic locales to U.S. cities as he races\nagainst the clock to find out whos behind this devastating threat.\n\n- Own Your Play Style\nSplinter Cell Blacklist builds on the stealth roots of the franchise,\nwhile exploring new directions to embrace the realms of action and\nadventure. Players can define their personal play styles and be rewarded\nfor those choices\n\n- Ghost players want to remain undetected\n\n- Assault players rely on instincts and frontal blow to deal with a\nsituation.\n\n- Panther players look for lethality in the most efficient and silent way.\n\n- Tools of the Trade\nTake down The Engineers by using new gadgets such as the upgraded Snake\nCam and Micro-trirotor Drone. Splinter Cell Blacklist is also bringing\nback fan-favorites like the Sticky Shocker and the brutal, curved Karambit\nknife. Fans of stealth will be happy to make the most of Sams sneaking\nabilities to abduct and carry enemies, while Killing In Motion allows the\nplayer to strike with surgical precision by marking and executing multiple\nenemies in one fluid motion.\n\n- Build a New Echelon\nSam is building a whole new Echelon unit his team, his way. Anna Grim\nGrimsdottir is his technical operations manager, CIA operative Isaac\nBriggs brings additional firepower, and resident hacker Charlie Cole\nrounds out the crew. 4th Echelon is a fully mobile ops unit with unlimited\nresources and cutting-edge technology aboard the re-purposed stealth\nairliner, the Paladin.\n\n- Enjoy a Fully Integrated Experience\nSpies vs. Mercs Returns\nSpies vs. Mercs is back with an new take on asymmetrical gameplay. Players\nwill be able to face off in teams of 4 all the while creating their very\nown Spy or Merc according to their playstyles via thorough customization\nelements. The original Classic Spies vs. Mercs experience also makes its\nlong awaited comeback for the fans\n- COOP\nWith the SMI, the lines are blurred between the single campaign and COOP\nas the narrative is deepened with Sam and Briggs. Earn in-game currency\nand unlock additional weapons or gadgets via specialized missions assigned\nby Grim, Briggs, Charlie and Kobin\n\n1. Unrar\n2. Burn or mount the image\n3. Install the game\n4. Install Blacklistpatchv101.exe from /Crack dir on the disc\n5. Copy over the contents of the /Crack dir on the disc to your\ngame installsrcSYSTEM directory\n6. Play the game. We recommend not going online with it, as usual\n7. Support the software developers. If you like this game, BUY IT\n\n","torrent":{"xt":"urn:btih:0eb69459a28b08400c5f05bad3e63235b9853021","amp;dn":"Splinter.Cell.Blacklist-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0eb69459a28b08400c5f05bad3e63235b9853021","infoHashBuffer":{"type":"Buffer","data":[14,182,148,89,162,139,8,64,12,95,5,186,211,230,50,53,185,133,48,33]},"announce":[],"urlList":[]}}