{
  "title": "Halo 2 PC",
  "uid": 13692631,
  "size": 4110189272,
  "categoryP": "games",
  "categoryS": "pc",
  "magnet": "?xt=urn:btih:105e83fc61c60911a6da42efe0097b47ee2501d8&amp;dn=Halo+2+PC&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 57,
  "leechers": 16,
  "uploader": "roflcopter2110",
  "files": 2,
  "time": 1456627997,
  "description": "Halo 2 PC\r\n\r\nHalo 2 is a 2004 first-person shooter video game developed by Bungie Studios. Released for the Xbox video game console on November 9, 2004,[3] the game is the second installment in the Halo franchise and the sequel to 2001's critically acclaimed Halo: Combat Evolved. A Microsoft Windows version of the game was released on May 31, 2007,[4] developed by an internal team at Microsoft Game Studios known as Hired Gun. The game features a new game engine, as well as using the Havok physics engine; added weapons and vehicles, and new multiplayer maps. The player alternately assumes the roles of the human Master Chief and the alien Arbiter in a 26th-century conflict between the human United Nations Space Command and genocidal Covenant.\r\n\r\nAfter the success of Combat Evolved, a sequel was expected and highly anticipated. Bungie found inspiration in plot points and gameplay elements that had been left out of their first game, including multiplayer over the Internet through Xbox Live. Time constraints forced a series of cutbacks in the size and scope of the game, including a cliffhanger ending to the game's campaign mode that left many in the studio dissatisfied. Among Halo 2's marketing efforts was an alternate reality game called &quot;I Love Bees&quot; that involved players solving real-world puzzles.\r\n\r\nOn release, Halo 2 was the most popular video game on Xbox Live,[5] holding that rank until the release of Gears of War for the Xbox 360 nearly two years later.[6][7] By June 20, 2006, more than 500 million games of Halo 2 had been played and more than 710 million hours have been spent playing it on Xbox Live;[8] by May 9, 2007, the number of unique players had risen to over five million.[9] Halo 2 is the best-selling first-generation Xbox game[10] with at least 6.3 million copies sold in the United States alone.[11] The game received critical acclaim, with most publications lauding the strong multiplayer component. The campaign however, was the focus of criticism for its cliffhanger ending.\r\n\r\nMinimum System Requirements\r\nProcessor:\t2.0 GHz\r\nVideo Memory:\t128 MB ATI X700, Nvidia 6100 or better.\r\nOnly supplied on DVD?:\tYes\r\nHard Drive Space:\t7 GB\r\nOperating System:\tWindows 7 or Windows Vista",
  "parsed": {
    "xt": "urn:btih:105e83fc61c60911a6da42efe0097b47ee2501d8",
    "dn": "Halo 2 PC",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "105e83fc61c60911a6da42efe0097b47ee2501d8",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        16,
        94,
        131,
        252,
        97,
        198,
        9,
        17,
        166,
        218,
        66,
        239,
        224,
        9,
        123,
        71,
        238,
        37,
        1,
        216
      ]
    },
    "name": "Halo 2 PC",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 372,
  "peers": 100,
  "last_updated": "2016-12-26T16:30:14.392Z"
}