{
  "title": "Leaders Eat Last - Simon Sinek - Chapterized Audiobook MP3",
  "uid": 10561214,
  "size": 233441440,
  "categoryP": "audio",
  "categoryS": "audio_books",
  "magnet": "?xt=urn:btih:120b6ef9919815d8b8eaf86d2a667a1650e8c56b&amp;dn=Leaders+Eat+Last+-+Simon+Sinek+-+Chapterized+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 68,
  "leechers": 2,
  "uploader": "Squiddy82",
  "files": -1,
  "time": 1405458059,
  "description": "MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nLeaders Eat Last: Why Some Teams Pull Together and Others Don't\n\nWritten by: Simon Sinek\nNarrated by: Simon Sinek\nLength: 8 hrs and 10 mins\nFormat: Unabridged\nRelease Date:01-07-14\nProgram Type: Audiobook\n\nWhy do only a few people get to say &quot;I love my job?&quot; It seems unfair that finding fulfillment at work is like winning a lottery; that only a few lucky ones get to feel valued by their organizations, to feel like they belong.\n\nImagine a world where almost everyone wakes up inspired to go to work, feels trusted and valued during the day, then returns home feeling fulfilled.\n\nThis is not a crazy, idealized notion. Today, in many successful organizations, great leaders are creating environments in which people naturally work together to do remarkable things. In his travels around the world since the publication of his best seller Start with Why, Simon Sinek noticed that some teams were able to trust each other so deeply that they would literally put their lives on the line for each other. Other teams, no matter what incentives were offered, were doomed to infighting, fragmentation, and failure. Why?\n\nThe answer became clear during a conversation with a Marine Corps general. &quot;Officers eat last,&quot; he said. Sinek watched as the most junior Marines ate first, while the most senior Marines took their place at the back of the line. What's symbolic in the chow hall is deadly serious on the battlefield: great leaders sacrifice their own comfort - even their own survival - for the good of those in their care.\n\nThe best organizations foster trust and cooperation because their leaders build what Sinek calls a Circle of Safety that separates the security inside the team from the challenges outside. The Circle of Safety leads to stable, adaptive, confident teams, where everyone feels they belong and all energies are devoted to facing the common enemy and seizing big opportunities. But without a Circle of Safety, we end up with office politics, silos, and runaway self-interest. And the whole organization suffers.\n\nAs he did in Start with Why, Sinek illustrates his ideas with fascinating true stories from a wide range of examples.",
  "parsed": {
    "xt": "urn:btih:120b6ef9919815d8b8eaf86d2a667a1650e8c56b",
    "dn": "Leaders Eat Last - Simon Sinek - Chapterized Audiobook MP3",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "120b6ef9919815d8b8eaf86d2a667a1650e8c56b",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        18,
        11,
        110,
        249,
        145,
        152,
        21,
        216,
        184,
        234,
        248,
        109,
        42,
        102,
        122,
        22,
        80,
        232,
        197,
        107
      ]
    },
    "name": "Leaders Eat Last - Simon Sinek - Chapterized Audiobook MP3",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 21,
  "peers": 51,
  "last_updated": "2016-12-26T16:43:57.148Z"
}