{
  "title": "How to Make Millions - Tim Sykes  (Stock Trading Course)",
  "uid": 11961285,
  "size": 1374328900,
  "categoryP": "video",
  "categoryS": "other",
  "magnet": "?xt=urn:btih:1227429382dc79c9406938f66339dba597a3da17&amp;dn=How+to+Make+Millions+-+Tim+Sykes++%28Stock+Trading+Course%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 40,
  "leechers": 2,
  "uploader": "davieboy1966",
  "files": 6,
  "time": 1432563080,
  "description": "Movies : Documentary : DVD Rip : English\n\nOne of the biggest questions I?ve seen people ask is which DVD of Tim?s to watch. I mean, there are so MANY!!! Each of them focuses on different techniques, strategies, or aspects to trading. He has one DVD on Biotech trading. Another DVD on the SEC. Other DVD?s on shorting.\n\nHow do you know which one is the best, and if it?s even any good?\n\nI?m going to cut through all of the confusion and get straight to it.\n\nThe best DVD to date from Tim Sykes is How to Make Millions. If you?re on the fence and uncertain about whether or not to sign up with Tim, this is the single product I would recommend you get. You will get all of the strategies and answers you need to start trading successfully.\n\nWhat You Get\n-How to Enter Orders\n-The Best Brokers to Use\n-The Best Software Tools and Research Websites\n-Lessons on Trading Vocabulary\n-Stock Trading Patterns\n-When to Trade\n-When Not to Trade\n-Position Sizing\n-Loss Cutting\n-Planning Out Your Trades\n-How to Grow Small Accounts Exponentially\n\nWhy It Really Is the Best DVD\nIf you?ve been on my website much, you know the biggest complaint I have against Tim is that he?s a terrible teacher. He doesn?t always answer your questions and spends more time promoting his products than teaching his strategies.\n\nWith How to Make Millions, that problem goes away for one simple reason: Tim isn?t the one doing most of the teaching.\n\nIn this DVD, Tim has brought together half a dozen traders that have made over $1 million, including my personal favorite, Superman. That means that you don?t have to listen to Tim drone on with all of his marketing BS. You get to hear from some elite, one-of-a-kind traders on how they do it. This includes both of his millionaire students, as well as some of the other Guru?s.\n\nThe Best Part\nTake a look at this Youtube comment on one of Tim?s videos.\n\nI wonder if Tim will reveal the huge amount of money he makes from students?\n\nThis is the part that most people get hung up on. Tim charges a hefty fee to teach you the strategies he uses to be successful in the stock market. I see a couple of major problems with that argument.\n\n1) This is America, and it?s every man?s right to pursue wealth. Nobody complains that McDonalds charges you money for food, yet they expect Tim to give his Big Mac recipe away for free.\n2) People willingly pay to go to college to learn the same material. Tim is doing a service by charging less than tuition would cost to learn it.\n\nSo, to all of the haters out there, here?s the good news. On the How to Make Millions DVD, Tim gives all of the money away to charity. Through the Timothy Sykes Foundation, Tim gives a $10,000 scholarship to a college student every year, and then gives the rest of the money to various organizations around the world.\n\nIn other words, Tim doesn?t make any money off of this product.\n\nFor those with a personal vendetta against the American dream and Timothy Sykes, How to Make Millions is for you. All of the money goes to help charitable causes and one lucky college student.\n\nHow To Make Millions\nListen, there?s a lot of risk involved with trading. People lose a lot of money. It is a zero-sum game.\n\nBut for any person willing to take that risk, there?s going to be a period of time that a lot of learning needs to be done. You can try it on your own, or choose to learn from somebody else. The reason I say this is the best DVD is because it brings together the best of all of Tim?s Gurus. You get to learn trading strategies from half a dozen traders, not just Tim. Some of the guys you?ll be learning from aren?t selling some plan to try to make money off of you. They?re just teaching you what they do.\n\nIt?s that simple.\n\nThere?s a lot of benefit to this DVD. All of the profits go to charity, and you get to learn. For a short time, you can save 70% on this new DVD by clicking here: How to Make Millions. Get this DVD before any others. It will save you a ton of time, and hopefully help you make a lot of money.\n\n\nEnjoy and Seed!!",
  "parsed": {
    "xt": "urn:btih:1227429382dc79c9406938f66339dba597a3da17",
    "dn": "How to Make Millions - Tim Sykes  (Stock Trading Course)",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "1227429382dc79c9406938f66339dba597a3da17",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        18,
        39,
        66,
        147,
        130,
        220,
        121,
        201,
        64,
        105,
        56,
        246,
        99,
        57,
        219,
        165,
        151,
        163,
        218,
        23
      ]
    },
    "name": "How to Make Millions - Tim Sykes  (Stock Trading Course)",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 42,
  "peers": 50,
  "last_updated": "2016-12-24T17:34:55.742Z"
}