{
  "title": "The Witcher 3: Wild Hunt Patch v1.07 (GOG)",
  "uid": 12137504,
  "size": 2186424102,
  "categoryP": "games",
  "categoryS": "pc",
  "magnet": "?xt=urn:btih:1257e7656c85aa6bb6861c7fa61c409cd769f307&amp;dn=The+Witcher+3%3A+Wild+Hunt+Patch+v1.07+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 157,
  "leechers": 6,
  "uploader": "mercs215",
  "files": 3,
  "time": 1437242497,
  "description": "Install instructions: \n1. Requires patch 1.02 (or above) installed\n2. Install \nNote: compatibility is not guaranteed with other group releases.\n3. Play, no cracks needed as DRM free\nIf you like this game, please support the developers and BUY IT! Remember to seed so others can enjoy.\n\nChange log:\nEnabled additional settings that decreases the hair and fur image quality slightly, without compromising its general appearance, to optimize HairWorks on a wider range of hardware.\nIntroduces an alternative movement style for Geralt. To enable, go to the GameplayMovement Response submenu.\nFixes a rare issue where the player's horse would not fall to the ground properly.\nFixes a rare issue where the player could be locked into the aiming animation if hit while throwing a bomb on horseback.\nFixes a rare issue with an infinite loading screen in the Ladies of the Wood quest.\nIncludes a variety of collision fixes.\nFixes an issue where Wild Hunt warriors would remain present even after the player completed the main storyline.\nFixes an issue where players could repeatedly buy foreign currency from a loan shark and sell it at the Vivaldi Bank.\nFixes an exploit whereby players could loot gold from a single chest more than once.\nFixes an issue whereby some skills were not properly removed after the player used the Potion of Clearance.\nFixes an issue with target locking, which should now be more responsive.\nIntroduces a number of changes in selected game-world areas to prevent players from unexpectedly progressing quests or leaving the playable area by climbing certain elements of the landscape.\nFixes an issue where sometimes players could not use Signs after reaching Skellige for the first time.\nFixes an issue where damage from certain sources was incorrectly calculated.\nFixes an issue where the durability of alternative weapons did not drop as intended.\nFixes an issue where the game would remain in slow motion if the player had used manual targeting.\nFixes an issue whereby meditation could be blocked by certain quests.\nFixes an issue where Stamina did not always regenerate properly.\nFixes an issue where Geralt's statistics could be multiplied if the player stood in a Dimeritium bomb cloud while the Cluster skill was activated.\nIntroduces a number of fixes, improvements and clarifications in the map-pins and objectives for multiple quests.\nFixes an issue where in certain circumstances gravity ceased to apply to the player's horse.\nAdds a stash for player convenience. Players can now store loot in their stash, access to which is available in different parts of the world. Stash locations are marked on the map.\nFixes an issue whereby the player's horse would often stop abruptly before bridges or other narrow passages.\nFixes an issue whereby encumbrance was not updating correctly, resulting in players being overburdened where in fact they were not.\nFixes a rare issue where players were unable to choose different Signs.\nFixes an issue where the player was sometimes unable to craft glyphs.\nFixes an issue where not all merchants would accept junk loot.\nAll crafting components and alchemy ingredients now weigh nothing.\nFixes an issue where certain armor/hairstyle combinations interacted incorrectly.\nFixes an issue where instances of the Quen Sign would occasionally burst during dialogue scenes.\nFixes a rare issue where the player could not play gwent with Madame Serenity at the Passiflora.\nThe Zoltan gwent card should now always be present beneath the Hanged Man's Tree if the player does not win it earlier in White Orchard.\nFixes a rare issue where players could not talk to, or play gwent with, the innkeeper at the Inn at the Crossroads.\nIncludes a number of wording and spelling fixes in multiple localized versions.\nIntroduces a number of improvements in the game streaming system. Players should experience fewer blurred textures, NPC spawn times should be markedly reduced, and there should be an overall improvement in the speed with which game assets are loaded. Streaming system improvements should be most noticeable on consoles and systems with non-SSD drives.\nImproves performance in the swamps of the No Man's Land region.\nFixes an issue whereby the presence of fog could adversely affect game performance.\nOptimizes various FX which should result in improved performance during the Battle of Kaer Morhen quest.\nIntroduces a number of optimizations that improve overall performance throughout the game.\nImproves overall game performance.\nFixes an issue where Keira's magic bubble could adversely affect performance.\nFixes an issue whereby the mouse cursor would remain visible during in-game video playback.\nAdds a warning if the user runs out of disk space and wants to crate a new game save.\nFixes an issue whereby Colorblind mode was not properly saved.\nFixes an issue whereby Zoltan would sometimes appear in the incorrect location after the Novigrad, Closed City quest.\nFixes an issue during the Last Wish quest whereby Geralt would continue his conversation with Yennefer after they parted.\nFixes an issue where two simultaneous instances of some characters would appear in a scene in the Broken Flowers quest.\nFixes an issue whereby some objectives were not available to the player and would be automatically failed during the Battle of Kaer Morhen quest..\nFixes an issue where in certain circumstances Lambert did not board the boat during the Final Trial quest.\nFixes an issue where in certain circumstances Madame Serenity was improperly placed during the Deadly Plot quest.\nFixes an issue where the Fake Papers quest would be failed if the player did not mention that one of the brothers was dead.\nFixes an issue whereby players would sometimes be unable to start the final horse race, The Heroes' Pursuits: For the Goddess' Glory! in Skellige.\nFixes an issue where unintended objects were present in Novigrad after the Battle of Kaer Morhen quest.\nFixes an issue where a progression break could occur if Geralt was knocked out by guards while following the Bloody Baron during the Family Matters quest.\nFixes an issue where players were sometimes unable to interact with a torch in the Get Junior quest.\nFixes an issue where players could sometimes experience an infinite loading screen during the Iron Maiden quest.\nFixes an issue where in certain circumstances players could encounter a blocker during the Contract: The Apiarian Phantom quest. Players who have encountered this bug need to backtrack to the frozen hive and examine the footprints around it again.\nFixes an issue whereby the player could get locked inside a room during the Through Time and Space quest.\n\n\nAnd more.. read the read me",
  "parsed": {
    "xt": "urn:btih:1257e7656c85aa6bb6861c7fa61c409cd769f307",
    "dn": "The Witcher 3: Wild Hunt Patch v1.07 (GOG)",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "1257e7656c85aa6bb6861c7fa61c409cd769f307",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        18,
        87,
        231,
        101,
        108,
        133,
        170,
        107,
        182,
        134,
        28,
        127,
        166,
        28,
        64,
        156,
        215,
        105,
        243,
        7
      ]
    },
    "name": "The Witcher 3: Wild Hunt Patch v1.07 (GOG)",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 163,
  "peers": 0,
  "last_updated": "2016-12-24T17:36:22.025Z"
}