{
  "title": "Avengers Vs. X-Men (000 - 012 + All tie-ins &amp; Extras) (- Nem",
  "uid": 8851078,
  "size": 2882350543,
  "categoryP": "other",
  "categoryS": "comics",
  "magnet": "?xt=urn:btih:127df102516fe92214dfd8de67a0754d558d9d38&amp;dn=Avengers+Vs.+X-Men+%28000+-+012+%2B+All+tie-ins+%26amp%3B+Extras%29+%28-+Nem&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 48,
  "leechers": 7,
  "uploader": "nemesis43",
  "files": 84,
  "time": 1377525670,
  "description": "Avengers vs. X-Men (abbreviated AvX) is a 2012 crossover event that was featured in comic books published by Marvel Comics. The event, consisting of an eponymous limited series and numerous tie-in books, involves the return of the Phoenix Force and the subsequent war between the Avengers and the X-Men. The 12-issue, bimonthly series was first published in April 2012, and features a storyline by Jason Aaron, Brian Michael Bendis, Ed Brubaker, Jonathan Hickman and Matt Fraction, and a rotating team of artists including John Romita, Jr., Olivier Coipel and Adam Kubert.\n\nThe event was preceded by the four-issue limited series, Avengers: X-Sanction by Jeph Loeb and Ed McGuinness, and Avengers vs. X-Men #0. Avengers vs. X-Men also ties into the limited series; AVX: VS, described as &quot;the fight book&quot; which expands upon many of the one-on-one battles featured in the main series, the digital series; Avengers vs. X-Men: Infinite, and into a number of ongoing series; including Avengers, Avengers Academy, New Avengers, Secret Avengers, Uncanny X-Men, Wolverine and the X-Men and X-Men: Legacy. The event was succeeded by the limited series, AvX: Consequences.\n\nReceiving mixed to favorable reviews from critics, Avengers vs. X-Men was a commercial success that overall led the comic book sales charts from April to October 2012. The repercussions of the storyline resulted in the new status quos of the Marvel Universe presented in the company's Marvel NOW! relaunch initiative.",
  "parsed": {
    "xt": "urn:btih:127df102516fe92214dfd8de67a0754d558d9d38",
    "dn": "Avengers Vs. X-Men (000 - 012   All tie-ins &amp; Extras) (- Nem",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "127df102516fe92214dfd8de67a0754d558d9d38",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        18,
        125,
        241,
        2,
        81,
        111,
        233,
        34,
        20,
        223,
        216,
        222,
        103,
        160,
        117,
        77,
        85,
        141,
        157,
        56
      ]
    },
    "name": "Avengers Vs. X-Men (000 - 012   All tie-ins &amp; Extras) (- Nem",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 20,
  "peers": 84,
  "last_updated": "2016-12-26T16:47:57.954Z"
}