{"title":"The.Great.British.Bake.Off-S06E04-Desserts--720p","uid":12297046,"size":1039837937,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:129195f0db90e2094ffb7f05cf84dd9084195b73&amp;dn=The.Great.British.Bake.Off-S06E04-Desserts--720p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":71,"leechers":4,"uploader":"uggauga","files":2,"time":1440632162,"description":"Desserts\nThe Great British Bake Off, Series 6 Episode 4 of 11\n\nFor the nine bakers left, it's time to tackle the sweet ending to every meal - desserts.\n\nThe signature challenge comes in the form of a French classic - creme brulee. The bakers need to achieve the perfect wobble of the creme and an audible crack of the brulee. It's not easy though, as they have to brulee under the grill, not with a blow torch. While some will reach perfection, others will serve up scrambled egg and custard soup.\n\nMary picks the technical challenge, and it's a European medley - the spanische windtorte from Austria, with a nod to Spain and some Swiss and French meringue thrown in. It may only be meringue, cream and soft fruit, but it's tricky to construct and needs to be decorated with delicate fondant violets - if only the bakers knew what a violet looked like!\n\nNot one, not two, but three baked cheesecakes make up the show-stopper. Mary and Paul are looking for faultless baked cheesecakes, beautifully flavoured and stacked in a show-stopping way - easy? The bakers don't disappoint with their inventive ingredient combinations, but not all of the tiered cheesecakes are structurally sound.\n----------------------\nWith subtitles\n\nEnjoy !!","torrent":{"xt":"urn:btih:129195f0db90e2094ffb7f05cf84dd9084195b73","amp;dn":"The.Great.British.Bake.Off-S06E04-Desserts--720p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"129195f0db90e2094ffb7f05cf84dd9084195b73","infoHashBuffer":{"type":"Buffer","data":[18,145,149,240,219,144,226,9,79,251,127,5,207,132,221,144,132,25,91,115]},"announce":[],"urlList":[]}}