{
  "title": "22 Minute Hard Corps Deluxe - x264 - MP4 - DVDrip",
  "uid": 14547441,
  "size": 4222563302,
  "categoryP": "other",
  "categoryS": "other",
  "magnet": "?xt=urn:btih:13b35ab93dfd43681238f91e4d1cfe0e6ae76eda&amp;dn=22+Minute+Hard+Corps+Deluxe+-+x264+-+MP4+-+DVDrip&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 38,
  "leechers": 10,
  "uploader": "MrTVGuy",
  "files": 15,
  "time": 1462602208,
  "description": "Tony Horton's 22 Minute Hard Corps - Deluxe Kit\r\n\r\nGet 'Boot Camp Fit' in only 8 weeks!\r\n\r\nLooking to take your training beyond Basic? In the 22 Minute Hard Corps Deluxe Kit, Tony includes 3 advanced 22–minute workouts designed to use the variable–resistance Beachbody PT Sandbag, so you build strength, power, and agility—all at maximum speed.\r\n\r\nGet ‘Boot Camp Fit’ in only 8 weeks!\r\n\r\nNow you can ‘Get Some and Get Done!’—in 22 minutes a day with the quick, military–inspired, no–nonsense workout program designed by superstar trainer Tony Horton. Introducing 22 Minute Hard Corps—you just show up, get tough, and keep up, to get boot camp results in as little as 8 weeks.\r\n\r\nIn 22 Minute Hard Corps, Tony takes the laser-focus and no-nonsense simplicity of Military PT (Physical Training) and combines it with everything he's learned about creating quick workouts that deliver maximum results in the minimum amount of time. So you get a workout program that works your whole body with moves that are tough enough to challenge you, but straightforward enough for you to do on Day One.\r\n\r\nThe training may be basic, but the results are epic.\r\n\r\n8 workouts + 3 Additional Workouts\r\n\r\nTony takes you through a series of total-body rounds designed to maximize strength gains and fat loss with the objective of boot camp fitness in just 8 weeks.\r\n\r\nResistance 1. These are 5 simple moves, but with 3 back-to-back rounds, the challenge is intense. That's how you get results in just 22 minutes a day.\r\n\r\nCardio 1. This 7-move workout gets your heart pumping from Minute One. Keep up with the platoon and earn a massive calorie burn.\r\n\r\nCore 1. It's called 'Hard Corps' for a reason. Get ready to work your lower back, abs, and obliques in this epic 10-move drill.\r\n\r\nResistance 2. Did I hear you ask for more? Here it is. More resistance. More sweat. More muscles recruited.\r\n\r\nCardio 2. This is basic training, but there's nothing easy about it. It's 3 rounds of 7 exercises, just like Cardio 1, but these moves will push your limits even further.\r\n\r\nCore 2. You've survived Core 1. Now the reps are doubled—to test your limits and maximize the burn.\r\n\r\nResistance 3. This workout takes the intensity up a click by adding plyometric strength training to challenge your endurance.\r\n\r\nCardio 3. Alternates between floor work and plyo moves for 3 hard-driving rounds. Your mission is to deliver every rep.\r\n\r\n3 Advanced Total–Body Workouts:\r\n\r\nSpecial Ops Resistance. Three rounds of 5 advanced exercises that incorporate the variable–resistance PT Sandbag to search and destroy any weakness",
  "parsed": {
    "xt": "urn:btih:13b35ab93dfd43681238f91e4d1cfe0e6ae76eda",
    "dn": "22 Minute Hard Corps Deluxe - x264 - MP4 - DVDrip",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "13b35ab93dfd43681238f91e4d1cfe0e6ae76eda",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        19,
        179,
        90,
        185,
        61,
        253,
        67,
        104,
        18,
        56,
        249,
        30,
        77,
        28,
        254,
        14,
        106,
        231,
        110,
        218
      ]
    },
    "name": "22 Minute Hard Corps Deluxe - x264 - MP4 - DVDrip",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 48,
  "peers": 152,
  "last_updated": "2016-12-24T17:47:20.558Z"
}