{"title":"The Murderous History of Bible Translations","uid":15891872,"size":1634372,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:13b3e3a0e153d10730bba44daa833d904ffabf81&amp;dn=The+Murderous+History+of+Bible+Translations&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":57,"leechers":1,"uploader":"marty14","files":1,"time":1474763002,"description":"The Murderous History of Bible Translations: Power, Conflict, and the Quest for Meaning - Harry Freedman [epub]\r\n\r\nIn 1535, William Tyndale, the first man to produce an English version of the Bible in print, was captured and imprisoned in Belgium. A year later he was strangled and then burned at the stake. His co-translator was also burned. In that same year the translator of the first Dutch Bible was arrested and beheaded. These were not the first, nor were they the last instances of extreme violence against Bible translators. The Murderous History of Bible Translations tells the remarkable, and bloody, story of those who dared translate the word of God.\r\n\r\nThe Bible has been translated far more than any other book. To our minds it is self-evident that believers can read their sacred literature in a language they understand. But the history of Bible translations is far more contentious than reason would suggest. Bible translations underlie an astonishing number of religious conflicts that have plagued the world.\r\n\r\nHarry Freedman describes brilliantly the passions and strong emotions that arise when deeply held religious convictions are threatened or undermined. He tells of the struggle for authority and orthodoxy in a world where temporal power was always subjugated to the divine, a world in which the idea of a Bible for all was so important that many were willing to give up their time, security, and even their lives","torrent":{"xt":"urn:btih:13b3e3a0e153d10730bba44daa833d904ffabf81","amp;dn":"The+Murderous+History+of+Bible+Translations","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13b3e3a0e153d10730bba44daa833d904ffabf81","infoHashBuffer":{"type":"Buffer","data":[19,179,227,160,225,83,209,7,48,187,164,77,170,131,61,144,79,250,191,129]},"announce":[],"urlList":[]}}