{"title":"[FSX/P3D] Orbx FTX Trees HD","uid":11822179,"size":62123241,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:13d0bb47a56e205a38691df833a87bf618aec5fe&amp;dn=%5BFSX%2FP3D%5D+Orbx+FTX+Trees+HD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":62,"leechers":1,"uploader":"_SnakEye","files":1,"time":1429303497,"description":"FTX Trees HD is a complete overhaul of your sim's autogen tree textures, lending new and incredible immersion to your flight simulation experience! Years in the making, developer Scott Armstrong has used his keen eye for natural-looking vegetation to result in a depth of realism that simply must be seen to be believed. The new textures are double the resolution of default trees, resulting in unbelievable detail, and are derived from high-resolution photos of real trees for maximum realism. They have been expertly edited and colour-matched to give you the top-quality flight sim experience that you have come to expect from ORBX. The most incredible part is that Trees HD will actually IMPROVE your sim's performance! New optimized tree models reduce the burden on your system, resulting in up to a 20% INCREASE in FPS and no increase in VAS usage compared to what you are experiencing now. Call it the world's cheapest CPU upgrade! Beautiful new trees and a performance benefit to boot? Now that's what we call a win-win. Low-level flying takes on a new sense of realism that truly must be seen to be believed; skimming over treetops, over forests and along rivers has never felt so real! Your favourite airports will see a major upgrade too, as the surrounding vegetation takes on a new lifelike appearance. You will also find that FTX Trees HD breathes new life into our older products; with FTX Trees HD you will find yourself visiting many of the old classics and seeing them in an amazing new light. Tubeliner pilots benefit too, as your approaches, departures, and taxiing will be greatly enhanced by more lifelike vegetation. The best part is that FTX Trees HD is a worldwide texture upgrade, and doesn't require any other ORBX products! Whether you are new to flight simulation and upgrading your sim for the first time, or are a seasoned veteran with a wide variety of addons, Trees HD is designed for maximum compatibility and will upgrade all of your autogen trees, worldwide. Just download, install, and immerse yourself in the new experience!\n\n    Breathtaking new autogen tree textures\n    Double the resolution of previous autogen trees for incredible detail\n    All textures painstakingly created from high-quality photos of real trees\n    Immersion like you've never seen before!\n    Optimize models actually IMPROVE your FPS by up to 20%!\n    No VAS hit!\n    Compatible with almost all other FS products, both ORBX and non-ORBX\n    Beautiful new region-specific autogen for owners of FTX regions\n    No other ORBX products required!\n    Easy installation, no new complicated control panels\n    Fully compatible with FSX, P3Dv1, and P3Dv2\n    By Scott Armstrong","torrent":{"xt":"urn:btih:13d0bb47a56e205a38691df833a87bf618aec5fe","amp;dn":"%5BFSX%2FP3D%5D+Orbx+FTX+Trees+HD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13d0bb47a56e205a38691df833a87bf618aec5fe","infoHashBuffer":{"type":"Buffer","data":[19,208,187,71,165,110,32,90,56,105,29,248,51,168,123,246,24,174,197,254]},"announce":[],"urlList":[]}}