{
  "title": "Vin DiCarlo - Pandora's Box (Complete PUA System).pdf",
  "uid": 8737183,
  "size": 29034259,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:13db2a6f452d923b1b169a1871f9ebd3c08118d4&amp;dn=Vin+DiCarlo+-+Pandora%27s+Box+%28Complete+PUA+System%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 66,
  "leechers": 2,
  "uploader": "CaptainJackMix",
  "files": -1,
  "time": 1374702248,
  "description": "Here is Vin DiCarlo's complete 346 page &quot;Pandora's Box&quot; system in PDF. I did not make this PDF, credit goes to BlankPeter. The original material was written by Vin DiCarlo and Brian Burke.\n\nThis PDF is a compilation of the 11 core PDFs and 8 strategy PDFs that came with the original system. If you sign up for Pandora's Box the material is given to you in a very messy way, over a span of 8 months, and there's 5 gigs of video interviews with girls that suck. You can't learn how to get with girls from girls.\n\nHOWEVER. The material Vin used to write the PDFs is actually very good. If you learn his system of categorizing women you will become a god among men.\n\nAll of the original material by Vin DiCarlo and Brian Burke has been streamlined into 1 book-sized PDF with a table of contents and page numbers. It begins with all the usual PUA stuff - some shitty warnings, some talk about the differences between men and women, etc. etc. And then he hits you with the &quot;three conflicts of the female mind.&quot; He has basically come up with a Myers-Briggs-like way of categorizing every woman, with 3 categories instead of 4.\n\nOnce you know the &quot;3 Conflicts of the Female Mind&quot;, which are very easy to wrap your head around, you begin learning about the &quot;8 Types of Women&quot;. The 8 types are the 8 different combinations that can be made with the 3 conflicts. Each type of woman has a brief description about what methods you should think about using on her, followed by 8 chapters of the &quot;Strategy Series&quot; written by Brian Burke - this is where the real meat is.\n\nThe strategy chapters each explore a specific topic - for example, conversation, or physical intimacy - and talk about what works for each of the 8 types of women. So if you know you are only interested in a few of the types, you only have to learn the methods for those types. Or you can learn all of the types to become a pick up samurai.\n\nWhether you're actually into the whole &quot;PUA community&quot; or not, this book will definitely give you a huge insight into the female mind. There's a lot of crap in the beginning that's supposed to boost your confidence but trust me, the meat of this book is really good.\n\nCheers",
  "parsed": {
    "xt": "urn:btih:13db2a6f452d923b1b169a1871f9ebd3c08118d4",
    "dn": "Vin DiCarlo - Pandora's Box (Complete PUA System).pdf",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "13db2a6f452d923b1b169a1871f9ebd3c08118d4",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        19,
        219,
        42,
        111,
        69,
        45,
        146,
        59,
        27,
        22,
        154,
        24,
        113,
        249,
        235,
        211,
        192,
        129,
        24,
        212
      ]
    },
    "name": "Vin DiCarlo - Pandora's Box (Complete PUA System).pdf",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 68,
  "peers": 37,
  "last_updated": "2016-12-24T17:48:26.809Z"
}