{
  "title": "THE MATRIX TRILOGY: Complete Collection - DVDRip",
  "uid": 8468037,
  "size": 2261702651,
  "categoryP": "video",
  "categoryS": "movies_dvdr",
  "magnet": "?xt=urn:btih:145f81be86d7551271449851fe4239ccba680174&amp;dn=THE+MATRIX+TRILOGY%3A+Complete+Collection+-+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 68,
  "leechers": 20,
  "uploader": "lokii_187",
  "files": -1,
  "time": 1368410088,
  "description": "THE MATRIX TRILOGY: Complete Collection - DVDRip\n  \n  1.) The Matrix (1999)\n  2.) The Matrix Reloaded (2003)\n  3.) The Matrix Revolutions (2003)\n\nHere is the complete trilogy set of the Cult-Classic films The Matrix in one torrent, now the only choice is.... Should you take the red or blue pill?\n------------------------------------------------------------------------------\n\nThe Matrix (1999)\n\nThomas A. Anderson is a man living two lives. By day he is an average computer programmer and by night a hacker known as Neo. Neo has always questioned his reality, but the truth is far beyond his imagination. Neo finds himself targeted by the police when he is contacted by Morpheus, a legendary computer hacker branded a terrorist by the government. Morpheus awakens Neo to the real world, a ravaged wasteland where most of humanity have been captured by a race of machines that live off of the humans' body heat and electrochemical energy and who imprison their minds within an artificial reality known as the Matrix. As a rebel against the machines, Neo must return to the Matrix and confront the agents: super-powerful computer programs devoted to snuffing out Neo and the entire human rebellion.\n------------------------------------------------------------------------------\n\nThe Matrix Reloaded (2003)\n\n6 months after the events depicted in The Matrix, Neo has proved to be a good omen for the free humans, as more and more humans are being freed from the matrix and brought to Zion, the one and only stronghold of the Resistance. Neo himself has discovered his superpowers including super speed, ability to see the codes of the things inside the matrix and a certain degree of pre-cognition. But a nasty piece of news hits the human resistance: 250,000 machine sentinels are digging to Zion and would reach them in 72 hours. As Zion prepares for the ultimate war, Neo, Morpheus and Trinity are advised by the Oracle to find the Keymaker who would help them reach the Source. Meanwhile Neo's recurrent dreams depicting Trinity's death have got him worried and as if it was not enough, Agent Smith has somehow escaped deletion, has become more powerful than before and has fixed Neo as his next target.\n------------------------------------------------------------------------------\n\nThe Matrix Revolutions (2003)\n\nNeo discovers that somehow he is able to use his powers in the real world too and that his mind can be freed from his body, as a result of which he finds himself trapped on a train station between the Matrix and the Real World. Meanwhile, Zion is preparing for the oncoming war with the machines with very little chances of survival. Neo's associates set out to free him from The Merovingian since it's believed that he is the One who will end the war between humans and the machines. What they do not know is that there is a threat from a third party, someone who has plans to destroy both the worlds.\n------------------------------------------------------------------------------\n\n\nHopefully you enjoy it, as I have the countless terabytes I have acquired through PirateBay over the years. Remember everybody, this site and others like it are a full circle, and only work with cooperation between all parties involved. So please for every 1GB of material downloaded try to at minimum give back (upload) 0.5GB back, because without someone seeding that latest episode of your favorite show last week, you wouldn't have it either. \n\n               *******LET US ALL GET SEEDY TO HELP THE NEEDY*******\n\nA Lokii_187 Production",
  "parsed": {
    "xt": "urn:btih:145f81be86d7551271449851fe4239ccba680174",
    "dn": "THE MATRIX TRILOGY: Complete Collection - DVDRip",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "145f81be86d7551271449851fe4239ccba680174",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        20,
        95,
        129,
        190,
        134,
        215,
        85,
        18,
        113,
        68,
        152,
        81,
        254,
        66,
        57,
        204,
        186,
        104,
        1,
        116
      ]
    },
    "name": "THE MATRIX TRILOGY: Complete Collection - DVDRip",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 88,
  "peers": 17,
  "last_updated": "2016-12-24T17:52:41.856Z"
}