{
  "title": "BlueStacks 2.5.55.6279 full",
  "uid": 15879539,
  "size": 322826240,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:14a3ce55bd659ff826e4c7963caf58087f519aec&amp;dn=BlueStacks+2.5.55.6279+full&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 49,
  "leechers": 12,
  "uploader": "tekpally",
  "files": 1,
  "time": 1474577599,
  "description": "BlueStacks is an easy to use and powerful App Player which is designed to run Android OS and apps on Windows PCs with instant switch between Android and Windows. No reboot is required. End consumers can now enjoy their favorite Android apps on Windows PCs. Android apps can appear either as icons on the Windows desktop, or within a full-blown Android environment. BlueStacks helps PC manufacturers to ride the Android momentum by enabling Android apps on x86-based tablets, netbooks, notebooks, convertibles and AiO Windows PCs.\t\r\n\r\nWith the new hybrid convertible form factors, BlueStacks completely eliminates the need to carry two devices. The end consumer benefits from getting both Android and Windows at the price of a single PC.\r\n\r\nThe seamless user experience, simultaneous use of Android and Windows apps, and multi-touch enablement are built on ground breaking virtualization technology which requires zero configuration and is transparent to the end consumer.\r\n\r\nOnce installed and launched, this application displays 10 pre-loaded applications, with a dedicated option to allow its users download new ones from the Internet. There is no separate configuration screen, but only a few options, so you shouldn’t spend too much time setting up the program.\r\n\r\nBlueStacks can run the Android apps in full-screen, with very fast loading times and with absolutely no errors. Most of the games can be controlled by mouse, just like you’d do on your typical touschscreen mobile phone.\r\n\r\nAnother feature that’s worth mentioning is the so-called BlueStacks Cloud Connect, a separate tool designed to allow users push their applications from the Android device to the PC and thus access them on the computer.\r\n\r\nThe software integrates seamlessly with Citrix and Microsoft software delivery infrastructure and with Citrix’s Enterprise App Store. With BlueStacks, enterprise IT can deliver Android apps securely and effortlessly to any end point running Windows.\r\n\r\nThis app runs on low resources and works just fine on Windows 10, but there are some minor compatibility issues on older systems, which means it may fail to load on Windows XP and Vista",
  "parsed": {
    "xt": "urn:btih:14a3ce55bd659ff826e4c7963caf58087f519aec",
    "dn": "BlueStacks 2.5.55.6279 full",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "14a3ce55bd659ff826e4c7963caf58087f519aec",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        20,
        163,
        206,
        85,
        189,
        101,
        159,
        248,
        38,
        228,
        199,
        150,
        60,
        175,
        88,
        8,
        127,
        81,
        154,
        236
      ]
    },
    "name": "BlueStacks 2.5.55.6279 full",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 61,
  "peers": 2,
  "last_updated": "2016-12-24T17:54:36.228Z"
}