{
  "title": "Corel Painter 2015 14.0.0.728 (MAC) (keygen XForce) [ChingLiu]",
  "uid": 10759419,
  "size": 231313829,
  "categoryP": "applications",
  "categoryS": "mac",
  "magnet": "?xt=urn:btih:152391d47efdfde0bceaeb232d0beec00bd6b7e4&amp;dn=Corel+Painter+2015+14.0.0.728+%28MAC%29+%28keygen+XForce%29+%5BChingLiu%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 70,
  "leechers": 4,
  "uploader": "Ching_Liu",
  "files": -1,
  "time": 1407961366,
  "description": "Inside the leading paint program\n\nNEW! Revolutionary Particle Brushes - Discover incredible brushes that let you revel in creative chaos or take complete control. Enhance a photo-clone painting or create a unique masterpiece with physics-based brushstrokes that spring, flow, glow and gravitate onto your canvas.\n\nNEW! Native 64-bit application for Mac - Performance improvements for your Mac mean faster speeds when it comes to intensive operations. Zoom, rotate, transform, work with layers and more all without slowing down. Plus, experience improvements to brush accuracy and performance.\n\nNEW! Real-Time Stylus &amp; Windows Tablet PC support - Paint on the go and find new inspiration anytime, anywhere. Plus, use the Painter Mobile for Android app and then import your work directly into Painter 2015 to add the professional finishing touches.\n\nENHANCED! Cross-platform CPU performance optimizations - Now utilizing half the power of previous versions, your laptop battery will last longer while using Painter. Experience brushes that on average now offer 40% more speed, with some brushes clocking in at 6x faster than previous versions!\n\nNEW! Custom User Interface Palette Arrangements - Inspired by professional Painter artists, these timesaving arrangements include new Brushes, Illustration, Cloning and Minimal UI options that allow you to easily switch between tools and optimize your painting environment.\n\nNEW! Jitter Smoothing - Enhance the realism and randomness of your digital brushes. Add Jitter Smoothing to Airbrush spacing and flow, brush rotation, color expression and more all while using both old favorites and brand new Particle Brushes.\n\nENHANCED! Real-time preview of effects - Add effects to your work and see them displayed on your canvas in real-time as they're applied. Now your entire canvas offers a world of effects experimentation all completely in real-time.\n\nENHANCED! Brush Tracking Utility - Now you can control and customize pressure-sensitive memory to virtually any brush. A visual power curve captures every movement and every line on your canvas, just like you would with real world art materials.\n\nENHANCED! Fresh New Content - Discover even more creative possibilities with new paper textures, nozzles, images and more. Plus, discover all-new Toolbox icon updates that match the fresh new look and feel of Painter 2015.\n\nRealBristleâ„¢ Painting &amp; Wacom tablet compatibility - Discover why RealBristle technology replicates traditional art materials more realistically than any other software. Control color intensity and shading simply by adjusting the angle and pressure of the pen on your tablet.\n\nSmart photo-painting tools - Transform photos into paintings using the powerful cloning and photo-painting tools of Painter 2015. Clone images by hand or let the Auto-Painting palette paint a photo for you using your choice of brush and media. The SmartStrokeâ„¢ brush technology follows lines and contours in your picture just like a real artist would.\n\nSystem Requirements\n\n-Mac OS X 10.7, 10.8 or 10.9 (with latest revision) \n-Intel Core 2 Duo \n-2 GB RAM \n-500 MB hard disk space for application files \n-1280 x 800 screen resolution  \n-Safari v5 or higher \n\nLanguage : English\n\nHomepage :  &lt;a href=&quot;\nhttp://www.painterartist.com/us/product/paint-program/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.painterartist.com/us/product/paint-program/&lt;/a&gt;",
  "parsed": {
    "xt": "urn:btih:152391d47efdfde0bceaeb232d0beec00bd6b7e4",
    "dn": "Corel Painter 2015 14.0.0.728 (MAC) (keygen XForce) [ChingLiu]",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "152391d47efdfde0bceaeb232d0beec00bd6b7e4",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        21,
        35,
        145,
        212,
        126,
        253,
        253,
        224,
        188,
        234,
        235,
        35,
        45,
        11,
        238,
        192,
        11,
        214,
        183,
        228
      ]
    },
    "name": "Corel Painter 2015 14.0.0.728 (MAC) (keygen XForce) [ChingLiu]",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 36,
  "peers": 96,
  "last_updated": "2016-12-26T17:08:38.768Z"
}