{
  "title": "Adobe Photoshop CC 2015.5 v17.0 (x86x64) Incl Patch [SadeemPC]",
  "uid": 15437573,
  "size": 2840458537,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:15b6c6d365fff6cf1e4467597bc614689e6503f6&amp;dn=Adobe+Photoshop+CC+2015.5+v17.0+%28x86x64%29+Incl+Patch+%5BSadeemPC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 89,
  "leechers": 42,
  "uploader": "SadeemPC",
  "files": 2,
  "time": 1469781310,
  "description": "Adobe Photoshop CC 2015.5 v17.0 Multilingual (x86/x64)\r\n\r\nAdobe Photoshop is a professional software for digital image quality, effects and berbagaimacam changes that can be adjusted to what you expect. This software includes the most advanced tools to work with images and new possibilities for creative ideas Significantly improve productivity. Allows you to edit images and create also three-dimensional graphics, two-dimensional projects and movie\t\r\n\r\nWhat's New in Photoshop CC (2015.5):\r\n\r\nBetter collaboration with Libraries\r\nManage distribution of read-only Creative Cloud Libraries so they can be used by team members, but not changed or deleted.\r\n\r\nUpdated Libraries panel\r\nFind the assets you need faster with new filtered search of the Adobe Stock and icons that make it easy to identify licensed Stock assets.\r\n\r\nSelection and Masking Space\r\nThis new dedicated workspace helps you make precise selections and masks more easily than ever. Use tools like Refine Edge Brush to cleanly separate foreground and background elements.\r\n\r\nEveryday tasks, accelerated\r\nPhotoshop CC opens documents faster and delivers greater responsiveness. Plus, Content-Aware Fill is up to 3X faster with even better results, and the Font menu shows lists of fonts up to 4X faster.\r\n\r\nContent-Aware Crop\r\nPhotoshop uses Content-Aware technology to intelligently fill in the gaps when you use the Crop tool to rotate an image or expand your canvas beyond the image's original size.\r\n\r\nMatch Font\r\nPhotoshop can now analyze, identify and match Latin fonts from an image or photo, taking the guesswork out of finding the perfect font for your design.\r\n\r\nImproved artboards\r\nNow you can duplicate a layer or layer group into other artboards, quickly change artboard backgrounds, and view artboards with transparent backgrounds.\r\n\r\nExport enhancements\r\nA new checkbox makes it a snap to embed color profiles in PNG or JPG files.\r\n\r\nAdjust facial features\r\nFace-Aware Liquify automatically identifies eyes, noses, mouths, and other facial features and then makes it easy to adjust them. Great for retouching portraits. \r\n\r\nWork easier with glyphs\r\nApply alternate glyphs for specific characters directly from an in-context menu.\r\n\r\n3D printing to Microsoft 3MF\r\nWindows 10 users: Preserve all the rich color and texture of your 3D models by printing directly to Microsoft’s open-source 3MF format.\r\n\r\nCreate patterns with Capture CC\r\nUse Capture CC on your mobile device to turn any image into a pattern. Save it to a Creative Cloud Library, and then use it as a pattern or pattern fill in your Photoshop projects.\r\n\r\nShowcase your work with Adobe Portfolio \r\nNow when you use Adobe Portfolio to create a beautiful website to show off your Photoshop images, you can include custom landing and contact pages to better connect with viewers.\r\n\r\nWorks with Adobe Experience Design CC (Preview)\r\nCopy and paste your Photoshop CC assets directly into Adobe XD, the new all-in-one tool for designing and prototyping user experiences for websites and mobile apps. \r\n\r\nAnd so much more\r\nAlso includes: A new preference to use the legacy Healing Brush, improved responsiveness of touch gestures, new options when exporting artboards, and so much more.\r\n\r\nSystem Requirements:\r\n- Intel® Core 2 or AMD Athlon® 64 processor; 2 GHz or faster processor\r\n- Microsoft Windows 7 with Service Pack 1, Windows 8.1, or Windows 10\r\n- 2 GB of RAM (8 GB recommended)\r\n- 2.6 GB of available hard-disk space for 32-bit installation; 3.1 GB of available hard-disk space for 64-bit installation; additional free space required during installation (cannot install on a volume that uses a case-sensitive file system)\r\n- 1024 x 768 display (1280x800 recommended) with 16-bit color and 512 MB of dedicated VRAM; 2 GB is recommended*\r\n- OpenGL 2.0–capable system",
  "parsed": {
    "xt": "urn:btih:15b6c6d365fff6cf1e4467597bc614689e6503f6",
    "dn": "Adobe Photoshop CC 2015.5 v17.0 (x86x64) Incl Patch [SadeemPC]",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "15b6c6d365fff6cf1e4467597bc614689e6503f6",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        21,
        182,
        198,
        211,
        101,
        255,
        246,
        207,
        30,
        68,
        103,
        89,
        123,
        198,
        20,
        104,
        158,
        101,
        3,
        246
      ]
    },
    "name": "Adobe Photoshop CC 2015.5 v17.0 (x86x64) Incl Patch [SadeemPC]",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 256,
  "peers": 100,
  "last_updated": "2016-12-26T17:13:07.661Z"
}