{
  "title": "How Google Works - Eric Schmidt Jonathan Rosenberg Audiobook MP3",
  "uid": 11196672,
  "size": 282541290,
  "categoryP": "audio",
  "categoryS": "audio_books",
  "magnet": "?xt=urn:btih:164d688c39d67d62635aa319fedea1f52632ac91&amp;dn=How+Google+Works+-+Eric+Schmidt+Jonathan+Rosenberg+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 93,
  "leechers": 5,
  "uploader": "Squiddy82",
  "files": -1,
  "time": 1413101001,
  "description": "MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nHow Google Works\n\nWritten by: Eric Schmidt, Jonathan Rosenberg, Alan Eagle\nNarrated by: Holter Graham, Jonathan Rosenberg\nLength: 9 hrs and 47 mins\nUnabridged Audiobook\nRelease Date:09-23-14\n\nGoogle Executive Chairman and ex-CEO Eric Schmidt and former SVP of Products Jonathan Rosenberg came to Google over a decade ago as proven technology executives. At the time, the company was already well-known for doing things differently, reflecting the visionary - and frequently contrarian - principles of founders Larry Page and Sergey Brin. If Eric and Jonathan were going to succeed, they realized they would have to relearn everything they thought they knew about management and business.\n\nToday, Google is a global icon that regularly pushes the boundaries of innovation in a variety of fields. How Google Works is an entertaining, pause-resistant primer containing lessons that Eric and Jonathan learned as they helped build the company. The authors explain how technology has shifted the balance of power from companies to consumers, and that the only way to succeed in this ever-changing landscape is to create superior products and attract a new breed of multifaceted employees whom Eric and Jonathan dub &quot;smart creatives&quot;. Covering topics including corporate culture, strategy, talent, decision-making, communication, innovation, and dealing with disruption, the authors illustrate management maxims (&quot;Consensus requires dissension&quot;, &quot;Exile knaves but fight for divas&quot;, &quot;Think 10X, not 10%&quot;) with numerous insiderfrom Google's history, many of which are shared here for the first time.\n\nIn an era when everything is speeding up, the best way for businesses to succeed is to attract smart-creative people and give them an environment where they can thrive at scale. How Google Works explains how to do just that.",
  "parsed": {
    "xt": "urn:btih:164d688c39d67d62635aa319fedea1f52632ac91",
    "dn": "How Google Works - Eric Schmidt Jonathan Rosenberg Audiobook MP3",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "164d688c39d67d62635aa319fedea1f52632ac91",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        22,
        77,
        104,
        140,
        57,
        214,
        125,
        98,
        99,
        90,
        163,
        25,
        254,
        222,
        161,
        245,
        38,
        50,
        172,
        145
      ]
    },
    "name": "How Google Works - Eric Schmidt Jonathan Rosenberg Audiobook MP3",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 22,
  "peers": 17,
  "last_updated": "2016-12-26T17:17:36.532Z"
}