{
  "title": "Lords of Secrecy: The National Security Elite",
  "uid": 15890701,
  "size": 1060933,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:1680e47787d0836d94d80c574b7015a4c1edd760&amp;dn=Lords+of+Secrecy%3A+The+National+Security+Elite&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 43,
  "leechers": 4,
  "uploader": "marty14",
  "files": 1,
  "time": 1474736788,
  "description": "Lords of Secrecy: The National Security Elite and America’s Stealth Foreign Policy - Scott Horton [epub]\r\n\r\nIn lucid and chilling detail, journalist and lawyer Scott Horton shows how secrecy has changed the way America functions. Executive decisions about war and peace are increasingly made by autonomous, self-directing, and unaccountable national security elites. Secrecy is justified as part of a bargain under which the state promises to keep the people safe from its enemies, but in fact allows excesses, mistakes, and crimes to go unchecked. Bureaucracies use secrets to conceal their mistakes and advance their power in government, invariable at the expense of the rights of the people. Never before have the American people had so little information concerning the wars waged in their name, nor has Congress exercised so little oversight over the war effort. American democracy is in deep trouble.\r\n\r\nLords of Secrecy explores the most important national security debates of our time, including the legal and moral issues surrounding the turn to private security contractors, the sweeping surveillance methods of intelligence agencies, and the use of robotic weapons such as drones. Horton looks at the legal edifice upon which these decisions are based and discusses approaches to rolling back the flood of secrets that is engulfing America today. Whistleblowers, but also Congress, the public, and the media, play a vital role in this process",
  "parsed": {
    "xt": "urn:btih:1680e47787d0836d94d80c574b7015a4c1edd760",
    "dn": "Lords of Secrecy: The National Security Elite",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "1680e47787d0836d94d80c574b7015a4c1edd760",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        22,
        128,
        228,
        119,
        135,
        208,
        131,
        109,
        148,
        216,
        12,
        87,
        75,
        112,
        21,
        164,
        193,
        237,
        215,
        96
      ]
    },
    "name": "Lords of Secrecy: The National Security Elite",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 47,
  "peers": 25,
  "last_updated": "2016-12-24T18:08:55.689Z"
}