{
  "title": "Alanis Morissette Jagged Little Pill 2011 Remastered 320 Kbps",
  "uid": 6586362,
  "size": 153110765,
  "categoryP": "audio",
  "categoryS": "music",
  "magnet": "?xt=urn:btih:1688a81b7cbdce2b8159828e541ed0218056f283&amp;dn=Alanis+Morissette+Jagged+Little+Pill+2011+Remastered+320+Kbps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 61,
  "leechers": 19,
  "uploader": "320hunter",
  "files": 17,
  "time": 1312625740,
  "description": "      \n                &lt;a href=&quot; http://en.wikipedia.org/wiki/Jagged_Little_Pill&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://en.wikipedia.org/wiki/Jagged_Little_Pill&lt;/a&gt;\n\n\n          Alanis Morissette Jagged Little Pill 2011 Remastered &amp; Art 320 Kbps\n\n\n\n\n\n01. All I Really Want                                            4:45   \n   \n02. You Oughta Know                                              4:09 \n\n03. Perfect                                                      3:08  \n \n04. Hand In My Pocket                                            3:41 \n  \n05. Right Through You                                            2:55  \n  \n06. Forgiven                                                     5:00  \n \n07. You Learn                                                    3:59 \n   \n08. Head Over Feet                                               4:27 \n  \n09. Mary Jane                                                    4:40  \n  \n10. Ironic                                                       3:49  \n  \n11. Not The Doctor                                               3:47   \n \n12. Wake Up                                                      4:53  \n  \n13. You Oughta Know [Hidden LP Remix + Additional Hidden Track]  8:11 \n\n\n\n\nProduct Details\n\nAudio CD (June 13, 1995) \nOriginal Release Date: June 13, 1995 \nNumber of Discs: 1 \nLabel: Maverick \nASIN: B000002MY3 \n\n\n\nDuration: 57:24\n\n\n\n\nBitrate: 320 kbps \nChannels: stereo\nSamplerate: 44100\nEncoder: LAME 3.82\nCRC: yes\nCopyright: no\nPrivate: no\n\n\n\n\n\n\n\n\n\n\nWhen you talk about the biggest albums of the 90s, \nyou certainly have to talk about 1995's Jagged Little Pill. \nAlanis Morissette, to my mind, came to represent a version of the new woman of the 90s,\nleaving no questions as to her feelings and, some might say, \ndemands. Decades ago, Aretha wanted R-E-S-P-E-C-T, \nbut Alanis wants much more than that, and as far as I'm concerned, \nshe deserves it. Apparently, at least one guy did \nAlanis wrong at some point; some women get mad, some get even' \nAlanis has the strength to do both. I for one love a strong woman. \n\nTo many, Alanis burst on the scene from out of nowhere with this mega-smash CD.\nI have one of her first two albums, so I know better. \nAs a teenager, Alanis actually found stardom in Canada singing, of all things,\n bubble gum pop. I know - it's hard to believe. \nI don't think any artist has ever undergone such a radical transformation \nas Alanis did from her teen albums to Jagged Little Pill. \n\nDo I even need to talk about the songs? Were any of these tracks not smash hit singles? \nIt all started with You Oughta Know, which was a revelation of sorts to many radio listeners.\nHarsh, angry, a little perverted, cursed with a couple of those silly bleeps radio stations just have to use - this was something different, and it just so happened to rock, as well. Alanis says everything all the good girls wronged by bad guys want to say but cannot to the heels in their lives. Right Through You comes in from the other direction to hit the target; Alanis, as a new woman of the 90s, is far too smart to fall for all the shuck and jive guys try to sell the ladies. She knows what guys want, but she is not about to let herself become nothing more than a conquest some jerk can brag to his friends about. Experience has been one of her teachers, as described in the song You Learn. I think the song Forgiven plays into this theme, as well, although it's a little too complex a song for me to claim I fully understand it - it's got some of the edgiest, most passionate lyrics on the album, though. Of course, nobody's Perfect (clever segue, eh?), and life truly has a painful tendency to be Ironic at just the wrong times, but don't dismiss Alanis as some angry psycho-beast. \nShe knows and likes herself, she knows what she wants \n(Not the Doctor vividly describes what she does not want), \nand Hand in My Pocket proves she is perfectly all right out there on her own. \nWake Up, she urges the rest of us, and go get what you want \nrather than pining away waiting for it to find you. \nThat very love that sends a person completely Head Over Feet is still possible\nalthough you might have to go through a long line of jerks to find it. \nYou don't have to become like Mary Jane, letting yourself waste away without hope. \n\nIn the end, Jagged Little Pill is not as angry an album as it might first appear. \nThis music is all about self-empowerment, standing up and believing in yourself, '\nliving life with both eyes open and a never-dying sense of hope. \nI think a spirit of optimism runs through this music, \nnegating the angry sentiment that lies on the surface. \nI've barely talked about the music itself from this album, \nand part of the reason why, I believe, is the fact that \nJagged Little Pill is one of those rarest of albums, \na collection of songs that transcends the music and speaks to the listener's mind and soul. \nLet it also be known, lest there be any doubt, that \nto quote many a reviewer of music in this little online community of ours this album totally rocks. \n",
  "parsed": {
    "xt": "urn:btih:1688a81b7cbdce2b8159828e541ed0218056f283",
    "dn": "Alanis Morissette Jagged Little Pill 2011 Remastered 320 Kbps",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "1688a81b7cbdce2b8159828e541ed0218056f283",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        22,
        136,
        168,
        27,
        124,
        189,
        206,
        43,
        129,
        89,
        130,
        142,
        84,
        30,
        208,
        33,
        128,
        86,
        242,
        131
      ]
    },
    "name": "Alanis Morissette Jagged Little Pill 2011 Remastered 320 Kbps",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 12,
  "peers": 46,
  "last_updated": "2016-12-26T17:19:34.917Z"
}