{
  "title": "The Piracy Crusade: How the Music Industry&amp;rsquo;s War on Sharin",
  "uid": 10667791,
  "size": 1433403047,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:16e5fd7a3fe0b79c728725b1a6dc9632e6ec343d&amp;dn=The+Piracy+Crusade%3A+How+the+Music+Industry%26rsquo%3Bs+War+on+Sharin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 141,
  "leechers": 23,
  "uploader": "arams",
  "files": -1,
  "time": 1406829780,
  "description": "Full Vuze Bundle for Aram Sinnreich's book &quot;The Piracy Crusade.&quot; \nContains:\nThe Piracy Crusade, by Aram Sinnreich (full edition, PDF)\nThe Piracy Crusade (book cover)\nThe Piracy Crusade at NYU (video lecture, 1:14 hour)\nMusic &amp; Copyright: A Hot, Stinking Mess (video lecture, 2:03 hours)\nThe Piracy Crusade at MusicTechFest (video lecture, 22:07 minutes)\n\nIn the decade and a half since Napster first emerged, forever changing the face of digital culture, the claim that &quot;internet pirates killed the music industry&quot; has become so ubiquitous that it is treated as common knowledge. Piracy is a scourge on legitimate businesses and hard-working artists, we are told, a &quot;cybercrime&quot; similar to identity fraud or even terrorism.\n\nIn The Piracy Crusade, Aram Sinnreich critiques the notion of &quot;piracy&quot; as a myth perpetuated by today's cultural cartels -- the handful of companies that dominate the film, software, and especially music industries. As digital networks have permeated our social environment, they have offered vast numbers of people the opportunity to experiment with innovative cultural and entrepreneurial ideas predicated on the belief that information should be shared widely. This has left the media cartels, whose power has historically resided in their ability to restrict the flow of cultural information, with difficult choices: adapt to this new environment, fight the changes tooth and nail, or accept obsolescence. Their decision to fight has resulted in ever stronger copyright laws and the aggressive pursuit of accused infringers.\n\nYet the most dangerous legacy of this &quot;piracy crusade&quot; is not the damage inflicted on promising start-ups or on well-intentioned civilians caught in the crosshairs of file-sharing litigation. Far more troubling, Sinnreich argues, are the broader implications of copyright laws and global treaties that sacrifice free speech and privacy in the name of combating the phantom of piracy -- policies that threaten to undermine the foundations of democratic society.\n\nFor more information about The Piracy Crusade, visit http://piracycrusade.com",
  "parsed": {
    "xt": "urn:btih:16e5fd7a3fe0b79c728725b1a6dc9632e6ec343d",
    "dn": "The Piracy Crusade: How the Music Industry&rsquo;s War on Sharin",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "16e5fd7a3fe0b79c728725b1a6dc9632e6ec343d",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        22,
        229,
        253,
        122,
        63,
        224,
        183,
        156,
        114,
        135,
        37,
        177,
        166,
        220,
        150,
        50,
        230,
        236,
        52,
        61
      ]
    },
    "name": "The Piracy Crusade: How the Music Industry&rsquo;s War on Sharin",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 1,
  "peers": 2,
  "last_updated": "2016-12-26T17:22:15.398Z"
}