{
  "title": "Windows 7 Ultimate with SP1 X64 Genuine ISO Untouched + Windows7",
  "uid": 7220868,
  "size": 3323724646,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:176ebbb9c620c1419e5dac9e78847259378ae33c&amp;dn=Windows+7+Ultimate+with+SP1+X64+Genuine+ISO+Untouched+%2B+Windows7&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 72,
  "leechers": 13,
  "uploader": "TorDigger",
  "files": 5,
  "time": 1335524533,
  "description": "Windows 7 \n\nDesigned for people who want it all Windows 7 Ultimate is the most versatile and powerful edition of Windows 7. It combines\nremarkable ease-of-use with the entertainment features of Home Premium and the business capabilities of Professional, including\nthe ability to run many Windows XP productivity programs in Windows XP Mode. For added security, you can encrypt your data with \nBitLocker and BitLocker-To-Go. And for extra flexibility, you can work in any of 35 languages. Get it all with Windows 7 Ultimate.\n\n\n\nSimplify everyday tasks\n\n \n\n\n*Simplify your PC with new navigation features like Shake, Jump Lists, and Snap.\n*Personalize your PC by customizing themes, colors, sounds, and more.\n*Easy to network (with or without a server).\n*Back up your complete system over a network.\n*Help protect data on your PC or portable storage device against loss or theft with BitLocker. \n \n Work the way you want\n \n\n\n*Designed to make your PC sleep and resume quicker.\n*Takes full advantage of 32/64-bit PC hardware and memory.\n*Windows XP Mode gives you the business flexibility you need.\n*Switch between any of 35 languages.\n  \n Make new things possible\n \n\n\n*Watch shows for free where and when you want with Internet TV on Windows Media Center.\n*Send media from your PC to devices on your home network\n*Supports more media formats, including integrated video and Dolby audio codecs\n\n\nWhat is Windows 7 USB/DVD Download Tool?\n \nMost of us have come across tools or utilities which allow us to make USB version of Windows or Windows Bootable USB Stick.Now, \nMicrosoft are now officially providing Windows 7 USB/DVD Download Tool\n \nUsing this tool, windows user can install Windows 7 from USB stick or DVD on their Computers / Laptops.\n \nWindows 7 USB/DVD Download Tool burns an ISO of Windows 7 on a USB Stick or DVD. If you have purchased Windows 7 from Microsoft \nStore, then you will be given an option to Download Windows 7 ISO or Compressed Files\n\n\n\nInstallation Instructions:\n\n *Install USB DVD Tool\n *Run Application, browse for downloaded Windows 7 Ultimmate ISO \n *Insert empty DVD or Plug-in USB Drive (4GB Minimum) and install Windows 7 on it\n *Once done, you can use DVD or USB to install Windows 7.\n *For Activation Use Windows7 Loader to Activate Windows 7.\n\n** Note: If x86 bit OS Installed and would like to burn X64 OS than Before Burning Copy bootsect.exe to C:Userswhatever your account nameAppDataLocalAppUSB DVD Tool\n",
  "parsed": {
    "xt": "urn:btih:176ebbb9c620c1419e5dac9e78847259378ae33c",
    "dn": "Windows 7 Ultimate with SP1 X64 Genuine ISO Untouched   Windows7",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "176ebbb9c620c1419e5dac9e78847259378ae33c",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        23,
        110,
        187,
        185,
        198,
        32,
        193,
        65,
        158,
        93,
        172,
        158,
        120,
        132,
        114,
        89,
        55,
        138,
        227,
        60
      ]
    },
    "name": "Windows 7 Ultimate with SP1 X64 Genuine ISO Untouched   Windows7",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 85,
  "peers": 50,
  "last_updated": "2016-12-24T18:15:23.082Z"
}