{"title":"The Power of Self-Confidence Become Unstoppable, Irresistible, a","uid":9406258,"size":1007743,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:18587c9aa6248cb70be7846b0ccbfb9e7cb86001&amp;dn=The+Power+of+Self-Confidence+Become+Unstoppable%2C+Irresistible%2C+a&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":66,"leechers":4,"uploader":"420weedman","files":7,"time":1388165841,"description":"Why are some people more successful than others? Self-confidence! \nWhat one great goal would you set if you knew you could not fail? What wonderful things would you want to do with your life if you were guaranteed success in anything you attempted? \nYour level of self-confidence determines the size of the goals you set, the energy and determination that you focus on achieving them, and the amount of persistence you apply to overcoming every obstacle. In this powerful, practical book based on work with more than 5 million executives, entrepreneurs, sales professionals, and ambitious people in more than sixty countries, you learn how to develop unshakable self-confidence in every area of your life. \nThe Power of Self-Confidence explains how to increase your &quot;mental fitness&quot; by thinking like top performers in every field. Little by little, you build up and maintain ever-higher levels of self-confidence in everything you do. Self-confidence allows you to move out of your comfort zone and take risks without any guarantees. With step-by-step guidance, author Brian Tracy will help you build the foundations of lifelong self-confidence. You discover how to determine what you really want, and unleash your personal powers to accomplish it. \nYou'll learn how to: \nClarify and live consistently with your values to become the very best person you could possibly be \nSet clear goals and make written plans to accomplish them \nCommit yourself to mastery in your chosen field and to lifelong personal improvement \nProgram your subconscious mind to respond in a positive and constructive way to every problem or difficulty \nMinimize your weaknesses and maximize your strengths for higher achievement \nDevelop high levels of courage and incredible persistence. \nBecome unstoppable, irresistible, and unafraid in every area of your life through the power of unshakable self-confidence. Become a person of action, overcome any obstacle, and scale any height. With your newfound unshakable self-confidence, you will accomplish every goal you can set for yourself. ","torrent":{"xt":"urn:btih:18587c9aa6248cb70be7846b0ccbfb9e7cb86001","amp;dn":"The+Power+of+Self-Confidence+Become+Unstoppable%2C+Irresistible%2C+a","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18587c9aa6248cb70be7846b0ccbfb9e7cb86001","infoHashBuffer":{"type":"Buffer","data":[24,88,124,154,166,36,140,183,11,231,132,107,12,203,251,158,124,184,96,1]},"announce":[],"urlList":[]}}