{
  "title": "Plants vs. Zombies",
  "uid": 6635975,
  "size": 85603618,
  "categoryP": "games",
  "categoryS": "pc",
  "magnet": "?xt=urn:btih:1887e309715c2b4dda1f18d4d68834fa9b735ced&amp;dn=Plants+vs.+Zombies&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 130,
  "leechers": 4,
  "uploader": "MR_Games",
  "files": 514,
  "time": 1314559576,
  "description": "                            PortuguÃƒÂªs                  \n\n\nPlantas vs. Zumbis para PC\n\n\nCom uma temÃƒÂ¡tica simplesmente absurda, este jogo conquistou os fÃƒÂ£s de tÃƒÂ­tulos focados no passatempo, onde nÃƒÂ£o existe preocupaÃƒÂ§ÃƒÂ£o com a profundidade da experiÃƒÂªncia, e sim com o nÃƒÂ­vel de divertimento que ela proporciona.\nAqui, vocÃƒÂª entra na pele de um morador de uma cidade atacada por zumbis comedores de cÃƒÂ©rebro, e deve defender seu cÃƒÂ©rebro desses monstros terrÃƒÂ­veis. Parece um jogo comum, mas quando vocÃƒÂª descobre sua arma contra o exÃƒÂ©rcito de comedores de cÃƒÂ©rebro, entende a maluquice hilÃƒÂ¡ria por trÃƒÂ¡s de Plants VS. Zombies.\nNeste jogo, o campo de batalha contra os zumbis ÃƒÂ© o seu jardim, e seu exÃƒÂ©rcito sÃƒÂ£o as plantas, que vocÃƒÂª deverÃƒÂ¡ posicionar estrategicamente ao longo das diversas linhas de que podem ser alvo de ataques inimigos.\nplantas cuspidoras de ervilhas, milhos que lanÃƒÂ§am grÃƒÂ£os e manteiga nos adversÃƒÂ¡rios, cactos que cospem espinhos e muitos outros tipos de plantas sÃƒÂ£o suas armas contra uma variedade enorme de zumbis.\nNo total, sÃƒÂ£o mais de 50 plantas e zumbis diferentes espalhados em 50 nÃƒÂ­veis, alÃƒÂ©m de uma sÃƒÂ©rie de mini-games, puzzles, e outros modos de jogo que ampliam ainda mais a experiÃƒÂªncia de um jogo realmente divertido!\n\n\n                               English\n\n\nPlants vs. Zombie PC\n\n\nWith a theme simply absurd, this game has won over the fans of titles focused on the hobby, where there is concern about the depth of experience, but with the level of entertainment they provide.\nHere, you enter the skin of a resident of a city attacked by brain-eating zombies, and your brain must defend these terrible monsters. Looks like a regular game, but when you find your weapon against the army of brain-eating, understands the crazy hilarious behind Plants VS. Zombies.\nIn this game, the battle against the zombies is your garden, and his army are plants, you should strategically position along several lines that could be targeted by enemy attacks.\nspitting plants of peas, corn and butter beans to throw at opponents, spitting cactus thorns and many other plants are their weapons against a huge variety of zombies.\nIn total, more than 50 plants and zombies scattered in 50 different levels, and a series of mini-games, puzzles, and other game modes that further expand the experience of a really fun game!\n\n\n\n                              EspaÃƒÂ±ol\n\nPlants vs zombi PC\n\n\nCon un tema simplemente absurdo, este juego se ha ganado a los aficionados de los tÃƒÂ­tulos se centrÃƒÂ³ en la aficiÃƒÂ³n, porque existe la preocupaciÃƒÂ³n acerca de la profundidad de la experiencia, pero con el nivel de entretenimiento que proporcionan.\nAquÃƒÂ­ se introduce en la piel de un residente de una ciudad atacada por zombies comiendo el cerebro, y su cerebro tiene que defender a estos monstruos terribles. Se ve como un juego normal, pero cuando descubre que su arma contra el ejÃƒÂ©rcito de los cerebros de comer, a entender la locura detrÃƒÂ¡s de las plantas VS hilarante. Zombies.\nEn este juego, la batalla contra los zombies es su jardÃƒÂ­n, y su ejÃƒÂ©rcito son las plantas, que estratÃƒÂ©gicamente debe colocar a lo largo de varias lÃƒÂ­neas que podrÃƒÂ­an ser el blanco de los ataques enemigos.\nescupiendo las plantas de guisantes, maÃƒÂ­z y frijoles blancos a tirar a los oponentes, escupir espinas de cactus y otras plantas son sus armas contra una gran variedad de zombies.\nEn total, mÃƒÂ¡s de 50 plantas y zombies repartidos en 50 niveles diferentes, y una serie de mini-juegos, rompecabezas y otros modos de juego que amplÃƒÂ­an aÃƒÂºn mÃƒÂ¡s la experiencia de un juego muy divertido!",
  "parsed": {
    "xt": "urn:btih:1887e309715c2b4dda1f18d4d68834fa9b735ced",
    "dn": "Plants vs. Zombies",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "1887e309715c2b4dda1f18d4d68834fa9b735ced",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        24,
        135,
        227,
        9,
        113,
        92,
        43,
        77,
        218,
        31,
        24,
        212,
        214,
        136,
        52,
        250,
        155,
        115,
        92,
        237
      ]
    },
    "name": "Plants vs. Zombies",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 50,
  "peers": 51,
  "last_updated": "2016-12-26T17:33:47.610Z"
}