{
  "title": "Not That Kind of Girl - Lena Dunham - Audiobook MP3",
  "uid": 11196699,
  "size": 178213087,
  "categoryP": "audio",
  "categoryS": "audio_books",
  "magnet": "?xt=urn:btih:18bb2f9a8926ca9586185bde1e4a4ad093ef1ed3&amp;dn=Not+That+Kind+of+Girl+-+Lena+Dunham+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 42,
  "leechers": 2,
  "uploader": "Squiddy82",
  "files": -1,
  "time": 1413101656,
  "description": "MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\nIf you need the single MP3 file chopped up into smaller segments, you can use Audiobook Cutter.\n\n\nNot That Kind of Girl: A Young Woman Tells You What She's 'Learned'\n\nWritten by: Lena Dunham\nNarrated by: Lena Dunham\nLength: 6 hrs and 10 mins\nUnabridged Audiobook\nRelease Date:09-30-14\n\nFor readers or listeners of Nora Ephron, Tina Fey, and David Sedaris, this hilarious, poignant, and extremely frank collection of personal essays confirms Lena Dunham - the acclaimed creator, producer, and star of HBO's Girls - as one of the brightest and most original writers working today.\n\n&quot;If I can take what I've learned in this life and make one treacherous relationship or degrading job easier for you, perhaps even prevent you from becoming temporarily vegan, then every misstep of mine will have been worthwhile. This book contains stories about wonderful nights with terrible boys and terrible days with wonderful friends, about ambition and the two existential crises I had before the age of twenty. About fashion and its many discontents. About publicly sharing your body, having to prove yourself in a meeting full of fifty-year-old men, and the health fears (tinnitus, lamp dust, infertility) that keep me up at night. I'm already predicting my future shame at thinking I had anything to offer you with this book, but also my future glory in having stopped you from trying an expensive juice cleanse or having the kind of sexual encounter where you keep your sneakers on. No, I am not a sexpert, a psychologist, or a registered dietician. I am not a married mother of three or the owner of a successful hosiery franchise. But I am a girl with a keen interest in self-actualization, sending hopeful dispatches from the front lines of that struggle.&quot;",
  "parsed": {
    "xt": "urn:btih:18bb2f9a8926ca9586185bde1e4a4ad093ef1ed3",
    "dn": "Not That Kind of Girl - Lena Dunham - Audiobook MP3",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "18bb2f9a8926ca9586185bde1e4a4ad093ef1ed3",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        24,
        187,
        47,
        154,
        137,
        38,
        202,
        149,
        134,
        24,
        91,
        222,
        30,
        74,
        74,
        208,
        147,
        239,
        30,
        211
      ]
    },
    "name": "Not That Kind of Girl - Lena Dunham - Audiobook MP3",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 44,
  "peers": 14,
  "last_updated": "2016-12-24T18:24:43.235Z"
}