{
  "title": "Avast! Internet Security / Premier 2016 12.2.3126 Incl License",
  "uid": 15448298,
  "size": 488680066,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:18ca3870b2cb07aab6f017625d105a8875338893&amp;dn=Avast%21+Internet+Security+%2F+Premier+2016+12.2.3126+Incl+License&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 53,
  "leechers": 11,
  "uploader": "SadeemPC",
  "files": 2,
  "time": 1469915872,
  "description": "Avast! Internet Security &amp; Premier 2016 12.2.3126 Final\r\n\r\nOur most advanced security suite adds military-grade data shredding and automatic software updates in addition to antivirus, firewall, and Home Network Security. avast! is only the most trusted name in antivirus, actively protecting more than 200 million PCs, Macs and Androids.\r\n\r\nPC, ANTIVIRUS, AND HOME System Security:\r\nSmart antivirus\r\nDistinguishes a wide range of dreadful dangers, from infections to malware. Yes, even spyware, ransomware, and phishing assaults.\r\n\r\nCyberCapture NEW\r\nIndividual, ongoing risk identification. Sends obscure records to the Avast Risk Labs to be broke down by our specialists, and isolates them on the off chance that they're unsafe.\r\n\r\nHome System Security\r\nIs your switch set up appropriately to square dangers? We'll let you know. Else, anybody can break into your home system and anything associated with it.\r\n\r\nShrewd Sweep\r\nA definitive help. Check your PC and system for a wide range of issues in only one simple snap.\r\n\r\nFirewall\r\nYou bolt your front way to keep hoodlums out of your home – so why ought to your PC be any distinctive? Firewall keeps you safe from a wide range of interlopers.\r\n\r\nProgram Cleanup\r\nDispose of puzzle toolbars, additional items, and augmentations that were introduced without you seeing – and without your authorization.\r\n\r\nSandbox\r\nEver downloaded a record from a shady server and suspected it's inconvenience? Test records in a fixed space to start with, and keep whatever remains of your PC safe.\r\n\r\nPasswords\r\nExcessively numerous passwords, none of which are sheltered? It's genuinely basic. Keep in mind only one, and Avast Passwords will deal with the rest.\r\n\r\nPREVENTIVE MEASURES:\r\nAutomatic Software Updater\r\nThe Web is loaded with broad aides on the most proficient method to adventure security issues in obsolete programming. The key is to be speedier than programmers. Naturally.\r\n\r\nInformation Shredder\r\nDo you share your PC, have it repaired, or are going to offer it? It's anything but difficult to recuperate erased records that are for your eyes as it were. Wipe them for good.\r\n\r\nSAFE Installments AND Keeping money:\r\nSecureDNS\r\nYour switch settings can be changed to interface you to a fake site. Why? So programmers can take your keeping money subtle elements. SecureDNS keeps your internet saving money safe.\r\n\r\nAnti-spam\r\nSpam isn't simply irritating. It can be hazardous, as well. Chief keeps you – and your cash – safe from dangers like phishing messages.\r\n\r\nSafeZone Program NEW\r\nThe better approach to scan, bank, and shop. With a suite of apparatuses intended to give additional insurance, find why SafeZone is the world's most secure browser®.\r\n\r\nNew in version 12.2 (Nitro Update)\r\nRegular monthly program updates automatically (default), parameters are available in Settings &gt; Upgrade\r\nFull compatibility with Windows 10 Anniversary Update\r\nNew menu Settings &gt; Components - easy way to control which components are installed and working",
  "parsed": {
    "xt": "urn:btih:18ca3870b2cb07aab6f017625d105a8875338893",
    "dn": "Avast! Internet Security / Premier 2016 12.2.3126 Incl License",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "18ca3870b2cb07aab6f017625d105a8875338893",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        24,
        202,
        56,
        112,
        178,
        203,
        7,
        170,
        182,
        240,
        23,
        98,
        93,
        16,
        90,
        136,
        117,
        51,
        136,
        147
      ]
    },
    "name": "Avast! Internet Security / Premier 2016 12.2.3126 Incl License",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 75,
  "peers": 45,
  "last_updated": "2016-12-26T17:35:41.983Z"
}