{"title":"Trillion Dollar Baby: How Norway Beat the Oil Giants","uid":15896974,"size":2681615,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:194a78fd86c3f8e59bf90da94459152bc7b4715b&amp;dn=Trillion+Dollar+Baby%3A+How+Norway+Beat+the+Oil+Giants&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":58,"leechers":5,"uploader":"marty14","files":1,"time":1474819813,"description":"Trillion Dollar Baby: How Norway Beat the Oil Giants and Won a Lasting Fortune - Paul Cleary [epub]\r\n\r\nFor most of its history, the near-Arctic nation of Norway eked out a marginal existence from fishing, forestry and shipping. But things began to change in 1969, when the country confirmed it had found one of the world’s biggest offshore oilfields. As the revenue from this field and many others started to flow, Norway began to create the world’s best system for developing mineral resources, and for managing the revenue. \r\n\r\nFrom the outset, Norway decided that it was the master and not the servant of Big Oil. Through trial and error it introduced policies to develop industry and know-how, and gained the maximum possible share of the profits. Twenty years after Norway began stashing its cash, the country of just five million people has amassed the world’s largest sovereign wealth fund, with assets of more than US$850 billion – and it’s on track to exceed $1 trillion in 2019. \r\n\r\nUnlike many other countries, Norway has taken a non-renewable resource and turned it into a financial asset that can last for generations to come. This is the story of how they did it.\r\n\r\nPaul Cleary is the author of Mine-Field: The Dark Side of Australia's Resource Rush. He is a senior writer with the Australian and a researcher in public policy at the Australian National University","torrent":{"xt":"urn:btih:194a78fd86c3f8e59bf90da94459152bc7b4715b","amp;dn":"Trillion+Dollar+Baby%3A+How+Norway+Beat+the+Oil+Giants","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"194a78fd86c3f8e59bf90da94459152bc7b4715b","infoHashBuffer":{"type":"Buffer","data":[25,74,120,253,134,195,248,229,155,249,13,169,68,89,21,43,199,180,113,91]},"announce":[],"urlList":[]}}