{
  "title": "Mars One - Humanitys Next Great Adventure (2016) (Epub) Gooner",
  "uid": 15939171,
  "size": 2191368,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:1a6f09a1003e65eebbb942ec5783677756e36401&amp;dn=Mars+One+-+Humanitys+Next+Great+Adventure+%282016%29+%28Epub%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 48,
  "leechers": 3,
  "uploader": "GoonerTPB",
  "files": 2,
  "time": 1475435154,
  "description": "Mars One - Humanity's Next Great Adventure (2016) (Epub) Gooner\r\n\r\nPublisher: BenBella Books (23 Feb. 2016)\r\nLanguage: English\r\nISBN-10: 1940363837\r\nISBN-13: 978-1940363837\r\n\r\nyou may not be able to go to Mars yourself, but thanks to Mars One, you can follow along as Mars's first permanent human settlers prepare for their mission and now, with Mars One: Humanity's Next Great Adventure, you can step inside the experience of these astronaut pioneers as they live out the dreams of millions.\r\n\r\nIn 2013, Mars One announced their intentions to establish a permanent human settlement on Mars beginning as early as 2024; they launched their astronaut selection programme and received thousands of applications.\r\n\r\nMars One: Humanity's Next Great Adventure, explores the various human dimensions of Mars One s planned expeditions to Mars. Edited by Norbert Kraft, MD, Mars One s Chief Medical Officer and head of crew selection and training, and James R. Kass, PhD, and Raye Kass, PhD, the other two members of the Mars One crew selection and training committee, the collection of scientists, psychologists, historians, and others provides a behind-the-scenes look at the process and criteria used to choose candidates, as well as fascinating details about their future life on Mars.\r\n\r\nWhat essential skills and training with the Mars One astronauts need to get to and then survive on Mars?\r\nWhat combination of genders and ages make for the most effective four-person crew? How do individuals cultural backgrounds factor in?\r\nWill settlers be able to communicate with Earth?\r\nWhat can the Mars One mission learn from past periods of human exploration?\r\nWhat are the complexities of a group of four, and ultimately hundreds, operating with complete independence from human societies on Earth?\r\nWhat are the psychological ramifications of knowing your actions are being watched by millions of people? What does Mars One hope watching the process will mean for viewers at home?\r\n\r\nThe book also includes excerpts from official Mars One documents, including candidate questionnaires, and excerpts of letters from prospective crew members",
  "parsed": {
    "xt": "urn:btih:1a6f09a1003e65eebbb942ec5783677756e36401",
    "dn": "Mars One - Humanitys Next Great Adventure (2016) (Epub) Gooner",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "1a6f09a1003e65eebbb942ec5783677756e36401",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        26,
        111,
        9,
        161,
        0,
        62,
        101,
        238,
        187,
        185,
        66,
        236,
        87,
        131,
        103,
        119,
        86,
        227,
        100,
        1
      ]
    },
    "name": "Mars One - Humanitys Next Great Adventure (2016) (Epub) Gooner",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 46,
  "peers": 50,
  "last_updated": "2016-12-26T17:48:20.402Z"
}