{"title":"The Restoration of Rome: Barbarian Popes and Imperial Pretenders","uid":15891893,"size":3717812,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1b76ae354dde016a6669997f0ba74e42c1db95cf&amp;dn=The+Restoration+of+Rome%3A+Barbarian+Popes+and+Imperial+Pretenders&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":61,"leechers":6,"uploader":"marty14","files":1,"time":1474763078,"description":"The Restoration of Rome: Barbarian Popes and Imperial Pretenders - Peter Heather [epub]\r\n\r\nIn 476 AD, the last of Rome's emperors, known as &quot;Augustulus,&quot; was deposed by a barbarian general, the son of one of Attila the Hun's henchmen. With the imperial vestments dispatched to Constantinople, the curtain fell on the Roman empire in Western Europe, its territories divided among successor kingdoms constructed around barbarian military manpower. \r\n\r\nBut, if the Roman Empire was dead, Romans across much of the old empire still lived, holding on to their lands, their values, and their institutions. The conquering barbarians, responding toRome's continuing psychological dominance and the practical value of many of its institutions, were ready to reignite the imperial flame and enjoy the benefits. As Peter Heather shows in dazzling biographical portraits, each of the three greatest immediate contenders for imperial power--Theoderic, Justinian, and Charlemagne--operated with a different power base but was astonishingly successful in his own way. Though each in turn managed to put back together enough of the old Roman West to stake a plausible claim to the Western imperial title, none of their empires long outlived their founders' deaths. Not until the reinvention of the papacy in the eleventh century would Europe's barbarians find the means to establish a new kind of Roman Empire, one that has lasted a thousand years.\r\n\r\nA sequel to the bestselling Fall of the Roman Empire, The Restoration of Rome offers a captivating narrative of the death of an era and the birth of the Catholic Church","torrent":{"xt":"urn:btih:1b76ae354dde016a6669997f0ba74e42c1db95cf","amp;dn":"The+Restoration+of+Rome%3A+Barbarian+Popes+and+Imperial+Pretenders","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b76ae354dde016a6669997f0ba74e42c1db95cf","infoHashBuffer":{"type":"Buffer","data":[27,118,174,53,77,222,1,106,102,105,153,127,11,167,78,66,193,219,149,207]},"announce":[],"urlList":[]}}