{"title":"Turmoil v1.0","uid":14803640,"size":124267237,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1c1a8fee0ee4ac3eb692b34d91628746eb5d5163&amp;dn=Turmoil+v1.0&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":134,"leechers":1,"uploader":"dauphong","files":1,"time":1465152583,"description":"\nAbout This Game\r\nTurmoil offers players a visually charming, tongue-in-cheek take on the simulation genre inspired by the 19th century oil rush in North America. Get a taste of the rush and rivalry of the time as you earn your way to become a successful oil entrepreneur. As you make money digging up and selling oil, the town will grow along with you.\r\n\r\nLease land at the town auction and search for oil. Build a rig, create an efficient pipe network and bring up the oil to store it in silos. Sell the oil at the best times to maximize profits. Then buy essential upgrades in town to cope with rock, gas and ice. Acquire more town shares than your competitors in a bid to become the new mayor.\r\n\r\n    A campaign where you build your rags-to-riches oil baron career and beat your rivals.\r\n    Dozens of upgrades and new tools to improve your oil mining operations.\r\n    Meet the town’s characters in the saloon and make shady business deals.\r\n    Play single game mode to get one of literally millions of procedurally generated levels and earn as much as you can in one year.\r\n    Steam Achievements, Badges, Trading Cards and Cloud Saving.\r\n    Lease land at the town auction and search for oil using a dowser, mole or scanner.\r\n    Maximize your profits by using natural gas to boost the oil price.\r\n    Outbid your competitors at the stock auction","torrent":{"xt":"urn:btih:1c1a8fee0ee4ac3eb692b34d91628746eb5d5163","amp;dn":"Turmoil+v1.0","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c1a8fee0ee4ac3eb692b34d91628746eb5d5163","infoHashBuffer":{"type":"Buffer","data":[28,26,143,238,14,228,172,62,182,146,179,77,145,98,135,70,235,93,81,99]},"announce":[],"urlList":[]}}