{
  "title": "ManyCam 4.1.0.12 Setup and Crack &quot;Enterprise Edition&quot;",
  "uid": 11728584,
  "size": 58620345,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:1c1fbcc9b760a36e38e8baf1c119c1cf413e61d4&amp;dn=ManyCam+4.1.0.12+Setup+and+Crack+%26quot%3BEnterprise+Edition%26quot%3B+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 54,
  "leechers": 1,
  "uploader": "joshfoun",
  "files": 4,
  "time": 1425190149,
  "description": "Yes there is a MANYCAM Enterprise version here: http://manycam.com/buy/pro\n\nMany Cam 4.1 gives you users not only get access to all Pro features, but can activate ManyCam Enterprise on up to 5 different computers, can stream to multiple RTMP servers simultaneously, and get unlimited H264 IP camera support.\n\nThis is VIRUS FREE and I only uploaded it because all I seen was version 3 and I have a habit of upgrading to the more featured programs upon the next version. \n\nI only uploaded this because it took me a long time to find this and I would go on the piratebay like a zombie hoping for a new version and it never came and so here you go; saving you the issue. \n\nAlso if you need help with Windows Operating systems or customizing it; you can find this YouTube channel that I have no association with.... ;) and see what the guy has to offer.\n\n\n\nI only upload things I like and I'm not like the other awesome torrent uploaders and I thank them for helping me explore the many programs I would not be able to afford.\n\n\nManyCam Virtual Webcam Effects &amp; Features\nUse our ManyCam webcam software to turn your computer into a live video production studio.\nDownload\nManyCam\nAdd webcam graphics to videos &amp; photos\nUse your webcam with multiple \napplications simultaneously\nAdd amazing audio microphone \nsound effects\nDraw over your video window\nScreencast your desktop\nPicture in Picture\nQuickly switch between video &amp; audio \nsources\nCreate custom webcam effects\nLower Thirds\nGame Capture\nYouTube Integration\nMobile Source\nManyCam Pro Live Video Production Studio\n\nAdd amazing webcam effects &amp; graphics to your videos and photos.\nAwesome webcam filters make you look even better on cam. Add crazy masks or facial effects using our facial recognition technology. Give yourself a new webcam background so it appears you're on a studio set or make it look you're on fire or like it's snowing in your house! ManyCam has a massive library with thousands of effects.\n      \n\nUse your webcam with many applications simultaneously.\n\nUse Skype, MSN, Ustream, and many other webcam and audio applications at the same time. You can also do the same with our virtual audio sound driver.\nDownload ManyCam Free\n\nAdd amazing microphone audio effects to your broadcast.\n\nUse our voice changer technology to disguise your voice for a screencast voice over, make people laugh, or use it to trick your friends and family. ManyCam is also able to make your microphone &amp; headset audio quality sound better than most normal audio drivers.\nDownload ManyCam Free\n\nDraw over your video window.\n \nUse our built in image editing software to draw over or add text to your live video broadcast. Draw over your video while in Skype, Youtube, or any other video software. Just add ManyCam as your video source for any app!\nDownload ManyCam Free\n\nScreencast your desktop.\n \nRecord your desktop and save the video to your hard drive. You can also screencast live to live video chat services like Ustream, Justin.tv, Skype, and more. Use ManyCam as your video source on Youtube to record a video of your desktop.\nDownload ManyCam Free\n\nPicture in Picture\n\nBroadcast &quot;pnp&quot; or picture in picture video with ManyCam. Screencast your desktop while showing yourself in a smaller video window within that window. Picture in picture is useful for video demonstrations on webcam and live shows. Turn your computer into live news studio with ManyCam's pnp feature.\nDownload ManyCam Free\n\nSwitch between different video sources.\n \nGo to the ManyCam Studio Pro tab to quickly switch between video sources. ManyCam Studio Pro allows up to 6 video sources and the ability to cut or slowly transition between different sources. Use the ManyCam pull-down menu in the source window to add another camera, still image, photo snapshot, a pre-recorded video, and even a desktop screencast as your video source. Turn your computer into a Pro live video production studio with ManyCam.\nDownload ManyCam Free\n\nCreate your own custom webcam effects.\nCreate your own custom objects, face accessories, backgrounds and other graphics to use on ManyCam with our Effect Creation feature.\nWith our new easy to use effect creating platform, you can make your own objects, face accessories, backgrounds and other graphics to use on ManyCam. You can also publish your custom effects to our library or download them straight to your computer. Get creative and have fun!\n\nLower Thirds\n \nMake your video productions more professional with our new Lower Thirds feature. Use this feature to add your name to your video screen, highlight news, or even identify your location.\nDownload ManyCam Free\n\nGame Capture\n \nCapture and record your gameplay with the new Game Video Source. Live stream or record and post your videos later. Record with games like Minecraft, Call of Duty, Far Cry 3, StarCraft and more!\nDownload ManyCam Free\n\nYouTube Integration\n \nStream and broadcast videos found on YouTube easily and quickly with the new YouTube video source! Moreover, you can directly upload your recorded videos to YouTube from ManyCam with the YouTube Uploader feature. Full feature available for free for a limited time only.\nDownload ManyCam Free\n\nMobile Source\n \nUse your mobile phone as a video source in ManyCam with the new ManyCam Mobile Source for Android! Record live videos on the go, away from your computer and stream directly to ManyCam using your phone. Instructions are available on help page. Full feature available for free for a limited time only.\n\nManyCam Studio Pro.\nTurn your webcam and computer into a live video studio\nplus access our Pro audio &amp; video effects.\n \nManyCam Pro allows you to record videos to show later, broadcast live video with multiple sources, switch between audio sources, cross-fade and transition, add text over your live video or screencast and unlock awesome ManyCam Pro audio and video effects.\nUpgrade to Pro",
  "parsed": {
    "xt": "urn:btih:1c1fbcc9b760a36e38e8baf1c119c1cf413e61d4",
    "dn": "ManyCam 4.1.0.12 Setup and Crack &quot;Enterprise Edition&quot; ",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "1c1fbcc9b760a36e38e8baf1c119c1cf413e61d4",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        28,
        31,
        188,
        201,
        183,
        96,
        163,
        110,
        56,
        232,
        186,
        241,
        193,
        25,
        193,
        207,
        65,
        62,
        97,
        212
      ]
    },
    "name": "ManyCam 4.1.0.12 Setup and Crack &quot;Enterprise Edition&quot; ",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 55,
  "peers": 113,
  "last_updated": "2016-12-24T18:50:29.108Z"
}