{
  "title": "Bob Dylan - Nobel Prize in Literature, 2016 (7 books)",
  "uid": 16024983,
  "size": 27853843,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:1e8ad1a51576452625f642428800229e979caf46&amp;dn=Bob+Dylan+-+Nobel+Prize+in+Literature%2C+2016+%287+books%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 40,
  "leechers": 8,
  "uploader": "workerbee",
  "files": 15,
  "time": 1476375783,
  "description": "BOB DYLAN (b. Robert Allen Zimmerman, 1941) is an American singer-songwriter, artist and writer, influential in popular music and culture for more than five decades.  He was awarded the 2016 Nobel Prize in Literature &quot;for having created new poetic expressions within the great American song tradition.&quot;\n\nMuch of his most celebrated work dates from the 1960s when his songs chronicled social unrest, although Dylan repudiated suggestions from journalists that he was a spokesman for his generation. Nevertheless, early songs such as &quot;Blowin' in the Wind&quot; and &quot;The Times They Are a-Changin'&quot; became anthems for the American civil rights and anti-war movements. Leaving behind his initial base in the American folk music revival, his six-minute single &quot;Like a Rolling Stone&quot;, recorded in 1965, enlarged the range of popular music. Dylan's mid-1960s recordings, backed by rock musicians, reached the top end of the United States music charts while also attracting denunciation and criticism from others in the folk movement.\n\nDylan's lyrics have incorporated various political, social, philosophical, and literary influences. They defied existing pop music conventions and appealed to the burgeoning counterculture. Initially inspired by the performances of Little Richard and the songwriting of Woody Guthrie, Robert Johnson, and Hank Williams, Dylan has amplified and personalized musical genres. His recording career, spanning more than 50 years, has explored the traditions in American song -- from folk, blues, and country to gospel, rock and roll, and rockabilly to English, Scottish, and Irish folk music, embracing even jazz and the Great American Songbook. His accomplishments as a recording artist and performer have been central to his career, but songwriting is considered his greatest contribution.\n\nDylan has been inducted into the Rock and Roll Hall of Fame, Minnesota Music Hall of Fame, Nashville Songwriters Hall of Fame, and Songwriters Hall of Fame. The Pulitzer Prize jury in 2008 awarded him a special citation for &quot;his profound impact on popular music and American culture, marked by lyrical compositions of extraordinary poetic power.&quot; In May 2012, Dylan received the Presidential Medal of Freedom from President Barack Obama. \n\nDylan has published TARANTULA (1971), a work of prose poetry, CHRONICLES: Volume One (2004), the first part of his memoirs, and several books of his song lyrics.  The biographical and critical literature on Dylan is vast, but as usual in this torrent I have only included works by Dylan himself or compilations of his lyrics and interviews.\n\n\nThe following books are in ePUB or PDF format as noted:\n\n* Bob Dylan Anthology (Music Sales America, 1992) -- PDF\n\n* Bob Dylan Songbook (n.p., 2006).  Compiled by Eyolf Østrem. -- PDF\n\n* Chronicles, Volume One (Simon &amp; Schuster, 2004) -- ePUB\n\n* Interviews from the 1960s (n.p., n.d.) -- PDF\n\n* Lyrics: 1962-2001 (Simon &amp; Schuster, 2004) -- ePUB\n\n* Playboy Interviews, The (Playboy, 2012) -- ePUB\n\n* Tarantula (Penguin, 1977 / Scribner, 2004) -- PDF + ePUB\n\n_____________________________________________________________________________\n\n\nCONTACT ME: You can reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account):\n  \nhttps://pirates-forum.org/User-workerbee  \n\nPLEASE HELP TO SEED!  If you like these books and want others to have access to them, please help to seed for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!",
  "parsed": {
    "xt": "urn:btih:1e8ad1a51576452625f642428800229e979caf46",
    "dn": "Bob Dylan - Nobel Prize in Literature, 2016 (7 books)",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "1e8ad1a51576452625f642428800229e979caf46",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        30,
        138,
        209,
        165,
        21,
        118,
        69,
        38,
        37,
        246,
        66,
        66,
        136,
        0,
        34,
        158,
        151,
        156,
        175,
        70
      ]
    },
    "name": "Bob Dylan - Nobel Prize in Literature, 2016 (7 books)",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 48,
  "peers": 166,
  "last_updated": "2016-12-24T19:09:09.568Z"
}