{
  "title": "Complete Original Doctor Who",
  "uid": 6725378,
  "size": 216352842408,
  "categoryP": "video",
  "categoryS": "tv_shows",
  "magnet": "?xt=urn:btih:1f99a52ade71ccf28e4c8925a1150fff1406bfa7&amp;dn=Complete+Original+Doctor+Who&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 52,
  "leechers": 166,
  "uploader": "ghedipunk",
  "files": 732,
  "time": 1317925084,
  "description": "This is the complete ORIGINAL collection of Doctor Who episodes.\n\nIf you are new to Doctor Who, then this is probably NOT the torrent you're looking for.\n\nThis torrent contains all of the episodes from the original 8 Doctors: William Hartnell, Patrick Troughton, Jon Pertwee, Tom Baker, Peter Davison, Colin Baker, Sylvester McCoy, and the Doctor Who movie with Paul McGann.  \n\nThe episodes ran from 1963 until 1989, and the movie aired on TV in 1996.\n\nI didn't have anything to do with making the actual video files, I just compiled this torrent together.  With that being said, though, please give thanks to the community who have worked hard to make the episodes available, and for those amazing people who did their best to reconstruct the lost episodes.\n\nBear in mind that the reconstructions aren't perfect...  well, you'll see. I hope you'll agree that they're much better than not having those lost episodes at all, though.\n\nFinally, this is HUGE.  It will take a LONG time for me to upload, and a long time for you to download.\n\nI plan on seeding this myself for a few months, at least, and joining in as a seed from time to time afterwards, as long as there is still interest in this collection.  Unfortunately, I can't guarantee 100% uptime...  but I can say that I'll be checking the status multiple times per day, and will bring my network connection back up as quickly as possible if it does go down.\n\nFinally, if you are new to Doctor Who, then welcome.  I heartily recommend starting with the reboot of the series that started airing in 2005 and is continuing on today.  After you have caught up, feel free to come back to these original episodes...  you may want to start the download now, though, so that you don't have to wait too long.",
  "parsed": {
    "xt": "urn:btih:1f99a52ade71ccf28e4c8925a1150fff1406bfa7",
    "dn": "Complete Original Doctor Who",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "1f99a52ade71ccf28e4c8925a1150fff1406bfa7",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        31,
        153,
        165,
        42,
        222,
        113,
        204,
        242,
        142,
        76,
        137,
        37,
        161,
        21,
        15,
        255,
        20,
        6,
        191,
        167
      ]
    },
    "name": "Complete Original Doctor Who",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 218,
  "peers": 38,
  "last_updated": "2016-12-24T19:16:59.512Z"
}