{
  "title": "The.100.S02E11.720p.HDTV.x264-KILLERS",
  "uid": 11681510,
  "size": 1751918641,
  "categoryP": "video",
  "categoryS": "hd___tv_shows",
  "magnet": "?xt=urn:btih:1f9bf2ab93e92480134d354f7ff34ac4c8952d4d&amp;dn=The.100.S02E11.720p.HDTV.x264-KILLERS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 49,
  "leechers": 11,
  "uploader": "Thhaque",
  "files": 1,
  "time": 1423127314,
  "description": "[b]The 100\n\n[IMG]http://i.imgur.com/BFR7UqV.jpg[/IMG]\n\nGenre: Sci-Fi\nYear: 2014\nCountry: USA\nRuntime: 45 min\nCreator: Kass Morgan, Jason Rothenberg\nCreator: Jason Rothenberg\nCast: Eliza Taylor, Bob Morley, Devon Bostick, Sachin Sahel, Marie Avgeropoulos\n\n.: Plot :.\nNinety-seven years ago, nuclear Armageddon decimated planet Earth, destroying civilization. The only survivors were the 400 inhabitants of 12 international space stations that were in orbit at the time. Three generations have been born in space, the survivors now number 4,000, and resources are running out on their dying &quot;Ark&quot; - the 12 stations now linked together and repurposed to keep the survivors alive. Draconian measures including capital punishment and population control are the order of the day, as the leaders of the Ark take ruthless steps to ensure their future, including secretly exiling a group of 100 juvenile prisoners to the Earth's surface to test whether it's habitable. For the first time in nearly a century, humans have returned to planet Earth. Among the 100 exiles are Clarke, the bright teenage daughter of the Ark's chief medical officer; Wells, son of the Ark's Chancellor; the daredevil Finn; and the brother/sister duo Bellamy and Octavia, whose illegal sibling status has always led them to flaunt the rules. Technologically blind to what's happening on the planet below them, the Ark's leaders - Clarke's widowed mother, Abby; the Chancellor, Jaha; and his shadowy second in command, Kane - are faced with difficult decisions about life, death and the continued existence of the human race. For the 100 young people on Earth, however, the alien planet they've never known is a mysterious realm that can be magical one moment and lethal the next. With the survival of the human race entirely in their hands, THE 100 must find a way to transcend their differences, unite and forge a new path on a wildly changed Earth that's primitive, intense and teeming with the unknown.[/b]",
  "parsed": {
    "xt": "urn:btih:1f9bf2ab93e92480134d354f7ff34ac4c8952d4d",
    "dn": "The.100.S02E11.720p.HDTV.x264-KILLERS",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "1f9bf2ab93e92480134d354f7ff34ac4c8952d4d",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        31,
        155,
        242,
        171,
        147,
        233,
        36,
        128,
        19,
        77,
        53,
        79,
        127,
        243,
        74,
        196,
        200,
        149,
        45,
        77
      ]
    },
    "name": "The.100.S02E11.720p.HDTV.x264-KILLERS",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 60,
  "peers": 8,
  "last_updated": "2016-12-24T19:17:05.530Z"
}