{"title":"Batman - The Complete Hush (2005, Digital, Zone-Empire)","uid":9538131,"size":454003638,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:201292f0548301a98fa8db0ca2bd0e2085f0d5db&amp;dn=Batman+-+The+Complete+Hush+%282005%2C+Digital%2C+Zone-Empire%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":60,"leechers":4,"uploader":"VikTSlick","files":-1,"time":1390970845,"description":"For more information about this story arc, please check the wikilink here: http://en.wikipedia.org/wiki/Batman:_Hush\n\nPromotional info for this release - &quot;Batman: The Complete Hush (2005) (Digital HC) English | CBR | 299 pages | 432.97 MB BATMAN: HUSH is a thrilling mystery of action, intrigue, and deception penned by Jeph Loeb (BATMAN: THE LONG HALLOWEEN) and illustrated by comics superstar Jim Lee (ALL STAR BATMAN &amp; ROBIN, THE BOY WONDER) in which Batman sets out to discover the identity of a mysterious mastermind using the Joker, Riddler, Ra's al Ghul and the Dark Knight's other enemies--and allies--as pawns in a plan to wreak havoc. Collects BATMAN #608-619.&quot;\n\nPreviously only available in two volumes, this hardcover collects one of the best modern Batman stories in a single trade. Who is Hush, and why does he want to attack Batman so much? Jeph Loeb excels that the detective/mystery aspect of Batman's character - as evidenced by his other two excellent long-form stories, &quot;The Long Halloween&quot; and &quot;Dark Victory&quot; - and he plays it even better here, using Hush as a puppet master pulling the strings on Batman's famous rogues gallery. Instead of his previous collaborator Tim Sale, this time the vaunted Jim Lee pairs with him and it is perhaps Lee's best work ever. Lee gets a lot of flack sometimes for being partially responsible for the over-muscular &quot;90's look&quot; that came to define Rob Liefeld in such a negative light. However, based on the gorgeous and creative work in Hush - especially on Batman, who has rarely looked better - Lee has clearly progressed as a major artist (while Liefeld...has not). Both Loeb and Lee are at the top their game here and it is one of the reasons why this is considered a modern classic. Thanks to Zone-Empire for this digital copy - please seed, and enjoy! :-)","torrent":{"xt":"urn:btih:201292f0548301a98fa8db0ca2bd0e2085f0d5db","amp;dn":"Batman+-+The+Complete+Hush+%282005%2C+Digital%2C+Zone-Empire%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"201292f0548301a98fa8db0ca2bd0e2085f0d5db","infoHashBuffer":{"type":"Buffer","data":[32,18,146,240,84,131,1,169,143,168,219,12,162,189,14,32,133,240,213,219]},"announce":[],"urlList":[]}}