{
  "title": "dBpoweramp Music Converter R15.1 Ref.Ed. Retail [ChingLiu]",
  "uid": 10429304,
  "size": 25827006,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:20506061cf21189c6b98c4dd2f74bbe9561f84e9&amp;dn=dBpoweramp+Music+Converter+R15.1+Ref.Ed.+Retail+%5BChingLiu%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 80,
  "leechers": 1,
  "uploader": "Ching_Liu",
  "files": -1,
  "time": 1403743734,
  "description": "Audio conversion perfected, effortlessly convert to mp3, FLAC, Apple lossless and more. dBpoweramp Music Converterâ„¢ has become the standard tool for audio conversions, over 30 million users world trust their converting to dBpoweramp:\n\nmp3 Converter - Convert mp3, m4a (iTunes &amp; iPod), WMA, WAV, AIFF, AAC, FLAC, Apple Lossless (ALAC) to name a few.\n\nBatch Convert - large numbers of files with 1 click, filter on mp3 or other file type.\n\nHigh Speed Conversions - Look for a mp3 converter which encodes using all CPU cores simultaneously, get the job done in double quick time.\n\nDSP Effects - process the audio with Volume Normalize, or Sample / Bit Rate Conversion. dBpoweramp is a fully featured mp3 Converter.\n\nNo Malware - Free converters come with a little extra (a spying toolbar, Trojan, malware, or virus), dBpoweramp has never bundled in 15 years, those wanting an mp3 converter, get just that and only that. No Trojan, no malware, no viruses.\n\nSimplicity - dBpoweramp integrates into Windows Explorer, an mp3 converter that is as simple as right clicking on the source file &gt;&gt; Convert To. Popup info tips, Edit ID-Tags are all provided.\n\nIt is safe to say, no other audio program converts more multi-format audio files than dBpoweramp, we have spent 15 years perfecting format-compatibility and conversion stability. If converting FLAC to mp3, wma to mp3, or wav to mp3, dBpoweramp is the right choice.\n\nIncluded Codecs: Wave, AIFF, Mp3 (Lame), Apple Lossless, [Multi-Encoder] and FLAC\n\nVersion Changes Release 15.1\n\n-Changed overwrite page so works on non-standard windows (onshow was called twice)\n-Can enter a dynamic naming string of more than 1000 characters\n-Acquire from scanner, works on 64 bit system where does not have 64 bit scanner drivers\n-Batch Converter: auto expands tree item on selection\n-Batch Converter: if started from a location cannot find in network, it is added anyhow\n- Conversion error and info page now accepts escape key to close\n- 64 bit installation will clean parts of the 32 bit install which would cause a conflict if left\n-FLAC ID tags updated to preserve all r in lyric tag\n-m4a decoder optimized for fast property reading\n-Professional Frequency conversion enabled for all routines\n-Popup info tip no longer shows a negative compression ratio (was previously possible with rounding errors)\n-CD Ripper: artist column always shown, even if not a compilation\n-CD Ripper: submit to AMG and AMG settings page removed as no longer relevant\n-Comments with multi lines, for mp3 are written to a single comment tag (was previously multiple comment tags)\n-m4a decoder update is now compatible with converting audio from video m4a files\n\nBug Fixes\n\n-Property handler dll (64 bit) had a msvcrt100.dll dependency which has now been removed\n-mp3 files which were very short (mili seconds) would not decode\n-Batch Converter, if press space to select check in folder, it did not toggle correctly\n-CD Ripper: manual meta review page, if change an item such as artist when in compilation mode, then click the composer to all button the old artist value would appear\n-AIFF was possible for id tagger to corrupt the file\n-ALAC decoder would not work if file was 24 bit and 6 or more channels\n-if set dynamic naming to [origpath][origfilename] in music converter then list / rename, the output to filename would be blank\n-id3v2 tag writer would read a written rating of 1 as 0.5 (also 2 was affected)\n-wave-mp3 encoder now more compatible with other applications\n-cd ripper could crash whilst encoding\n-cd ripper &gt;&gt; column menu &gt;&gt; Default Columns works once more\n-Could lockup explorer whilst the edit tag page was shown on 64 bit Windows\n\nSystem Requirements\n\nWindows 8, Windows 7, Vista and XP (SP3). Unicode capable, both 32 and 64 bit. compatible.\n\nLanguage : English\n\nHomepage :  &lt;a href=&quot;\nhttp://www.dbpoweramp.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.dbpoweramp.com/&lt;/a&gt;",
  "parsed": {
    "xt": "urn:btih:20506061cf21189c6b98c4dd2f74bbe9561f84e9",
    "dn": "dBpoweramp Music Converter R15.1 Ref.Ed. Retail [ChingLiu]",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "20506061cf21189c6b98c4dd2f74bbe9561f84e9",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        32,
        80,
        96,
        97,
        207,
        33,
        24,
        156,
        107,
        152,
        196,
        221,
        47,
        116,
        187,
        233,
        86,
        31,
        132,
        233
      ]
    },
    "name": "dBpoweramp Music Converter R15.1 Ref.Ed. Retail [ChingLiu]",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 17,
  "peers": 19,
  "last_updated": "2016-12-26T18:32:35.085Z"
}