{
  "title": "Folder Lock 7.6 Final + Key [4realtorrentz]",
  "uid": 13693294,
  "size": 8840525,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:2154581c0d6ec4702798df6652791a467d1913a1&amp;dn=Folder+Lock+7.6+Final+%2B+Key+%5B4realtorrentz%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 37,
  "leechers": 1,
  "uploader": "menin1",
  "files": 1,
  "time": 1456643343,
  "description": "Folder Lock is fast file-security software that can password-protect, lock, hide, and encrypt any number of files, folders, drives, pictures, and documents in seconds. Locked files are undeletable, unrenamable, unmovable, hidden, and inaccessible. You can lock, scramble, or encrypt depending on speed and security.\r\n\r\nFolder Lock is fully portable, so you can protect your files on USB flash drives, disks, CD-RWs, notebooks, and hard disks, and it does not require installation on another PC. Folder Lock protects files in Windows, DOS, and Safe modes, even when you change your OS or boot from a disk. Folder Lock does not let you delete its own program folder, and it can not be uninstalled without the correct password. Additional options include Stealth Mode, Hacker Attempt Monitoring, Shred files, AutoLock, Auto Shutdown PC, Lock your PC, Erase PC tracks, 256-bit Blowfish Encryption and Context Menu in Explorer.\r\n\r\nFeatures:\r\n\r\nFastest Encryption: With Folder Lock you can now encrypt your files faster than ever. The program creates Lockers, without taking up much space and grow as you dump files in it. Lockers are encrypted, resizable, portable and ready for backup. Secure Backup: Folder Lock 7 allows you to optionally backup all files and folders you keep in your encrypted Lockers automatically while you continue to modify or access your encrypted files. Files remain encrypted at both ends. Additional Security: Users can now achieve true portable security, application level password security, activate stealth options, shred files, make wallets, clean history, auto protect the application and all its files, use virtual keyboard to type passwords to prevent key logging of any kind and can prevent hacking and incorrect password attempts. True Ease of Use: Folder Lock 7 leverages NewSoftwares highly regarded graphical user interface. Existing Folder Lock users will be immediately productive its the same great console they already know and love. New users will find Folder Lock 7 remarkably easy to configure and use. Even relative novices can use all features of the product without going through all the jargon and how tos.\r\n\r\nInstructions:\r\n\r\n1. Unpack and install\r\n2. Use given details to register\r\n3. Add 127.0.0.1 http://www.newsoftwares.net to\r\nC:WindowsSystem32driversetchosts or block with firewall\r\n4. Done",
  "parsed": {
    "xt": "urn:btih:2154581c0d6ec4702798df6652791a467d1913a1",
    "dn": "Folder Lock 7.6 Final   Key [4realtorrentz]",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "2154581c0d6ec4702798df6652791a467d1913a1",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        33,
        84,
        88,
        28,
        13,
        110,
        196,
        112,
        39,
        152,
        223,
        102,
        82,
        121,
        26,
        70,
        125,
        25,
        19,
        161
      ]
    },
    "name": "Folder Lock 7.6 Final   Key [4realtorrentz]",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 38,
  "peers": 84,
  "last_updated": "2016-12-24T19:29:52.155Z"
}