{
  "title": "RSD JULIEN  TENGAME",
  "uid": 14663855,
  "size": 9661081661,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:224b3df01e3b0f0caaa2797c78b82a18148395b4&amp;dn=RSD+JULIEN++TENGAME&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 68,
  "leechers": 12,
  "uploader": "502bb",
  "files": 37,
  "time": 1463789247,
  "description": "Focus on the Uniqueness\r\n\r\nYour soul, your uniqueness, your being isn't something you can logically understand.\r\n\r\nIt's abstract, it comes before words...\r\n\r\nIt's something that you have to EMOTIONALLY RECOGNIZE.\r\n\r\nIt's something you have to EXPERIENCE.\r\n\r\nThis is what TenGame is all about.\r\n\r\nIt's there to get you back in touch with yourself...\r\n\r\nIt's there to reconnect you with who you truly are...\r\n\r\nIt's there to get you back into your seat of power.\r\n\r\nAs long as you stay stuck in the &quot;doing&quot;, the game will always feel empty.\r\n\r\nIt's always going to be stressful...\r\n\r\nIt's never really going to be you...\r\n\r\nIt's never going to be that powerful...\r\n\r\nYou have to re-connect with YOU.\r\n\r\nNot who you THINK you area...\r\n\r\nNot what society WANTS you to be...\r\n\r\nNot with the FAKE front that you've been trained to put on...\r\n\r\nBut with YOU - the REAL you.\r\n\r\nYou can't keep trying to fill the void by looking outside.\r\n\r\nYou have to look INSIDE.\r\nIf you're a beginner...\r\n\r\nIf you're new and you're watching this, the truth is:\r\n\r\nYou probably don't know where to start...\r\n\r\nThere is so much information out there, that it's easy to get stuck in the weeds.\r\n\r\nThis is a big misconception when it comes to learning game:\r\n\r\nYou think you have to go from having... to doing. ... to being...\r\n\r\nWRONG!\r\n\r\nYou don't have to go through the &quot;having&quot; and &quot;doing&quot; to get to the &quot;being&quot;...\r\n\r\nJust START WITH THE BEING!\r\n\r\nEverything comes from the being...\r\n\r\nAs soon as you tap into your uniqueness... Into your soul... Into your being - Everything else will flow from there.\r\n\r\nYou will not have to waste all of this time learning new techniques, tips, tricks that don't work - Everything you do will be MASSIVELY IMPACTFUL from the start because it will come from the right place.\r\nIf you're intermediate...\r\n\r\nIf you're intermediate, you probably already know what to &quot;do&quot; - And that's EXACTLY THE PROBLEM.\r\n\r\nYou've been &quot;doing&quot;, while focusing on the wrong &quot;being&quot;.\r\n\r\nAnd we're going to take that &quot;doing&quot;, and move it to the right &quot;being&quot;.\r\n\r\nYou will realize that all of these little habits, all of these techniques, all of these things you've been saying have been coming from the WRONG PLACE, and as soon as you change the place they're coming from - your results will EXPLODE\r\n\r\nTenGame is going to shift your focus back on the things that really matter, and get you back in touch with the things that make game such a beautiful experience in the first place.\r\n\r\nThis is what will give you that consistency\r\n\r\nIf you're intermediate, you've had some good nights out, you've had those epic experiences that have you hooked on game.\r\n\r\nAnd you want to have more.\r\n\r\nWith TenGame, you can - and you WILL.\r\n\r\nOnce you get FOCUSED on the being, you will not have a bad night out again\r\nIf you're advanced...\r\n\r\nIf you're advanced, it's all about the nuances.\r\n\r\nThe more advanced you are, the more subtle the nuances become:\r\n\r\nThe nuances in your mindset, the nuances in your progress, and the nuances in your communication...\r\n\r\nTo add on top of it - You're the best out of all of your friends, the best out of all your wings - there's no one to guide you forward, there's no one to point these nuances out.\r\n\r\nIt's a lot harder to go from a 9.5 to a 10 out of 10 than to go from a 6 to a 8 out of ten.\r\n\r\nIn TenGame, I will point these nuances out to you, I will hone in on them, and I will show you exactly where you can get the maximum leverage to skyrocket your game.\r\n\r\nThe subtle tweaks, the adjustments, the precision - THAT'S what you will get out of TenGame.\r\nThe focus of TenGame\r\nis to get you RESULTS.\r\n\r\nThat means - TenGame is not about the QUANTITY of content, it's about the QUALITY.\r\n\r\nMore and more content...\r\nMore and more things to do...\r\n\r\nAll it's doing is distracting you from the being, it's stifling you from bringing that out... from expressing it... from unleashing it...\r\n\r\nThat's why TenGame is built on TEN CORE CONCEPTS!\r\n\r\nInstead of focusing on all of the little details (the micro concepts), the focus of TenGame is on the MACRO concepts.\r\n\r\nThis will give you enough flexibility to bring out that uniqueness instead of being paralyzed every time you go out!\r\n\r\nAnd with these concepts at your fingertips, you will no longer have to guess your way through life - you will simply KNOW",
  "parsed": {
    "xt": "urn:btih:224b3df01e3b0f0caaa2797c78b82a18148395b4",
    "dn": "RSD JULIEN  TENGAME",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "224b3df01e3b0f0caaa2797c78b82a18148395b4",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        34,
        75,
        61,
        240,
        30,
        59,
        15,
        12,
        170,
        162,
        121,
        124,
        120,
        184,
        42,
        24,
        20,
        131,
        149,
        180
      ]
    },
    "name": "RSD JULIEN  TENGAME",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 80,
  "peers": 50,
  "last_updated": "2016-12-24T19:37:24.035Z"
}