{
  "title": "ArtRage Studio Pro 4.0.2 By NASWARI+ZOHAIB",
  "uid": 8607998,
  "size": 82443667,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:22515441287cfed3814adf1866316d76675fee37&amp;dn=ArtRage+Studio+Pro+4.0.2+By+NASWARI%2BZOHAIB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 91,
  "leechers": 0,
  "uploader": "NZupload",
  "files": -1,
  "time": 1372069853,
  "description": "Program name: ArtRage Studio Pro\nProgram Version: 4.0.2 Retail\nOfficial site: ArtRage\nLanguage: Multi / Russian\nTreatment: Complete\n\nDescription:\n\nArtRage Studio - painting package designed to provide realistic results, using the methods of drawing on a canvas with different tools, such as for example pens, pencils and crayons. You can work with the program, taking advantage of the benefits of the unique interaction of pen and screen that allows you to experience the reality of painting.\nEditing software simulates drawing on plain paper, the usual tools for the artist. Throughout the design sense of realism. Liszt, in which paint, easy turns, approaches and removed. The only tools you can choose the pencil, brush, pen, pastels, and many others. There is pressure adjustment, with the attached drawing of an instrument, such as a brush or pencil. When drawing the panel is automatically cleaned without interfering with the finish line.\n\nFeatures:\n Only art tools\n support plates, angle, pressure\n You can put a pattern and draw on it paints\n Set the scale, transparency\n Layers and operations on them\n Metallic paint (included under the pallets color)\n As a large variety of built-in palette\n Like the children, and easily mastered by them, intuitive and easy interface\n\nChanges in version 4:\n\nSymmetrical pattern: create a &quot;mirror&quot; canvas on which to automatically reflected strokes that you draw.\nToolkit: one toolbar collection of color palettes, presets, and other tools that you are involved in the current picture.\nView canvases: floating tooltip window, which displays a portion or the entire canvas on which you are working.\nScraps: will draw on scraps of canvas that can be used as a palette for mixing paints or test piece.\nWorkplace: turns the entire interface in a single panel with a customizable space for current tools.\nThe new instrument panel design characteristics: appearance of the redesigned to improve workflow and add clarity.\nTool &quot;Clone&quot;: duplicate image with all the properties of the canvas.\nThe tiled and gradient fills: a new instrument panel features &quot;Fill&quot; will create gradients (smooth color transitions), and tile patterns.",
  "parsed": {
    "xt": "urn:btih:22515441287cfed3814adf1866316d76675fee37",
    "dn": "ArtRage Studio Pro 4.0.2 By NASWARI ZOHAIB",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "22515441287cfed3814adf1866316d76675fee37",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        34,
        81,
        84,
        65,
        40,
        124,
        254,
        211,
        129,
        74,
        223,
        24,
        102,
        49,
        109,
        118,
        103,
        95,
        238,
        55
      ]
    },
    "name": "ArtRage Studio Pro 4.0.2 By NASWARI ZOHAIB",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 150,
  "peers": 72,
  "last_updated": "2016-12-26T18:47:51.863Z"
}