{"title":"Microsoft Excel 2013 - Complete (Shelly Cashman Series)(gnv64)","uid":10701561,"size":66466305,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:22ae1f67d86f64a41d174bf50ba61c57ca783482&amp;dn=Microsoft+Excel+2013+-+Complete+%28Shelly+Cashman+Series%29%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":92,"leechers":3,"uploader":"gnv65","files":-1,"time":1407232812,"description":"Microsoft Excel 2013 - Complete (Shelly Cashman Series)\nby Steven M. Freund, Mali Jones and Joy L. Starks\nCengage Learning | August 2013 | ISBN: 1285168445 | True PDF | 592 pages | 63.3 mb\n\nIntroduce your students to the latest that Microsoft Office has to offer with the new generation of Shelly Cashman Series books! For the past three decades, the Shelly Cashman Series has effectively introduced computer skills to millions of students. With Microsoft Excel 2013, we're continuing our history of innovation by enhancing our proven pedagogy to reflect the learning styles of today's students. In this text you'll find features that are specifically designed to engage students, improve retention, and prepare them for future success. Our trademark step-by-step, screen-by-screen approach now encourages students to expand their understanding of Microsoft Excel 2013 through experimentation, critical thought, and personalization. With these enhancements and more, the Shelly Cashman Series continues to deliver the most effective educational materials for you and your students.\n\nAbout the Authors\nSteven M. Freund attended the University of Central Florida, and has taught various Microsoft Office, computer concepts, programming, and various Internet technology courses in the Central Florida area. Working with the Shelly Cashman Series since 2001, he has presented at the annual customer conference, the Shelly Cashman Series Institute, as well as other customer events. Steven has co-authored multiple editions of Discovering Computers, Mozilla Firefox, Windows Internet Explorer, Windows, Office, and Dreamweaver books, as well as various instructor supplements.\nMali B. Jones has more than 20 years of editorial, instructional and support experience in the field of computer and information technology. She has been associated with the Shelly Cashman Series for nearly 10 years, providing editorial, authoring, and product management services.\nJoy L. Starks is a Professor of Computer and Information Technology at Indiana University Purdue University Indianapolis. She has written chapters in several of the Shelly Cashman Series Office books and authored the Photoshop, Java Programming, and Microsoft Publisher series of books. As well as speaking engagements, she also hosts the nationally-renowned Tech Camp for Teachers on the IUPUI campus each summer.\n\nCONTENTS\nOffice 2013 and Windows 8: Essential Concepts and Skills. \nOffice 365 Essentials. \n1. Creating a Worksheet and a Chart. \n2. Formulas, Functions, and Formatting. \n3. Working with Large Worksheets, Charting, and What-If Analysis. \n4. Working with Multiple Worksheets and Workbooks. \n5. Financial Functions, Data Tables, and Amortization Schedules. \n6. Creating, Sorting, and Querying a Table. \n7. Creating Templates, Manipulating Data, and Adding Additional Enhancements to a Worksheet. \nIndex. \nQuick Reference. \nImportant Notes for Windows 7 Users.\n","torrent":{"xt":"urn:btih:22ae1f67d86f64a41d174bf50ba61c57ca783482","amp;dn":"Microsoft+Excel+2013+-+Complete+%28Shelly+Cashman+Series%29%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22ae1f67d86f64a41d174bf50ba61c57ca783482","infoHashBuffer":{"type":"Buffer","data":[34,174,31,103,216,111,100,164,29,23,75,245,11,166,28,87,202,120,52,130]},"announce":[],"urlList":[]}}