{"title":"Minecraft 1.6.1 (TeamExtreme)(1-click run)(registred)","uid":8651120,"size":62390210,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:22bc123ea5ddaf3fefd0a99dad2e05da297e3ace&amp;dn=Minecraft+1.6.1+%28TeamExtreme%29%281-click+run%29%28registred%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":48,"leechers":0,"uploader":"The_Duck1","files":-1,"time":1373106701,"description":"No need for serials and cracks to get the full version, (already done it for you).\nNo unnecessary registry changes. \nNo boring installation of tool-bars in your browser or other unwanted things.\nYou can even run this torrent from an USB-Stick.\nEasy Uninstall with the Windows control panel.\nChoose where you want to put the files on your PC. \nThese are a few things that makes a '2-click run' version a better version.\n\nIf everybody seeds, you will get higher downloading speeds.\n\nDescription:\nMinecraft is a sandbox indie game originally created by Swedish programmer Markus &quot;Notch&quot; Persson and later developed and published by Mojang. It was publicly released for the PC on May 17, 2009, as a developmental alpha version and, after gradual updates, was published as a full release version on November 18, 2011. A version for Android was released a month earlier on October 7, and an iOS version was released on November 17, 2011. On May 9, 2012, the game was released on Xbox 360 as an Xbox Live Arcade game, co-developed by 4J Studios. All versions of Minecraft receive periodic updates.\nThe creative and building aspects of Minecraft allow players to build constructions out of textured cubes in a 3D procedurally generated world. Other activities in the game include exploration, gathering resources, crafting, and combat. Gameplay in its commercial release has two principal modes: survival, which requires players to acquire resources and maintain their health and hunger; and creative, where players have an unlimited supply of resources, the ability to fly, and no health or hunger. A third gameplay mode named hardcore is the same as survival, differing only in difficulty; it is set to hardest setting and respawning is disabled, forcing players to delete their worlds upon death.\nMinecraft received five awards from the 2011 Game Developers Conference: it was awarded the Innovation Award, Best Downloadable Game Award, and the Best Debut Game Award from the Game Developers Choice Awards; and the Audience Award, as well as the Seumas McNally Grand Prize, from the Independent Games Festival in 2011. In 2012, Minecraft was awarded a Golden Joystick Award in the category Best Downloadable Game. As of April 8, 2013, the game has sold over 10 million copies on PC[10] and as of January 22, 2013, over 20 million copies across all platforms.\n\nInstallation instructions:\n1. Execute the Minecraft 1.6.1 (TeamExtreme)(1-click run)(registred).exe file.\n2. Click next.\n3. Enjoy the program.","torrent":{"xt":"urn:btih:22bc123ea5ddaf3fefd0a99dad2e05da297e3ace","amp;dn":"Minecraft+1.6.1+%28TeamExtreme%29%281-click+run%29%28registred%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22bc123ea5ddaf3fefd0a99dad2e05da297e3ace","infoHashBuffer":{"type":"Buffer","data":[34,188,18,62,165,221,175,63,239,208,169,157,173,46,5,218,41,126,58,206]},"announce":[],"urlList":[]}}