{
  "title": "Pyrrhus of Epirus",
  "uid": 15891832,
  "size": 5240994,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:23cca18605ee6e514f2a3e6f4faf7a5f6cad795f&amp;dn=Pyrrhus+of+Epirus&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 39,
  "leechers": 2,
  "uploader": "marty14",
  "files": 1,
  "time": 1474762335,
  "description": "Pyrrhus of Epirus - Jeff Champion [epub]\r\n\r\nPyrrhus of Epirus was rated by Hannibal as the second greatest general yet seen (placing himself third). Indeed, Hannibal referred to Pyrrhus as his teacher, although the two never met, since he learnt so much of the art of war from his writings.\r\n\r\nPyrrhus was born into the royal house of Epirus, northwest Greece, and was a second-cousin of Alexander the Great. His mother was forced to flee into exile to protect his life when he was a mere infant, yet he prospered in troubled times and went from a refugee to become king. Always an adventurer with an eye for the main chance, he was deeply involved in the cut-and-thrust campaigning, coups and subterfuges of the Successor kingdoms.\r\n\r\nAt various times he was king of Epirus (twice), Macedon (twice) and Sicily, as well as overlord of much of southern Italy. In 281 BC he was invited by the southern Italian states to defend them against the aggressive expansion of the burgeoning Roman republic. His early victories over the Roman armies at Heraclea and Asculum (assisted by his use of elephants) were won at such a high price in casualties that they gave us the expression 'Pyrrhic victory'. These battles were the first clashes between the hitherto-dominant Hellenistic way of warfare (as developed by Alexander) and the Roman legions, and so full of tactical interest. He failed in Italy and Sicily but when on to further military adventures in Greece, eventually being killed in action while storming the city of Argos",
  "parsed": {
    "xt": "urn:btih:23cca18605ee6e514f2a3e6f4faf7a5f6cad795f",
    "dn": "Pyrrhus of Epirus",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "23cca18605ee6e514f2a3e6f4faf7a5f6cad795f",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        35,
        204,
        161,
        134,
        5,
        238,
        110,
        81,
        79,
        42,
        62,
        111,
        79,
        175,
        122,
        95,
        108,
        173,
        121,
        95
      ]
    },
    "name": "Pyrrhus of Epirus",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 18,
  "peers": 15,
  "last_updated": "2016-12-26T18:59:13.953Z"
}