{
  "title": "Body Language: 101 by Hanif Raah (epub)",
  "uid": 12212803,
  "size": 875477,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:23e39d5def769531b1036536a2afa0b5753672c1&amp;dn=Body+Language%3A+101+by+Hanif+Raah+%28epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 45,
  "leechers": 4,
  "uploader": "ebookism",
  "files": 3,
  "time": 1439155669,
  "description": "When we talk we say very little because it's our body that does the real talking! We express so much more subconsciously through our physical behavior, body posture, gestures, eye movement, facial expressions, touch and the use of space. So why not learn how to use this to YOUR advantage?\nBody Language 101 is a powerful tool that you can use in every aspect of your life. This book will give you an in depth insight into how to read body language to decipher the hidden agenda of any dialogue or interaction. Mastering the skills in this book will enhance your relationships with your spouse, partner or family members, it could even further your career by helping you to ace that interview or even help you to build a great rapport with your work colleagues or boss.\nContrary to common belief learning how to read body language is not difficult. Body Language 101 takes you by the hand and shows you how anyone can read the tell-tale signs of body language and with it know what the other person is REALLY thinking contrary to what they might be actually saying. The skills you will learn in this book will vastly improve your social interactions and relationships whether they be business or pleasure.\n\nBody Language: 101: Discover the Psychology Secrets of How to Read and Understand Non Verbal Communication and Always Be One Move Ahead (Body Language, ... Attraction, Rapport, Mind Hacks Book 5) by Hanif Raah\nEnglish | 2015 | ISBN: n/a | ASIN: B00WYFL418 | 69 pages | EPUB | 0,8 MB\n\nThis book has the ability to totally change your life. You will learn what body language signs you should look for when you want to know whether the person who is talking to you is telling the truth or is trying to con you. It will always give you that edge so you can adjust your game plan to steer things in the direction YOU want!\n\nHere's a Sneak Peak of What You Will Learn....\nWhat signs send the wrong message to the onlooker/ interviewer/ boss/ spouse and how to avoid them\nHow to use this knowledge to project the image you want wherever you want\nHow to promote your career using this powerful tool\nHow to become more confident, assertive and outgoing\nHow to improve your relationships with friends and family\nHow to give off the right signals to a someone you admire by highlighting your true intentions\nand much, much more!\n\nYou will be able to not only understand everyone around you better, but also you will be able to build rapport quickly, defuse disagreements more effectively, build your self-confidence and persuade people to do what you want.\n &lt;a href=&quot;\nhttp://extraimago.com/images/2015/08/09/003714eb375x600.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://extraimago.com/images/2015/08/09/003714eb375x600.jpg&lt;/a&gt;",
  "parsed": {
    "xt": "urn:btih:23e39d5def769531b1036536a2afa0b5753672c1",
    "dn": "Body Language: 101 by Hanif Raah (epub)",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "23e39d5def769531b1036536a2afa0b5753672c1",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        35,
        227,
        157,
        93,
        239,
        118,
        149,
        49,
        177,
        3,
        101,
        54,
        162,
        175,
        160,
        181,
        117,
        54,
        114,
        193
      ]
    },
    "name": "Body Language: 101 by Hanif Raah (epub)",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 49,
  "peers": 21,
  "last_updated": "2016-12-24T19:49:59.012Z"
}