{
  "title": "IObit Uninstaller Pro v6.0.2.143 Multilingual + Crack [SadeemPC]",
  "uid": 15582981,
  "size": 12163685,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:23e89c694bd403acca0bfee1009af981875542f6&amp;dn=IObit+Uninstaller+Pro+v6.0.2.143+Multilingual+%2B+Crack+%5BSadeemPC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 65,
  "leechers": 2,
  "uploader": "SadeemPC",
  "files": 1,
  "time": 1471433043,
  "description": "IObit Uninstaller Pro v6.0.2.143 Multilingual\r\n\r\nIObit Uninstaller helps you uninstall and remove unwanted programs and folders from your computer fast and easily. Where the built-in and sluggish Windows Add or Remove Programs option fails, IObit Uninstaller works as always and picks up the slack. What's better, it is a free Uninstaller without installation. \r\n\r\nIntegrated with up to date uninstall technology, IObit Uninstaller helps you remove unneeded programs easily even when Windows &quot;Add or Remove Programs&quot; fails. Besides removing unwanted applications, it also scans and removes leftovers easily. The most attractive part is that it makes a restore image before every uninstallation. With the new added Toolbars Uninstallation Module, IObit Uninstaller helps you remove unwanted toolbars thoroughly.\r\n\r\nCleaner &amp; More Stable PC\r\nAs time going on, your PC will easily become slow after piling up too many leftovers in registry after general uninstallation. But now users can remove the programs and all leftovers quickly by just 1 click in IObit Uninstaller 5; and get a cleaner, faster and more stable PC. Additionally, IObit Uninstaller 5 can also remove programs and pre-installed apps in Windows 10.\r\n\r\nFaster &amp; Safer Browsing\r\nSome malicious plug-ins, toolbar and unwanted injected programs will be installed into browsers without any notice, which will frustrate you by slowing down your surfing speed and annoying ads pop-ups. The improved Toolbar &amp; Plug-in removal will monitor and remove all these useless programs and give you fast and clean online surfing experience. And the newly enhanced Chrome plug-ins removal can remove the plug-ins not installed via Chrome store.\r\n\r\nPowerful &amp; Safe Uninstallation\r\nMany stubborn programs cannot be uninstalled or uninstalled completely in an easy way. IObit Uninstaller 5 can powerfully remove them and delete all the leftovers, including the registry and file directory of some stubborn antivirus programs. IObit Uninstaller 5 will continue the unfinished uninstall process caused by system reboot; and it also can create a system restore point before every uninstallation in case of unexpected happens.\r\n\r\nMore Powerful Tools\r\nSometimes users will forget to remove the leftovers after uninstallation, and the new tools in IObit Uninstaller 5 can help them continuing powerful scan for the programs in the uninstall history, as well as cleaning other useless update/install package and invalid shortcuts etc. Download IObit Uninstaller 5, and you can even easily find the basic Windows Tools in it.\r\n\r\nWhats New:\r\nAdded removing Microsoft Edge plug-ins and extensions.\r\nLarger database to remove more malicious &amp; ad-based plug-ins for safer and faster browser.\r\nSupported uninstalling more than 4,000 stubborn programs &amp; browser plug-ins with helpful hint.\r\nMore thorough and faster Powerful Scan.\r\nBetter supported uninstallation of Windows Apps.\r\nOptimized real-time monitoring of leftovers missed by other uninstall programs.\r\nSupported two skins and large font size for better user experience.\r\nSupported 38 languages",
  "parsed": {
    "xt": "urn:btih:23e89c694bd403acca0bfee1009af981875542f6",
    "dn": "IObit Uninstaller Pro v6.0.2.143 Multilingual   Crack [SadeemPC]",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "23e89c694bd403acca0bfee1009af981875542f6",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        35,
        232,
        156,
        105,
        75,
        212,
        3,
        172,
        202,
        11,
        254,
        225,
        0,
        154,
        249,
        129,
        135,
        85,
        66,
        246
      ]
    },
    "name": "IObit Uninstaller Pro v6.0.2.143 Multilingual   Crack [SadeemPC]",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 67,
  "peers": 76,
  "last_updated": "2016-12-24T19:50:07.040Z"
}