{
  "title": "Europa_Universalis_IV-FLT",
  "uid": 8808958,
  "size": 665837452,
  "categoryP": "games",
  "categoryS": "pc",
  "magnet": "?xt=urn:btih:24c59bd7d675cc631cf43d7c0e5904fdd592bb2c&amp;dn=Europa_Universalis_IV-FLT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 41,
  "leechers": 2,
  "uploader": "Mr.Stifmeister",
  "files": 47,
  "time": 1376411557,
  "description": "\nANSiJEDACiD\n\nIn Their 26th Year Of Glory, FairLight Released #1110\n\nEuropa Universalis IV (c) Paradox Interactive\n\n:   Supplied by: FAIRLIGHT            : : Release Date: 13/08/2013\nCracked by:  FAIRLIGHT              Game Type:    Strategy\nPackaged by: FAIRLIGHT              Image Format: ISO\n-----\nDISCS: 1 CD                         Protection: Steam\n\nSystem Requirements : (S)-1-phenylpropan-2-amine\n\nGame information\n=================\n\nParadox Development Studio and Paradox Interactive is back  with  the  4th\ninstallment of the game that defined the Grand Strategy Genre. The  empire\nbuilding game Europa Universalis IV gives you control of a nation to guide\nit through the years and create a dominant global empire and will  provide\nyou unprecedented freedom in how you want  to  rule  your  nation  and  is\nunparalleled in its depth and historical accuracy\n\nEuropa Universalis IV explores the world history in an experience  crafted\nby  Paradox  Development  Studio,  the  masters  of  Grand  Strategy.  The\nexperiences of true exploration, trade,  warfare  and  diplomacy  will  be\nbrought to life in this epic title rife with rich strategic  and  tactical\ndepth\n\nFeatures\n=========\n\nTake your own decisions: Nation building is flexible: decide\nyour own form of government, the structure of your society,\ntrade politics and more. The possibilities are endless\nUse your Monarch Power: Experience the new system of monarch\npower where your spread of choices is influence by the\ncaliber of the man you have at the top. Do you have a\nwarrior King? Then it is time to make war\nExperience history coming to life: The great people and\npersonalities of the past are on hand to support you.\nThousands of historical events guide you, with unique\ndifferent flavor depending on the country you play.\nHave more than a thousand historical leaders and\nover 4000 historical Monarchs at your disposal\nThe world is now your playground: Players can enjoy over 300\nyears of gameplay in a lush topographic map in full 3D. Lead\nany one of more than 250 countries that originally existed\nduring the game's extensive time span\nExperience the all new trade system: The trade system adds\na new dimension to the great trade empires of the period.\nSeize control of key ports to expand your trade, support\nit with your powerful fleet and the wealth of the world\nwill flow to you\nBring out your diplomatic skills: Deeper diplomatic gameplay,\nwith coalitions, threats, fleet basing rights and detailed\nsupport for rebels. Introducing unilateral opinions,\na country may dislike you, butyou can be neutral\ntowards them\nEngage in Multiplayer: Battle against your friends or\ntry co-operative multiplayer mode that allows several\nplayers to work together to control a single nation\nfor up to 32 players. Featuring hotjoin, improved\nchat, new matchmaking server andsupport for a\nchat, new matchmaking\nCreate your own history &amp; customize your game:\nEuropa Universalis IV gives you the chance to\ncustomize and mod practically anything your\nheart may desire\n\nInstallation Information\n=========================\n\nBurn or mount\nInstall\nPlay the game\n\nNOTE: As usual, block the game exe in your firewall\n\n/TEAM FAiRLIGHT\n\n-  QUALITY, TRADITION  AND PRIDE -\n\n",
  "parsed": {
    "xt": "urn:btih:24c59bd7d675cc631cf43d7c0e5904fdd592bb2c",
    "dn": "Europa_Universalis_IV-FLT",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "24c59bd7d675cc631cf43d7c0e5904fdd592bb2c",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        36,
        197,
        155,
        215,
        214,
        117,
        204,
        99,
        28,
        244,
        61,
        124,
        14,
        89,
        4,
        253,
        213,
        146,
        187,
        44
      ]
    },
    "name": "Europa_Universalis_IV-FLT",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 43,
  "peers": 9,
  "last_updated": "2016-12-24T19:56:48.434Z"
}