{
  "title": "The Americans - Season 1",
  "uid": 13698962,
  "size": 6117635796,
  "categoryP": "video",
  "categoryS": "movies",
  "magnet": "?xt=urn:btih:255c634b5f69f9bb733d8c6856b6d3cb5cf77110&amp;dn=The+Americans+-+Season+1&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 152,
  "leechers": 60,
  "uploader": "POtHS11",
  "files": 21,
  "time": 1456746470,
  "description": "The first season of the American television drama series The Americans premiered on January 30, 2013, and concluded on May 1, 2013. It consisted of 13 episodes, each running approximately 45 minutes in length. FX broadcast the first season on Wednesdays at 10:00 pm in the United States. The series is produced by DreamWorks Television. The Americans was created by Joe Weisberg.\r\n\r\nSet during the Cold War period in the 1980s, The Americans is the story of Elizabeth (Keri Russell) and Philip Jennings (Matthew Rhys), two Soviet KGB officers posing as an American married couple in the suburbs of Washington, D.C., and their neighbor, Stan Beeman (Noah Emmerich), an FBI agent.[1]\r\n\r\nSeason 1\r\nPilot\r\nS1, Ep1\r\n30 Jan. 2013\r\nPilot\r\nPhillip and Elizabeth Jennings are two seemingly normal Americans who are really undercover KGB agents. After kidnapping a Soviet defector they discover their new neighbor is an FBI agent assigned to their case.\r\n \r\nThe Clock\r\nS1, Ep2\r\n6 Feb. 2013\r\nThe Clock\r\nWhen Philip and Elizabeth are given an urgent task to plant a bug in Defense Secretary Caspar Weinberger's office, they risk exposure when an unwilling maid of the Weinberger home refuses to cooperate.\r\n \r\nGregory\r\nS1, Ep3\r\n13 Feb. 2013\r\nGregory\r\nGregory, Elizabeth's lover, helps them make contact with Robert's widow despite an FBI team. Gabriel's replacement shows up. Phillip then makes a dangerous buy of information.\r\n \r\nIn Control\r\nS1, Ep4\r\n20 Feb. 2013\r\nIn Control\r\nAfter President Reagan is nearly assassinated events quickly start to spin out of control. The FBI wonders if the KGB is somehow behind it; the KGB worry that they will be blamed for it and possibly result in war.\r\n \r\nComint\r\nS1, Ep5\r\n27 Feb. 2013\r\nComint\r\nA crucial agent crumbles under emotional distress and threatens to topple a valuable network of KGB informants.\r\n \r\nTrust Me\r\nS1, Ep6\r\n6 Mar. 2013\r\nTrust Me\r\nA mole hunt within the KGB causes suspicion amongst allies and shatters trust within the Jennings' marriage. Meanwhile, Stan's plan to keep his mole safe puts her at even greater risk of discovery.\r\n \r\nDuty and Honor\r\nS1, Ep7\r\n13 Mar. 2013\r\nDuty and Honor\r\nPhilip and Elizabeth's troubled marriage is further tested when a mission to discredit a Polish pro-democracy leader reunites Philip with his old flame.\r\n \r\nMutually Assured Destruction\r\nS1, Ep8\r\n20 Mar. 2013\r\nMutually Assured Destruction\r\nA German assassin has been ordered to kill American scientists involved in the ABM program. After the mission is aborted, Phillip and Elizabeth must stop him and prevent a possible war, without having any idea of his identity.\r\n \r\nSafe House\r\nS1, Ep9\r\n3 Apr. 2013\r\nSafe House\r\nPhillip and Elizabeth shock their children when they announce they are separating. After Amador goes missing, Gaad orders an unauthorized mission to grab a KGB agent in retaliation. Events soon spin out of control and come to a grisly end.\r\n \r\nOnly You\r\nS1, Ep10\r\n10 Apr. 2013\r\nOnly You\r\nAfter Amador's murder the FBI begins a massive manhunt for the killer. When they start closing in on Gregory, the KGB decides to send him to Moscow. Despite Elizabeth's best efforts he refuses to go, even if it means his life.\r\n \r\nCovert War\r\nS1, Ep11\r\n17 Apr. 2013\r\nCovert War\r\nIn Moscow, Viktor Zhukov is assassinated in the escalating tensions between the two countries. When Elizabeth learns that her personal mentor has been murdered she risks everything to avenge his death.\r\n \r\nThe Oath\r\nS1, Ep12\r\n24 Apr. 2013\r\nThe Oath\r\nAn Air Force colonel offers to sell SDI secrets to the KGB. Viola reports the bug in the Weinberger home. Phillip agrees to marry Martha hoping she'll continue spying while Nina confesses to spying for the Americans.\r\n \r\nThe Colonel\r\nS1, Ep13\r\n1 May 2013\r\nThe Colonel\r\nElizabeth and Phillip are at risk of getting caught when they fear their assignments may be a set-up. Stan is convinced he'll find Nina a way out",
  "parsed": {
    "xt": "urn:btih:255c634b5f69f9bb733d8c6856b6d3cb5cf77110",
    "dn": "The Americans - Season 1",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "255c634b5f69f9bb733d8c6856b6d3cb5cf77110",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        37,
        92,
        99,
        75,
        95,
        105,
        249,
        187,
        115,
        61,
        140,
        104,
        86,
        182,
        211,
        203,
        92,
        247,
        113,
        16
      ]
    },
    "name": "The Americans - Season 1",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 100,
  "peers": 128,
  "last_updated": "2016-12-26T19:11:48.358Z"
}