{
  "title": "Code Warriors: NSA Codebreakers and the Secret Intelligence War",
  "uid": 15789318,
  "size": 2293320,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:266bb3f4180fc06cd7345ca42623f9d734bf5e77&amp;dn=Code+Warriors%3A+NSA+Codebreakers+and+the+Secret+Intelligence+War&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 41,
  "leechers": 0,
  "uploader": "marty14",
  "files": 1,
  "time": 1473370702,
  "description": "Code Warriors: NSA's Codebreakers and the Secret Intelligence War - Stephen Budiansky [epub]\r\n\r\nThe National Security Agency was born out of the legendary codebreaking programs of World War II that cracked the famed Enigma machine and other German and Japanese codes, thereby turning the tide of Allied victory. In the postwar years, as the United States developed a new enemy in the Soviet Union, our intelligence community found itself targeting not soldiers on the battlefield, but suspected spies, foreign leaders, and even American citizens. Throughout the second half of the twentieth century, NSA played a vital, often fraught and controversial role in the major events of the Cold War, from the Korean War to the Cuban Missile Crisis to Vietnam and beyond. \r\n\r\nIn Code Warriors, Stephen Budiansky—a longtime expert in cryptology—tells the fascinating story of how NSA came to be, from its roots in World War II through the fall of the Berlin Wall. Along the way, he guides us through the fascinating challenges faced by cryptanalysts, and how they broke some of the most complicated codes of the twentieth century. With access to new documents, Budiansky shows where the agency succeeded and failed during the Cold War, but his account also offers crucial perspective for assessing NSA today in the wake of the Edward Snowden revelations. Budiansky shows how NSA’s obsession with recording every bit of data and decoding every signal is far from a new development; throughout its history the depth and breadth of the agency’s reach has resulted in both remarkable successes and destructive failures. \r\n\r\nFeaturing a series of appendixes that explain the technical details of Soviet codes and how they were broken, this is a rich and riveting history of the underbelly of the Cold War, and an essential and timely read for all who seek to understand the origins of the modern NSA",
  "parsed": {
    "xt": "urn:btih:266bb3f4180fc06cd7345ca42623f9d734bf5e77",
    "dn": "Code Warriors: NSA Codebreakers and the Secret Intelligence War",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "266bb3f4180fc06cd7345ca42623f9d734bf5e77",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        38,
        107,
        179,
        244,
        24,
        15,
        192,
        108,
        215,
        52,
        92,
        164,
        38,
        35,
        249,
        215,
        52,
        191,
        94,
        119
      ]
    },
    "name": "Code Warriors: NSA Codebreakers and the Secret Intelligence War",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 41,
  "peers": 50,
  "last_updated": "2016-12-24T20:10:05.542Z"
}