{"title":"India: The Ancient Past, 7000 BCE to 1200 CE (2nd edition)","uid":15896895,"size":10464166,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:27031abf0f5664e55d4e2215d174a6a1ecca40a1&amp;dn=India%3A+The+Ancient+Past%2C+7000+BCE+to+1200+CE+%282nd+edition%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":47,"leechers":2,"uploader":"marty14","files":1,"time":1474818741,"description":"India: The Ancient Past, A History of the Indian Subcontinent from c. 7000 BCE to CE 1200 (2nd edition) - Burjor Avari [epub]\r\n\r\nIndia: The Ancient Past provides a clear and systematic introduction to the cultural, political, economic, social and geographical history of ancient India from the time of the pre-Harappan culture nine thousand years ago up until the beginning of the second millennium of the Common Era. The book engages with methodological and controversial issues by examining key themes such as the Indus-Sarasvati civilization, the Aryan controversy, the development of Vedic and heterodox religions, and the political economy and social life of ancient Indian kingdoms.\r\n\r\nThis fully revised and updated second edition includes:\r\n\r\n* Three new chapters examining the differences and commonalities between the north and south of India;\r\n* Extended discussion on contested issues, such as the origins of the Aryans and the role of feudalism in ancient India;\r\n* New source excerpts to introduce students to the most significant works in the historiography of India, and questions for discussion;\r\n* Study guides, including a list of key issues, suggested readings and a selection of internet sources for each chapter;\r\n* Specially designed maps to illustrate different time periods and geographical regions\r\n\r\nThis richly illustrated guide provides a fascinating account of the early development of Indian culture and civilization that will appeal to all students of Indian history","torrent":{"xt":"urn:btih:27031abf0f5664e55d4e2215d174a6a1ecca40a1","amp;dn":"India%3A+The+Ancient+Past%2C+7000+BCE+to+1200+CE+%282nd+edition%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27031abf0f5664e55d4e2215d174a6a1ecca40a1","infoHashBuffer":{"type":"Buffer","data":[39,3,26,191,15,86,100,229,93,78,34,21,209,116,166,161,236,202,64,161]},"announce":[],"urlList":[]}}