{"title":"Curb Your Enthusiasm Season 1 - 8 + Extras DVDRip TSV","uid":9333128,"size":22659383147,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2758504b08151057c7ef1ce360dbb522cd358ce9&amp;dn=Curb+Your+Enthusiasm+Season+1+-+8+%2B+Extras+DVDRip+TSV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":95,"leechers":105,"uploader":"TSV","files":-1,"time":1386803365,"description":"All episodes from all 8 seasons DVDRip + extras.\n\n\n\nCurb Your Enthusiasm is an American improvised comedy television series produced and broadcast by HBO, which premiered on October 15, 2000. It has aired 80 episodes over 8 seasons, the last of which aired in 2011. The series was created by Seinfeld co-creator Larry David, who stars as a fictionalized version of himself. The series follows Larry in his life as a semiretired television writer and producer in Los Angeles and later New York City. Also starring are Cheryl Hines as his wife Cheryl, Jeff Garlin as his manager Jeff, and Susie Essman as Jeff's wife Susie. Curb Your Enthusiasm often features guest stars, and many of these appearances are by celebrities playing versions of themselves fictionalized to varying degrees.\n\nThe plots and subplots of the episodes are established in an outline written by David and the dialogue is largely improvised by the actors (a technique known as retroscripting). As with Seinfeld, the subject matter in Curb Your Enthusiasm often involves the minutiae of daily life, and plots often revolve around Larry David's many faux pas and his problems with certain social conventions and expectations, as well as his annoyance with other people's behavior. The character has a hard time letting such annoyances go unexpressed, which often leads him into awkward situations.\n\nThe series was developed from a 1999 one-hour special, Larry David: Curb Your Enthusiasm, which David and HBO originally envisioned as a one-time project. The special was shot as a mockumentary, where the characters were aware of the presence of cameras and a crew. The series itself is not a mock documentary but is shot in a somewhat similar cin?ma v?rit?-like style. Curb Your Enthusiasm has received high critical acclaim, and has grown in popularity since its debut. It has been nominated for 38 Primetime Emmy Awards, and Robert B. Weide received an Emmy for Outstanding Directing for a Comedy Series for the episode &quot;Krazee Eyez Killa&quot;. The show won the 2002 Golden Globe Award for Best Television Series ? Musical or Comedy.\n\n\nPlease seed at a decent speed.\n\nEnjoy,\n\n\nTSV.","torrent":{"xt":"urn:btih:2758504b08151057c7ef1ce360dbb522cd358ce9","amp;dn":"Curb+Your+Enthusiasm+Season+1+-+8+%2B+Extras+DVDRip+TSV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2758504b08151057c7ef1ce360dbb522cd358ce9","infoHashBuffer":{"type":"Buffer","data":[39,88,80,75,8,21,16,87,199,239,28,227,96,219,181,34,205,53,140,233]},"announce":[],"urlList":[]}}