{"title":"Building Machine Learning Systems with Python [Epub &amp; PDF]","uid":9204850,"size":17858411,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:282f2dba6e453d63741a5a0a690c026516abbce5&amp;dn=Building+Machine+Learning+Systems+with+Python+%5BEpub+%26amp%3B+PDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":73,"leechers":4,"uploader":"F1restorm","files":-1,"time":1384672083,"description":"Building Machine Learning Systems with Python\nAuthors: Willi Richert and Luis Pedro Coelho\nPublished: July 26, 2013\nPublisher: Packt Publishing\nISBN: 9781782161400\nFormat: Retail Epub and Retail PDF\nReader Required: \nPDF- Adobe Reader, Adobe Digital Editions\nEpub- Adobe Digital Editions, Calibre, MoonReader for Android\nFormat conversion: convert epub to mobi (Kindle) with Calibre\nYou can download the source code and support files by registering on the \npublisher's website (link in book), there is also an errata list (mistakes in the code) published there (no registration required).\nTested on the above readers with no problems.  Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nEnjoy! :D\n_______________________________________________________________________________\n\nApproach:\nA practical, scenario-based tutorial, this book will help you get to grips with machine learning with Python and start building your own machine learning projects. By the end of the book you will have learnt critical aspects of machine learning Python projects and experienced the power of ML-based systems by actually working on them.\n\nWho this book is for:\nThis book is for Python programmers who are beginners in machine learning, but want to learn Machine learning. Readers are expected to know Python and be able to install and use open-source libraries. They are not expected to know machine learning, although the book can also serve as an introduction to some Python libraries for readers who know machine learning. This book does not go into the detail of the mathematics behind the algorithms.\n\nThis book primarily targets Python developers who want to learn and build machine learning in their projects, or who want to provide machine learning support to their existing projects, and see them getting implemented effectively.\n\n","torrent":{"xt":"urn:btih:282f2dba6e453d63741a5a0a690c026516abbce5","amp;dn":"Building+Machine+Learning+Systems+with+Python+%5BEpub+%26amp%3B+PDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"282f2dba6e453d63741a5a0a690c026516abbce5","infoHashBuffer":{"type":"Buffer","data":[40,47,45,186,110,69,61,99,116,26,90,10,105,12,2,101,22,171,188,229]},"announce":[],"urlList":[]}}