{
  "title": "Adobe pagemaker 7.0 with serial + updates",
  "uid": 5155846,
  "size": 135197707,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:28e8803c3691f17523dc5a726ab0e795ebc2898d&amp;dn=Adobe+pagemaker+7.0+with+serial+%2B+updates&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 42,
  "leechers": 1,
  "uploader": "gerti_id",
  "files": -1,
  "time": 1257845529,
  "description": "\nAdobeÃ‚Â® PageMakerÃ‚Â® 7.0 software is the ideal page layout program for\nbusiness, education, and small- and home-office professionals who\nwant to create high-quality publications such as brochures and\nnewsletters. Get started quickly with templates, graphics, and\nintuitive design tools; work productively across Adobe applications;\nand easily leverage existing content to create customized\ncommunication.\n\n\n\nProduct overview:-\n\nAdobeÃ‚Â® PageMakerÃ‚Â® 7.0 software enables business, education, and\nsmall- and home-office professionals to create high-quality\npublications such as brochures and newsletters.\n\nCreate professional-quality publications.\n\nCreate a wide variety of publications in AdobeÃ‚Â® PageMakerÃ‚Â® 7.0,\nfrom simple one-page flyers to complex reports. Build your own\npublications from scratch, or take advantage of hundreds of\npredesigned templates that you can modify to suit your needs.\n\nQuickly lay out publications by creating frames to hold text and\ngraphics, applying master pages to apply different page designs\nwithin a single publication, and using layers to set up a single\nfile for multiple versions of a publication.\n\nType and format text directly in layout view, or edit using the\nbuilt-in story editor.\n\nTypeset your text professionally by using kerning and tracking.\n\nEnsure tight integration with other products.\n\nTired of learning new applications only to find they don't work\nwell with your existing software? With AdobeÃ‚Â® PageMakerÃ‚Â® 7.0, you'll\nenjoy a familiar working environment and smooth, easy file import\nfrom some of your favorite Adobe applications.\n\nGet up to speed quickly with familiar Adobe menus, palettes, and\nkeyboard shortcuts.Place Adobe IllustratorÃ‚Â® and Adobe PhotoshopÃ‚Â®\ngraphics directly into PageMaker.\n\nUsing the new Data Merge feature, merge text and graphics originally\nstored in spreadsheets or databases to create custom publications,\nincluding form letters, mailing labels, envelopes, and catalogs.\n\nProduce reliable output. AdobeÃ‚Â® PageMakerÃ‚Â® 7.0 provides support for\nthe leading print standards. Output files to any printing device,\nincluding digital quick printers and high-end commercial printers.\n\nEnsure professional-quality color with integrated trapping and built-in\nprinting of color separations.\nUse color management to ensure the quality and consistency of colour\noutput.\nTake advantage of advanced printing options, including duplex printing\nand the Save for Service Provider and Build Booklet plug-ins.When\nexporting to Adobe Portable Document Format (PDF), add document\ninformation, change security options, and modify advanced AcrobatÃ‚Â®\nDistillerÃ‚Â® settings from within PageMaker.\n\nExplore your creativity: templates and clip art\n\nTime is precious. Adobe knows that your page layout software should\nhelp you save time rather than spend it. That's why AdobeÃ‚Â®\nPageMakerÃ‚Â® 7.0 provides templates and clip art to help you add a\nprofessional touch to your publications.\n\nUse hundreds of professionally designed templates to lay out your\nnewsletters, brochures, reports, business stationery, and other\npublication.Customize the templates to suit your needs. Choose from\namong thousands of professionally designed clip-art illustrations and\nphotographs.\n\nFirst install the software. After installing first run 7.0.1 update\nand run 7.0.1a update.\n\nFull Version software with serial key.\n\n\nENJOY!\n",
  "parsed": {
    "xt": "urn:btih:28e8803c3691f17523dc5a726ab0e795ebc2898d",
    "dn": "Adobe pagemaker 7.0 with serial   updates",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "28e8803c3691f17523dc5a726ab0e795ebc2898d",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        40,
        232,
        128,
        60,
        54,
        145,
        241,
        117,
        35,
        220,
        90,
        114,
        106,
        176,
        231,
        149,
        235,
        194,
        137,
        141
      ]
    },
    "name": "Adobe pagemaker 7.0 with serial   updates",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 4,
  "peers": 12,
  "last_updated": "2016-12-26T19:39:09.419Z"
}