{
  "title": "PS2 - Mortal Kombat - Armageddon (NTSC)",
  "uid": 4731922,
  "size": 4366796124,
  "categoryP": "games",
  "categoryS": "psx",
  "magnet": "?xt=urn:btih:29abb93ed7be5935fcf0400aecc0c9d7258edd88&amp;dn=PS2+-+Mortal+Kombat+-+Armageddon+%28NTSC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 45,
  "leechers": 12,
  "uploader": "macf81",
  "files": 3,
  "time": 1235074980,
  "description": "Since it's debut in the early 1990's Mortal Kombat has indirectly led to the creation of the ESRB, spawned three films, a cartoon series, a television series, and numerous sequels and spin-offs. The quality of the offerings of the MK franchise have been iffy at best, but the quantity has always been voluminous, as has the violence. It's this trend that, for better or worse, Mortal Kombat: Armageddon continues.\n\nMaybe Mortal Kombat: Armageddon isn't the best title for this 3D fighter. Perhaps Mortal Kombat: Cornucopia or Mortal Kombat: A Gazillion Unlockables, or even Mortal Kombat: All You Can Play would be better-suited. There are more unlockable items and goodies in this game than there are in a warehouse full of crackerjack boxes. Extra costumes, pieces of art, animation tests, levels, music, videos, the list goes on and on.\nMK:A. The first and most direct way is to earn Koins. Koins can be earned by playing the single-player arcade mode, the Konquest mode, and the Motor Kombat racing mode (yes, I said racing, more on that later). These Koins can then be used in the Krypt, which is basically a vault containing just about every single unlockable in the game. The second way you can unlock items is by finding them in the Konquest mode.\n\n\nThe Konquest mode, a returning feature from Mortal Kombat: Deception, is a bit more robust this time around. In this single-player mode you play as Taven, a warrior sent on a mysterious, yet important, quest by his father. As you journey through the Mortal Kombat universe you'll meet other Mortal Kombat characters, most of which will be hostile and will need a very thorough beat-down. Most of the game is played like a standard 3D beat-'em-up. You'll be able to move anywhere you want and fight off multiple opponents at a time, all while advancing through levels and figuring out more of the story. Your moves are simplified in this mode, as are your fatalities, which can be done to stunned opponents at the touch of a button.\n\nYou'll also run into tougher mini-boss type enemies and navigate dangerous obstacles which are mainly composed of fast-moving sharp or pointy objects which kill you in one hit. Death isn't really a big deal in the Konquest mode as you'll just be sent back to your most recent checkpoint. Sometimes checkpoints are a bit too far apart, which means you can expect some frustrating moments in some of the tougher levels. When you meet up with other MK combatants, you'll switch to the traditional arcade mode for a one-on-one fight.\n\nBetween the puzzles, hidden objects, Koins to collect and MK character battles, the Konquest mode feels like a complete game all by itself. There are about 10 hours of playtime here and I found myself playing this mode more than any of the others when alone. Taking on mobs of generic bad guys is satisfying, special moves let you throw fireballs and scatter enemies when you're surrounded, and the one-button fatalities make you feel like the badass you wish you really were. Sadly, the puzzles only slow down the action, but while they are frustrating they're not unbeatable.\n\n\n\nMortal Kombat: Armageddon ÃƒÂ© o tÃƒÂ­tulo mais recente de uma das sÃƒÂ©rie mais famosas de todos os tempos no mundo dos games, precursora de inovaÃƒÂ§ÃƒÂµes como o fatality e o uso de sangue. Como nÃƒÂ£o poderia deixar de inovar, o novÃƒÂ­ssimo MK traz recursos inÃƒÂ©ditos como a criaÃƒÂ§ÃƒÂ£o de personagens e fatalities, alÃƒÂ©m de um minigame satÃƒÂ­rico (e controverso!) que lembra Mario Kart.\n\nNo desenrolar de todo a trama da sÃƒÂ©rie, os guerreiros ficaram mais fortes e numerosos demais para serem contabilizados, o que poderia levar a destruiÃƒÂ§ÃƒÂ£o total do universo. Conta a histÃƒÂ³ria que neste MK, sem aviso, uma pirÃƒÂ¢mide ascendeu, levando a um combate entre os melhores para ver quem chegava ao cume primeiro. Isso ocorreu atÃƒÂ© Blaze, um elemental de OutWorld se revelar. Para quem nÃƒÂ£o se lembra, sua primeira apariÃƒÂ§ÃƒÂ£o foi em Mortal Kombat: Deadly Alliance.\n\nOs deuses anciÃƒÂµes criaram um grande fogarÃƒÂ©u para evitar o Armagedon. Esta ÃƒÂ© a derradeira chance de sobrevivÃƒÂªncia para os combatentes, a determinante do destino... O clima apocalÃƒÂ­ptico ÃƒÂ© uma mÃƒÂ¡xima em Armageddon, marcando o enredo do comeÃƒÂ§o ao fim.\n\nMK: Armageddon possui variedade para todos os gostos: sÃƒÂ£o no total 62 personagens (nas versÃƒÂµes do Xbox e PS2) com todas as estrelas da sÃƒÂ©rie e dois lutadores inÃƒÂ©ditos. Agora sÃƒÂ³ cabe a vocÃƒÂª: Finish him!\n\n",
  "parsed": {
    "xt": "urn:btih:29abb93ed7be5935fcf0400aecc0c9d7258edd88",
    "dn": "PS2 - Mortal Kombat - Armageddon (NTSC)",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "29abb93ed7be5935fcf0400aecc0c9d7258edd88",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        41,
        171,
        185,
        62,
        215,
        190,
        89,
        53,
        252,
        240,
        64,
        10,
        236,
        192,
        201,
        215,
        37,
        142,
        221,
        136
      ]
    },
    "name": "PS2 - Mortal Kombat - Armageddon (NTSC)",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 7,
  "peers": 42,
  "last_updated": "2016-12-26T19:44:32.477Z"
}