{
  "title": "Dexter Season 1, 2, 3, 4, 5, 6, 7, 8 + Extras BDRip DVDRip TSV",
  "uid": 8981709,
  "size": 65208872343,
  "categoryP": "video",
  "categoryS": "tv_shows",
  "magnet": "?xt=urn:btih:29edd6889895e9f1ef2adc19c33270d50700e40a&amp;dn=Dexter+Season+1%2C+2%2C+3%2C+4%2C+5%2C+6%2C+7%2C+8+%2B+Extras+BDRip+DVDRip+TSV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 102,
  "leechers": 620,
  "uploader": "TSV",
  "files": -1,
  "time": 1380581335,
  "description": "All 8 seasons + extras (Deleted scenes, interviews, audio books etc.) All episodes are Bluray rips. 550MB per episode yet the screen size is 720x406 AC3 5.1 Surround sound. I've checked all episodes on a Panasonic 42 inch plasma and they look great. There are no HDTV Rips.\n\nPlease seed at a decent speed.\n\n\n\nDexter is an American television drama series. The series centers on Dexter Morgan (Michael C. Hall), a blood spatter pattern analyst for a fictional Miami Metro Police Department (based on the real life Miami-Dade Police Department) who also leads a secret life as a serial killer. Set in Miami, the show's first season was largely based on the novel Darkly Dreaming Dexter (2004), the first of the Dexter series novels by Jeff Lindsay. It was adapted for television by screenwriter James Manos, Jr., who wrote the first episode. Subsequent seasons have evolved independently of Lindsay's works.\n\nIn February 2008, reruns (edited down to a TV-14 rating) began to air on CBS, although the reruns on CBS ended after one run of the first season. The series has enjoyed wide critical acclaim and popularity. Season 4 aired its season finale on December 13, 2009 to a record-breaking audience of 2.6 million viewers, making it the most-watched original series episode ever on Showtime. Michael C. Hall has received several awards and nominations for his portrayal of Dexter, including a Golden Globe. On November 18, 2011, it was announced that Dexter had been renewed for two more seasons. Season 7 premiered on September 30, 2012. The Season 8 premiere was the most watched Dexter episode ever with over 3 million viewers.\n\nIn January 2013, Showtime announced that season 8 premiere of Dexter was moved up from its originally planned airing in the fall to June 30. In April 2013, following ongoing fan speculations, Showtime announced that season eight would be the final season of Dexter.\n\nEnjoy,\n\n\nTSV.",
  "parsed": {
    "xt": "urn:btih:29edd6889895e9f1ef2adc19c33270d50700e40a",
    "dn": "Dexter Season 1, 2, 3, 4, 5, 6, 7, 8   Extras BDRip DVDRip TSV",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "29edd6889895e9f1ef2adc19c33270d50700e40a",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        41,
        237,
        214,
        136,
        152,
        149,
        233,
        241,
        239,
        42,
        220,
        25,
        195,
        50,
        112,
        213,
        7,
        0,
        228,
        10
      ]
    },
    "name": "Dexter Season 1, 2, 3, 4, 5, 6, 7, 8   Extras BDRip DVDRip TSV",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 0,
  "peers": 0,
  "last_updated": "2016-12-26T19:46:52.968Z"
}