{
  "title": "Smadav Pro 10.9 2016 + Key [4REALTORRENTZ]",
  "uid": 15701508,
  "size": 1361541,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:2a4e78fbcb90e9ff06b6acbb23bc78afbe5e4653&amp;dn=Smadav+Pro+10.9+2016+%2B+Key+%5B4REALTORRENTZ%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 46,
  "leechers": 3,
  "uploader": "menin1",
  "files": 1,
  "time": 1472482601,
  "description": "SmadAV is antivirus for additional protection of your computer, USB stick total protection and thoroughly cleaning widespread virus.\r\n\r\nKey Features of PRO:\r\n\r\n- Automatic Update Online – SmadAV Pro can perform an automatic update with an internet connection whenever there is a new revision. SmadAV will install new revisions automatically without user command. Unlike the Free SmadAV, you still have to do the update manually by downloading the new revision in Smadav.net and open the program first SmadAV to update SmadAV on your computer.\r\n- Faster Scanning – Smad-Turbo can be activated to speed up the scanning process. SmadAV perform filtering by file type so SmadAV only scan the files were most likely infected with a virus. This feature is very effective in accelerating the process of scanning without compromising the ability of detection.\r\n- Exception List – SmadAV Exception List Pro has a feature that can be used to ignore (ignore) scanning the file, folder, or a specific registry that you consider safe and should be ignored. Once a file, folder, or registry added to the Exception List, then he will be ignored and will no longer be detected by SmadAV as viruses.\r\n- Maximize / Resize Display – If you feel the look SmadAV still less extensive, you can click the Maximize button or by changing (resize) SmadAV size manually. Or if you feel SmadAV look too big, you can click the Hide Panel which will automatically make SmadAV smaller by eliminating the right panel.\r\n- Changing the Color Theme – SmadAV Pro has the ability to change the color theme originally SmadAV green became the color of your choice. In the theme color settings you can find your own choice of colors for the theme SmadAV. Once you change the theme color, the color of all SmadAV display will automatically turn into the color of your choice.\r\n- Profit Use Permit – SMADAV Free version only allowed for non-profit use as computer / personal laptop at home or non-profit organization. While SmadAV Pro version is used for members SmadAV or institution / organization profit (companies, cafes, shops, rentals, computer services, studio, etc..)\r\n- Admin Password – If you are an Admin on a computer network (such as cafes, companies, etc..), Should limit the use SmadAV by adding a password to access the full features of SmadAV. Users can still perform virus scanning and cleaning but will not be able to access the quarantine feature, updates, tools, and settings on SmadAV except having an Admin password that you have set.\r\n\r\n\r\nInstructions:\r\n\r\n1. Unpack and install\r\n2. Use given details to register\r\n3. Done",
  "parsed": {
    "xt": "urn:btih:2a4e78fbcb90e9ff06b6acbb23bc78afbe5e4653",
    "dn": "Smadav Pro 10.9 2016   Key [4REALTORRENTZ]",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "2a4e78fbcb90e9ff06b6acbb23bc78afbe5e4653",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        42,
        78,
        120,
        251,
        203,
        144,
        233,
        255,
        6,
        182,
        172,
        187,
        35,
        188,
        120,
        175,
        190,
        94,
        70,
        83
      ]
    },
    "name": "Smadav Pro 10.9 2016   Key [4REALTORRENTZ]",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 49,
  "peers": 72,
  "last_updated": "2016-12-24T20:39:30.071Z"
}