{
  "title": "Nirvana - In Utero [Original 1993 CD] 320cbr (Big Papi)",
  "uid": 9498097,
  "size": 100333891,
  "categoryP": "audio",
  "categoryS": "music",
  "magnet": "?xt=urn:btih:2b2b0c5ba9c5ac6a7156a09fa9105cd669190a51&amp;dn=Nirvana+-+In+Utero+%5BOriginal+1993+CD%5D+320cbr+%28Big+Papi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 66,
  "leechers": 6,
  "uploader": "Big-Papi",
  "files": -1,
  "time": 1390158553,
  "description": "Source: 1993 CD\n\n\n\n\nBy Busy Body (April 2004)\n\nAlmost three weeks ago, it was ten years since the tragic death of Kurt Cobain. As a dedication, I'm here to write a review of &quot;In Utero,&quot; Nirvana's greatest single musical accomplishment in their short lived career as the world's biggest and best rock band on the planet. In those ten years since Cobain committed suicide, the music scene is forever changing and Kurt's music is still as powerful and widely-received as it was in the early 1990's. Nirvana blazed fiercely as the most revolutionary and influential rock act since the Beatles, and before they knew what hit them, the band was over forever on April 5th 1994. The world came to realise this three days later.\n\n&quot;Nevermind&quot; has made Nirvana the most famous rock band in the world. It was their second album and sold a staggering 18 million copies worldwide. Kurt was tired of the adulation and praise that he received in truckloads, and decided to go back into the studio in 1993 and make an album that would scare off all the cling-ons. Originally titled &quot;I Hate Myself And I Want To Die,&quot; the album was released in September 1993 and was called In Utero. It topped the charts on both sides of the Atlantic, and shifted some 6 million copies in America. Critics adored it and I have to agree, this is one of the finest albums of all time.\n\n&quot;Serve The Servants&quot; opens the album in grand style with a loud and abrasive beat with a wonderful melody. The song's most striking line is, &quot;I tried hard to have a father, but instead I had a dad.&quot; This deep-cutting line refers to Kurt's father who deserted him when he was a child. &quot;Scentless Apprentice&quot; builds the album's aggression up even more, in one of the hardest rocking anthems the band ever recorded. This was one of the first times the band all shared writing kudos on a song instead of just Kurt.\nThe album's lead single, &quot;Heart-Shaped Box,&quot; is up next and easily towers as one of the greatest rock songs ever recorded. The production and vocals are on to top form here, complete with a visually stunning video (based on Kurt's dreams, apparently) and some genius lyrics such as, &quot;Throw down your umbilical noose so I can climb right back.&quot; Perhaps the album's most controversial song, &quot;Rape Me,&quot; follows. This is easily one of the best songs on the album in which Kurt sings of rape as a metaphor for his emotional torture. The violence contained within the song makes it a song you simply cannot ignore.\n\n&quot;Frances Farmer Will Have Her Revenge On Seattle&quot; is a fantastic song with a subdued intro that just rages out into a massive and loud assault on the ears. The lyrics, the arrangement, the vocals and the instruments are all superb - hell, even the title of the song is genius. &quot;Dumb&quot; is the first truly tranquil song on the album. There are no harsh vocals or lyrics here, everything is laid-back, but underneath lies disturbing images which can be seen through the lyrics, &quot;My heart is broke, but I have some glue. Help me inhale, and mend it with you.&quot; The addition of the cello also makes this one of the most beautiful songs you are ever likely to hear, even if it was three years old at the time of this album's release.\n\n&quot;Very Ape&quot; is perhaps the worst song on the album, but it doesn't even last two minutes so it doesn't really matter. It's still a good composition, however, but serves as more of an interlude. &quot;Milk It&quot; is one of the best songs on the album and has some amazing lyrics. I love the way Kurt screams his chorus, &quot;Doll steak! Test meat!&quot; which is then followed by &quot;Look on the bright side is suicide. Lost eyesight I'm on your side. Angel left wing, right wing, broken wing. Lack of iron and/or sleeping.&quot; Here so much can be deciphered about Kurt's tumultuous state of mind at the time of writing and recording.\n\n&quot;Pennyroyal Tea&quot; is an extremely heartbreaking song, not so much for the lyrical content, but in the way Kurt almost cries his chorus with so much emotion and the instrumental halfway through. A fantastic song, and an utter classic. &quot;Radio Friendly Unit Shifter&quot; is one of my favourite songs on the album, despite what others may think. I love the way it starts off, so loud and shocking, before breaking out with a twisted and head-banging beat that only gets better as the song continues. Kurt's vocals are so full of hate towards himself and the way he keep questioning &quot;What is wrong with me?&quot; is just almost unlistenable.\n\n&quot;Tourette's&quot; is the funniest track on the album. The title of the song is a condition which causes people to suddenly blurt out any noise or cuss-word that comes to mind, and suddenly we have Kurt just screaming and babbling a load of nonsense, but of course, in the best way possible. And then the album finally closes with &quot;All Apologies.&quot; One of Nirvana's finest ever songs, it represents a man so hard on himself it makes almost unbearable listening.\n\nOVERALL GRADE: 10/10",
  "parsed": {
    "xt": "urn:btih:2b2b0c5ba9c5ac6a7156a09fa9105cd669190a51",
    "dn": "Nirvana - In Utero [Original 1993 CD] 320cbr (Big Papi)",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "2b2b0c5ba9c5ac6a7156a09fa9105cd669190a51",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        43,
        43,
        12,
        91,
        169,
        197,
        172,
        106,
        113,
        86,
        160,
        159,
        169,
        16,
        92,
        214,
        105,
        25,
        10,
        81
      ]
    },
    "name": "Nirvana - In Utero [Original 1993 CD] 320cbr (Big Papi)",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 72,
  "peers": 120,
  "last_updated": "2016-12-24T20:45:33.427Z"
}