{"title":"Friday Night Lights Deluxe DVD Boxset Season 1, 2, 3, 4 &amp; 5 + Ex","uid":6174782,"size":28569401023,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2e09505016b84b17f3a72aa585335941110d3b50&amp;dn=Friday+Night+Lights+Deluxe+DVD+Boxset+Season+1%2C+2%2C+3%2C+4+%26+5+%2B+Ex&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":39,"leechers":72,"uploader":"TSV","files":-1,"time":1297731462,"description":"All episodes from all 5 seasons + all available bonus material +_Extras. Seasons 1-4 DVDRip, 5 HDTV as the DVD isn't out yet. This is the most complete collection on the internet. Please seed.\n\n\n\nFriday Night Lights is an American television series adapted by Peter Berg, Brian Grazer and David Nevins from a book and film of the same name. During the first three seasons the series detailed events surrounding the Dillon Panthers, a high school football team based in fictional Dillon, Texas, with particular focus given to the team's coach, Eric Taylor (Kyle Chandler) and his family. In the fourth season Taylor took over at East Dillon High School, where he coached the Lions. The show uses this small-town backdrop to address many issues facing contemporary Middle America.\n\nProduced by NBC Universal, Friday Night Lights premiered on October 3, 2006, and broadcast its first two seasons on NBC. The following three seasons of the show were then first broadcast on DirecTV's The 101 Network before being rebroadcast on NBC after the two networks partnered to keep the show on the air. NBC confirmed that the fifth season of the show would be its final season. The season premiered on October 27, 2010 and series finale takes place on February 9, 2011. As of the end of the fourth season, Friday Night Lights had aired 63 episodes. The fifth and final season had 13 episodes. The final season will begin airing on NBC on Friday, April 15. However, the season will be available on dvd beginning Tuesday, April 5.\n\nIn May 2010, ABC Family announced it had acquired the show's syndication rights. The show began airing on the network September 6, 2010, but it was pulled as of October 18, 2010, due to low ratings.\n\nFriday Night Lights has never obtained a sizable audience; however, it has been a critical success, lauded for its realistic portrayal of Middle America and deep personal exploration of its central characters. The show was awarded a Peabody Award, a Humanitas Prize, and a Television Critics Association Award, as well as several technical Primetime Emmy Awards. At the 2010 Emmy Awards, Kyle Chandler and Connie Britton were nominated for the Outstanding Lead Actor and Actress awards for a drama series.\n\n\n\nEnjoy.","torrent":{"xt":"urn:btih:2e09505016b84b17f3a72aa585335941110d3b50","amp;dn":"Friday+Night+Lights+Deluxe+DVD+Boxset+Season+1%2C+2%2C+3%2C+4+%26+5+%2B+Ex","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e09505016b84b17f3a72aa585335941110d3b50","infoHashBuffer":{"type":"Buffer","data":[46,9,80,80,22,184,75,23,243,167,42,165,133,51,89,65,17,13,59,80]},"announce":[],"urlList":[]}}