{"title":"Mount.and.Blade.Warband.Viking.Conquest-SKIDROW","uid":11672784,"size":2472721026,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2ea531f7cc6c040c4d90cbcefdfe9f3d8f352d51&amp;dn=Mount.and.Blade.Warband.Viking.Conquest-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":306,"leechers":27,"uploader":"Mbb15","files":3,"time":1422737435,"description":"S K I D R O W\n.the leading force.\n\nproudly presents\nMount &amp; Blade: Warband - Viking Conquest (c) TaleWorlds Entertainment\n\n15-12-2014......Release Date &lt;-&gt; Protection....Steam + Activation\nAction/RPG.........Game Type &lt;-&gt; Disk(s)....................1 DVD\n\nRELEASE NOTES\n\nFrom the creators of the popular Brytenwalda mod, Viking Conquest\nis a brand new DLC for Mount &amp; Blade Warband! This single and multi\nplayer DLC brings Mount &amp; Blade to historical Dark Age Britain,\ncomplemented by authentic scenes and cultures. The DLC features a\nstory mode with a complex plot, where choices have real consequences,\nas well as a standard sandbox mode in an all new setting, with expanded\noptions and controls. Online battling also takes on its own flavour,\nwith special modes like Coastal Assault and Warlord.\n\nLiving world that evolves around you, with historical and random\nevents, as well as the actions of the player all contributing.\n\nMore than 300 new cities, castles, villages and special scenes to\ndiscover, explore, conquer and plunder.\n\nMore than 200 historical characters and 100 extra NPCs: Kings, Lords,\nLadies, bards, priests and many others. Meet legendary figures like\nIvar the Boneless or his bother Sigurd Snake-in-the-Eye, royalty like\nHarald, later known as FairHair, or Aelfred of Wessex.\n\nA story mode where the player will be part of a complex plot involving\npolitical conspiracy, during the time the sons of Ragnar were leading\ntheir Great Heathen Army through Britain. An immersive game style with\nchoice and consequence, romance, betrayal, moments of greatness and\nruin.\n\nA sandbox mode, the classic Mount&amp;Blade system, where goals are\ndetermined by the player, but with all the richness and options offered\nby the new setting.\n\nMore than 15 possible companions, with deep interaction and different\npersonalities. Sometimes their conflicts will force you to use cunning\nand diplomacy.\n\nA complex religion system with two faiths, The Norse Gods and\nChristianity, with monasteries, special NPCs and parties. Religion will\nbe a important factor in the game that will affect the player's\ninteractions even within their own party.\n\nNaval travel and warfare, a key feature to really make the setting\ncomplete.\n\nBattles can range from simple robbery to massive naval conflicts\nbetween huge fleets laden with warriors, all in dynamic battles where\nyou can pilot your own boat, adjusting for factors such as wind,\nwaves, and weather.\n\nThe option to build your own refuge, hire staff for it, and populate it\nwith the wives and children of your troops.\n\nDetailed siege warfare system, with options to reduce a defender by\nhunger or morale, or by direct assault. With hard choices, plagues and\nfamines, coastal assaults.\n\nNOTE: Game is standalone and featuring also the Napoleonic Wars DLC,\nall of course fully updated to latest build!\n\nRemember to set &quot;Current Module:&quot; to Viking Conquest in the\nlauncher, if it does not auto set it.\n\nINSTALL NOTES\n\n1. Unpack the release\n2. Mount or burn image\n3. Install\n4. Copy everything from the SKIDROW folder into the game installation\n5. Block the game in your firewall and mark our cracked content as\nsecure/trusted in your antivirus program\n6. Play the game\n7. Support the companies, which software you actually enjoy!\n\nGREETINGS\n\nTo all friends of the family and honorable rival groups!","torrent":{"xt":"urn:btih:2ea531f7cc6c040c4d90cbcefdfe9f3d8f352d51","amp;dn":"Mount.and.Blade.Warband.Viking.Conquest-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ea531f7cc6c040c4d90cbcefdfe9f3d8f352d51","infoHashBuffer":{"type":"Buffer","data":[46,165,49,247,204,108,4,12,77,144,203,206,253,254,159,61,143,53,45,81]},"announce":[],"urlList":[]}}