{"title":"Princess Mononoke DVDRip DivX ENG","uid":4128263,"size":706888059,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2f47cde98e3e229438e15cd6c283b461ec392f61&amp;dn=Princess+Mononoke+DVDRip+DivX+ENG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":36,"leechers":0,"uploader":"circlensess","files":3,"time":1207907251,"description":"Plot Outline: On a journey to find the cure for a Tatarigami&amp;#039;s curse, Ashitaka finds himself in the middle of a war between the forest and Tataraba, a mining colony. In this quest he also meets San, the Mononoke Hime.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0119698/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0119698/&lt;/a&gt;\n\n\nNarrator: In ancient times, the land lay covered in forests, where, from ages long past, dwelt the spirits of the gods. Back then, man and beast lived in harmony, but as time went by, most of the great forests were destroyed. Those that remained were guarded by gigantic beasts who owed their allegiances to the Great Forest Spirit, for those were the days of gods and of demons.\n\nOne to convert the sceptics, a rich, thoughtful and charming animation\nAuthor: Jeremy-93 from Oxford, England \n\nIf, like me, your heart sinks at the prospect of another pious, sanctimonious, tub-thumping eco-fable, give &quot;Mononoke Hime&quot; a chance all the same. It does have a distinct, and far from subtle, ecological message, of the &quot;can&amp;#039;t we just live together?&quot; variety, but on the other hand it&amp;#039;s far from clear that the answer the film suggests is &quot;yes&quot;, and there are plenty of nuances and subtleties along the way. More to the point, there&amp;#039;s a proper story, well-conceived and well told, there&amp;#039;s a memorable, beautiful and violent world, credible characters and a good deal of charm.\n\nThe animation is mostly very fluent and careful, though not flashy in the way we&amp;#039;re getting used to in this CG age. (&quot;Mononoke&quot; uses cgi, but subtly and with restraint, so that the feel remains that of a group of traditional craftsmen under one guiding hand). Quite often one finds that there are more static elements in a tableaux than you&amp;#039;d expect in a Disney animated feature, but I think this is an aesthetic choice rather than a mere economy: it stylizes and formalizes, while focussing attention on the important elements in the frame. But there is occasional jerkiness, though not enough to detract seriously, and perhaps it wouldn&amp;#039;t trouble audiences whose frame of reference isn&amp;#039;t so western as mine - I&amp;#039;m not sure.\n\nTalking of the western and eastern sensibilities, the Region 2 DVD which I&amp;#039;m reviewing gives you a choice of English and Japanese dialogue, and though I watched the American dub first, I&amp;#039;d generally prefer the Japanese version, for the key roles of Ashitaka and San. Billy Crudup is appealing but too low-key, and Clare Danes strikes me as badly miscast: she sounds a bit too old, and altogether too urban to bring out the core of wildness or the steely sense of loyalty to her world. Like other reviewers, I have trouble with the Texas drawl of Billy Bob Thornton, which is just too regionally specific to match the look of the character (please understand that I&amp;#039;m not suggesting the cast should all have done fake Japanese accents!). On the other hand, it&amp;#039;s pretty much a toss-up between Yuko Tanaka and Minnie Driver (who&amp;#039;s very closely attuned to the aesthetic of the original) as Eboshi, and Gillian Anderson and Jada Pinkett Smith are just right. Still, overall you get more vividness and conviction from the original voice cast. Oddly, the lip-sync seems more approximate in the Japanese version, perhaps a fault in the synchronization on the R2 DVD. The subtitles unfortunately but understandably come from Neil Gaiman&amp;#039;s adaptation of the screenplay rather than re-translating the Japanese - one&amp;#039;s aware, for example, that Gaiman has added bits of extra, explanatory dialogue.\n\nWith all that out of the way, let&amp;#039;s concentrate on what makes the film work: it delineates a world that&amp;#039;s at once mythological and believable, and refuses to sentimentalize or simplify (even if it occasionally allows itself to preach). There are feuds and failures of trust not just between the humans and the animals, but within each world - and the animals seem as ready as the humans to exclude the other from their world. Indeed the conceit of the film seems to be that language, rather than being a product of distinctly human evolution, was originally shared among mammals at least, and it&amp;#039;s as the war with the humans goes on that the animal kingdom becomes more brutish and less coherent. For all the prince&amp;#039;s idealism and the delicate rapprochement some of the characters inch towards, one gets the impression that the logic of conflict will be hard to resist.\n\nPerhaps the most appealing and intriguing element in this world is the kodoma: the little, voiceless tree-spirits seem to be a cross-between a mushroom, a toddler and a rattle, and I defy anyone not to be captivated by them.\n\n\n","torrent":{"xt":"urn:btih:2f47cde98e3e229438e15cd6c283b461ec392f61","amp;dn":"Princess+Mononoke+DVDRip+DivX+ENG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f47cde98e3e229438e15cd6c283b461ec392f61","infoHashBuffer":{"type":"Buffer","data":[47,71,205,233,142,62,34,148,56,225,92,214,194,131,180,97,236,57,47,97]},"announce":[],"urlList":[]}}