{"title":"What the Luck?: The Surprising Role of Chance by Gary Smith","uid":15870684,"size":223800990,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2fcccf74546177fe2c0d8930351a0e1e93fc1de9&amp;dn=What+the+Luck%3F%3A+The+Surprising+Role+of+Chance+by+Gary+Smith&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":45,"leechers":1,"uploader":"Dr.Soc","files":1,"time":1474421898,"description":"What the Luck?: The Surprising Role of Chance in Our Everyday Lives [Audiobook] by Gary Smith\r\nEnglish | September 19, 2016 | ASIN: B01LDR4FYU | M4B @ 64 kbps | 7 hrs 49 mins | 213 MB\r\nNarrator: Tim Andres Pabon\r\n\r\nThe newest book by the acclaimed author of Standard Deviations takes on luck, and all the mischief the idea of luck can cause in our lives.\r\n\r\nIn Israel, pilot trainees who were praised for doing well subsequently performed worse, while trainees who were yelled at for doing poorly performed better. It is an empirical fact that highly intelligent women tend to marry men who are less intelligent. Students who get the highest scores in third grade generally get lower scores in fourth grade.\r\n\r\nAnd yet, it's wrong to conclude that screaming is not more effective in pilot training, women choose men whose intelligence does not intimidate them, or schools are failing third graders. In fact, there's one reason for each of these empirical facts: Statistics. Specifically, a statical concept called regression to the mean.\r\n\r\nRegression to the mean seeks to explain, with statistics, the role of luck in our day-to-day lives. An insufficient appreciation of luck and chance can wreak all kinds of mischief in sports, education, medicine, business, politics, and more. It can lead us to see illness when we are not sick and to see cures when treatments are worthless. Perfectly natural random variation can lead us to attach meaning to the meaningless.\r\n\r\nFreakonomics showed how economic calculations can explain seemingly counterintuitive decision-making. Thinking, Fast and Slow helped listeners identify a host of small cognitive errors that can lead to miscalculations and irrational thought. In What the Luck?, statistician and author Gary Smith sets himself a similar goal, and explains - in clear, understandable, and witty prose - how a statistical understanding of luck can change the way we see just about every aspect of our lives and can help us learn to rely less on random chance, and more on truth","torrent":{"xt":"urn:btih:2fcccf74546177fe2c0d8930351a0e1e93fc1de9","amp;dn":"What+the+Luck%3F%3A+The+Surprising+Role+of+Chance+by+Gary+Smith","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2fcccf74546177fe2c0d8930351a0e1e93fc1de9","infoHashBuffer":{"type":"Buffer","data":[47,204,207,116,84,97,119,254,44,13,137,48,53,26,14,30,147,252,29,233]},"announce":[],"urlList":[]}}