{
  "title": "Megapack for iWork 2015 (2.2) [Mac Os X] [coque599]",
  "uid": 11691525,
  "size": 1115477854,
  "categoryP": "applications",
  "categoryS": "mac",
  "magnet": "?xt=urn:btih:3073d04e8380d096072bcec244376385fdcc22be&amp;dn=Megapack+for+iWork+2015+%282.2%29+%5BMac+Os+X%5D+%5Bcoque599%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 58,
  "leechers": 3,
  "uploader": "coque599",
  "files": 1,
  "time": 1423562209,
  "description": "Megapack for iWork 2015 is the ultimate home and office package providing creative designs, themes, and templates for the latest edition of Pages, Numbers, and Keynote.\n\nPAGES\nFrom simple letters and invites, to media-rich newsletters, brochures, and reports, Megapack for iWork 2015 will have you building full documents in minutes.\n\nTables and charts can be quickly updated, with time-saving presets including character and paragraph styles, color schemes, table of contents, multiple columns, headers and footers and more.\n\nEasily add your own text and graphics using the placeholders that help you focus on content and not the design. It's effortlessly easy. Period.\n\nNUMBERS\nPlan a wedding. Start a business. Compare mortgages and loans. Anyone can be good at Numbers.\n\nSpreadsheets that look great, and help you organize and plan for home and in the office. Tables are already made. Formulas have been figured out. Fonts are in place. They're all ready to go.\n\nKEYNOTE\nProfessionally-designed themes, cinematic transitions, animated text and powerful slide builds, Megapack for iWork 2015 lets you create stunning, interactive presentations certain to entertain and delight both you the presenter, as well as your audience.\n\nColor-coordinated templates let you maintain a slick, consistent look and feel throughout your presentation. From the opening title slide to matching tables and 3D charts to the closing slide, the templates include graphic elements, color themes and backgrounds.\n\nREQUIREMENTS\nPages, Numbers, and Keynote (2013 Edition) is required to use this app.\n\nSeed And Enjoy\nIf you like my work vote it good",
  "parsed": {
    "xt": "urn:btih:3073d04e8380d096072bcec244376385fdcc22be",
    "dn": "Megapack for iWork 2015 (2.2) [Mac Os X] [coque599]",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "3073d04e8380d096072bcec244376385fdcc22be",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        48,
        115,
        208,
        78,
        131,
        128,
        208,
        150,
        7,
        43,
        206,
        194,
        68,
        55,
        99,
        133,
        253,
        204,
        34,
        190
      ]
    },
    "name": "Megapack for iWork 2015 (2.2) [Mac Os X] [coque599]",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 61,
  "peers": 30,
  "last_updated": "2016-12-24T21:24:26.600Z"
}