{"title":"DOOM 3: BFG Edition [R.G. Mechanics]","uid":13733943,"size":1473032138,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:30fc85bc73cc01f4dfbf30d55f71d12f42d45b04&amp;dn=DOOM+3%3A+BFG+Edition+%5BR.G.+Mechanics%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":278,"leechers":5,"uploader":"Pirata","files":17,"time":1457037605,"description":"The Edition of Doom 3 BFG Edition includes an updated version of the cult shooter Doom 3 as well as the addition to it under the name Ressurection of Evil. In addition to the familiar players in the history of the war of the Martian station Doom fans waiting for a completely new episodes - seven levels under the general title The Lost Mission. On the Doom 3 BFG Edition players can still deeper plunge into the atmosphere of the legendary shooter. Optimize graphics for modern platforms, improved rendering and lighting, support for stereoscopic 3D and 5.1 sound, the new system of conservation at the control points, and support the achievements of Xbox LIVE and prizes PlayStation Network - all this will allow players to enjoy the Doom 3 for the first time. Finally , as a special bonus for the true fans of the series of Doom 3 BFG Edition also contains the original dilogy Doom. Do not miss the opportunity to complete your collection of the best shooters in the best edition with a magnificent collection of Doom 3 BFG Edition.\r\n\r\nUpdated classics. The same Doom 3, in a slightly modified wrapper.\r\nNow the levels are loaded much faster.\r\nAlso included in the publication of the first 2 parts, with the second there is an addon.\r\nSupplement Lost Mission for the Doom 3.\r\nAnd of course, gamepad support, still dreamed about it?\r\nAre you ready to once again plunge into the world of Doom? Then go ahead!\r\n\r\nDo not cut / recoded\r\nSoftonic sound from 1C (version 1.0)\r\nCrack the text from «ENPY Studio» (version of 09.21.2013)\r\nVersion of the game - the last at the time of release (01/30/2016)","torrent":{"xt":"urn:btih:30fc85bc73cc01f4dfbf30d55f71d12f42d45b04","amp;dn":"DOOM+3%3A+BFG+Edition+%5BR.G.+Mechanics%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30fc85bc73cc01f4dfbf30d55f71d12f42d45b04","infoHashBuffer":{"type":"Buffer","data":[48,252,133,188,115,204,1,244,223,191,48,213,95,113,209,47,66,212,91,4]},"announce":[],"urlList":[]}}