{
  "title": "LiveLessons - Cisco CCNA Routing and Switching 200-120 Complete",
  "uid": 11151381,
  "size": 12700455364,
  "categoryP": "video",
  "categoryS": "other",
  "magnet": "?xt=urn:btih:32f472bc2b626bbec75ed76c7e89793f4874de35&amp;dn=LiveLessons+-+Cisco+CCNA+Routing+and+Switching+200-120+Complete+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 90,
  "leechers": 31,
  "uploader": "mbulgaria",
  "files": 389,
  "time": 1412346461,
  "description": "From Cisco Press:\n\n26+ Hours of Video Instruction\n\nCisco CCNA Routing and Switching 200-120 LiveLessons Complete Video Training is a comprehensive training course that brings Cisco CCNA exam topics to life through the use of real-world demonstrations, animations, live instruction, and configurations, making learning these foundational networking topics easy and fun.\n\nBest-selling author, expert instructor, and double CCIE Kevin Wallace walks you through the full range of topics on the CCNA Routing and Switching 200-120 exam, including networking basics, local area networks, routing, router services, network security, advanced switching features, router operation, OSPF and EIGRP operation and configuration, first-hop redundancy protocols, network management, and WAN connection types and configuration. This unique product contains multiple types of video presentations, including live instructor whiteboarding, real world demonstrations, animations of network activity, dynamic KeyNote presentations, doodle videos, and hands-on router and switch CLI configuration and troubleshooting in real lab environments, allowing you to both learn the concepts and the hands-on application. The 400+ videos contained in this product provide you more than 26 hours of instruction. Modules are divided into easy to digest lessons and sublessons and conclude with summaries and interactive module and glossary quizzes to help assess your knowledge. Modules are grouped into eight parts that also conclude with part review quizzes, challenging you to recall information across multiple topics. The product concludes with a series of lessons that give you valuable advice to help prepare for the actual exam.\n\nDesigned to take you inside CCNA networking concepts in a unique and interactive way, Cisco CCNA Routing and Switching 200-120 LiveLessons Complete Video Training is guaranteed to help you master the foundational networking topics that will help you succeed on the exam and on the job.\n\n\n\n\nImportant Notes:\n\n    I'm NOT the original uploader, all credits goes to him/her/them\n    All files were renamed to correct .flv extension (original uploads consist of files in .flv containers simply renamed to .mp4 without conversion)\n    Videos are mixed 720p/1080p (like in original uploads)\n    All videos are divided into ICND1 and ICND2 parts with short 200-120 intro",
  "parsed": {
    "xt": "urn:btih:32f472bc2b626bbec75ed76c7e89793f4874de35",
    "dn": "LiveLessons - Cisco CCNA Routing and Switching 200-120 Complete ",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "32f472bc2b626bbec75ed76c7e89793f4874de35",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        50,
        244,
        114,
        188,
        43,
        98,
        107,
        190,
        199,
        94,
        215,
        108,
        126,
        137,
        121,
        63,
        72,
        116,
        222,
        53
      ]
    },
    "name": "LiveLessons - Cisco CCNA Routing and Switching 200-120 Complete ",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 195,
  "peers": 57,
  "last_updated": "2016-12-26T20:50:57.404Z"
}