{"title":"Netter's Atlas of Human Anatomy, 6E [PDF] [StormRG]","uid":10042947,"size":419394100,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:339369d1ee3dbf817bd1c8522c62a044fedcb4b2&amp;dn=Netter%27s+Atlas+of+Human+Anatomy%2C+6E+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":95,"leechers":2,"uploader":"0xmovva","files":-1,"time":1398488657,"description":"Author: Frank H. Netter\nSeries: Netter Basic Science\nPaperback: 640 pages\nPublisher: Saunders; 6 edition (April 7, 2014)\nLanguage: English\nISBN-10: 1455704180\nISBN-13: 978-1455704187\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet.  Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n___________________________________________________________________________________\n\n\nThe gold standard of excellence for 25 years, Frank H. Netter, MD's Atlas of Human Anatomy offers unsurpassed depictions of the human body in clear, brilliant detail - all from a clinician's perspective. With its emphasis on anatomic relationships and clinically relevant views, Dr. Netter's work provides a coherent, lasting visual vocabulary for understanding anatomy and how it applies to medicine today.\n\n* View anatomy from a clinical perspective with hundreds of exquisite, hand-painted illustrations created by pre-eminent medical illustrator Frank H. Netter, MD.\n\n* Join the global community of medical and healthcare students and professionals who rely on Netter to optimize learning and clarify even the most difficult aspects of human anatomy. Comprehensive labeling uses the international anatomic standard terminology, Terminologia Anatomica, and every aspect of the Atlas is reviewed and overseen by clinical anatomy and anatomy education experts.\n\n* Explore additional unique perspectives of difficult-to-visualize anatomy through all-new paintings by Dr. Carlos Machado, including breast lymph drainage; the pterygopalantine fossa; the middle ear; the path of the internal carotid artery; and the posterior knee, plus additional new plates on arteries of the limbs and new radiologic images.\n\n* Master challenging structures with visual region-by-region coverage -- including Muscle Table appendices at the end of each Section.","torrent":{"xt":"urn:btih:339369d1ee3dbf817bd1c8522c62a044fedcb4b2","amp;dn":"Netter%27s+Atlas+of+Human+Anatomy%2C+6E+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"339369d1ee3dbf817bd1c8522c62a044fedcb4b2","infoHashBuffer":{"type":"Buffer","data":[51,147,105,209,238,61,191,129,123,209,200,82,44,98,160,68,254,220,180,178]},"announce":[],"urlList":[]}}