{
  "title": "Network Analysis Using Wireshark Cookbook [PDF]~StormRG~",
  "uid": 9644137,
  "size": 20295931,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:3516f86fbf6eaa980eee867060f25bfcfff76231&amp;dn=Network+Analysis+Using+Wireshark+Cookbook+%5BPDF%5D%7EStormRG%7E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 38,
  "leechers": 0,
  "uploader": "steelballz",
  "files": -1,
  "time": 1392965843,
  "description": "Description\nNetwork Analysis Using Wireshark Cookbook\nAuthor: Yoram Orzach\nPublished: Dec 24 2013\nPublisher: Packt Publishing\nISBN-10:1849517649\nISBN-13:978-1849517645\nASIN:B00HK3VP40\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\n\nTested on the above readers with no problems on laptop and Android tablet.\nDon't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss. Please allow a couple\nseconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\nimage\nCover from actual book file\n\n\nProduct Description\n\n\nIn Detail\n\nIs your network slow? Are your users complaining? Disconnections? IP Telephony problems? Video freezes? Network analysis is the process of isolating these problems and fixing them, and Wireshark has long been the most popular network analyzer for achieving this goal. Based on hundreds of solved cases, Network Analysis using Wireshark Cookbook provides you with practical recipes for effective Wireshark network analysis to analyze and troubleshoot your network.\n\n&quot;Network analysis using Wireshark Cookbook&quot; highlights the operations of Wireshark as a network analyzer tool. This book provides you with a set of practical recipes to help you solve any problems in your network using a step-by-step approach.\n\n&quot;Network analysis using Wireshark Cookbook&quot; starts by discussing the capabilities of Wireshark, such as the statistical tools and the expert system, capture and display filters, and how to use them. The book then guides you through the details of the main networking protocols, that is, Ethernet, LAN switching, and TCP/IP, and then discusses the details of application protocols and their behavior over the network. Among the application protocols that are discussed in the book are standard Internet protocols like HTTP, mail protocols, FTP, and DNS, along with the behavior of databases, terminal server clients, Citrix, and other applications that are common in the IT environment.\n\nIn a bottom-up troubleshooting approach, the book goes up through the layers of the OSI reference model explaining how to resolve networking problems. The book starts from Ethernet and LAN switching, through IP, and then on to TCP/UDP with a focus on TCP performance problems. It also focuses on WLAN security. Then, we go through application behavior issues including HTTP, mail, DNS, and other common protocols. The book finishes with a look at network forensics and how to search and find security problems that might harm the network.\nApproach\n\n&quot;Network analysis using Wireshark Cookbook&quot; contains more than 100 practical recipes for analyzing your network and troubleshooting problems in the network. This book provides you with simple and practical recipes on how to solve networking problems with a step-by-step approach.\nWho this book is for\n\nThis book is aimed at research and development professionals, engineering and technical support, and IT and communications managers who are using Wireshark for network analysis and troubleshooting. This book requires a basic understanding of networking concepts, but does not require specific and detailed technical knowledge of protocols or vendor implementations.\n\n\n\nimage\nScientia est potentia",
  "parsed": {
    "xt": "urn:btih:3516f86fbf6eaa980eee867060f25bfcfff76231",
    "dn": "Network Analysis Using Wireshark Cookbook [PDF]~StormRG~",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "3516f86fbf6eaa980eee867060f25bfcfff76231",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        53,
        22,
        248,
        111,
        191,
        110,
        170,
        152,
        14,
        238,
        134,
        112,
        96,
        242,
        91,
        252,
        255,
        247,
        98,
        49
      ]
    },
    "name": "Network Analysis Using Wireshark Cookbook [PDF]~StormRG~",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 38,
  "peers": 60,
  "last_updated": "2016-12-24T21:56:28.292Z"
}