{
  "title": "Avast Internet Security 2015 v.10.3.2216.980 Final with license-",
  "uid": 11791183,
  "size": 207455140,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:367d1ef7830529894e1573631254663394cdd03b&amp;dn=Avast+Internet+Security+2015+v.10.3.2216.980+Final+with+license-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 52,
  "leechers": 7,
  "uploader": "OnlyByTheRain",
  "files": 16,
  "time": 1427943615,
  "description": "Avast Internet Security 2015 v.10.3.2216.980 Final with License | 197.84 MB\n\n\nThe Most Trusted Security - 220 million people choose AVAST to keep them safe online-more than any security company. avast! is the most trusted name in the antivirus industry, actively protecting more than 220 million people around the world. We've been protecting devices and data for over 25 years, in over 40 languages, on every populated continent.\nNeed more than that? Secure even your financial transactions\nYour money really deserves a solid level of protection against theft. With avast! SafeZone, you can set your favorite banking or shopping sites to automatically launch in a 'virtual window', to ensure that all of your sensitive financial transactions stay private. Perfect for auction sites, buying concert tickets, booking with hotels or airlines, online gaming, or any sort of monetary transfer, it now has a sleeker look and is super-easy to launch and use.\n\nAnd if that's not enough Increase your security by automatically updating other programs on your PC\nHackers count on people to use outdated versions of such applications as browsers or PDF readers, so most virus and malware threats exploit security holes that newer versions fix. As it's annoying but vital to update all those programs manually, Premier's automatic Software Updater does it for you-to make sure you're using the latest versions to close those security holes.\n\nIntelligent Antivirus\n- With new DynaGen technology\n\nAnti-malware Protection\n- Plus anti-spyware &amp; anti-rootkit\n\nSafeZone\n- For secured payments &amp; banking\n\nSilent Firewall\n- Against hacker attacks\n\nAnti-spam\n- Against phishing &amp; scam emails\n\nAutomatic Software Updater\n- Keeps other programs updated\n\nAccessAnywhere\n- Access your PC over the Internet\n\nData Shredder\n- For a military-grade permanent data erasure\n\nWhat's new in version 2015:\n- HTTPS scanning. Now, we are able to detect and decrypt TLS/SSL protected traffic in our Web-content filtering component. We are using our own generated certificates that are added into the Root Certificate store in Windows and also into major browsers. This feature will protect you against viruses coming through HTTPs traffic as well as adding compatibility for SPDY+HTTPS/ HTTP 2.0 traffic. You can tune/disable this feature in the settings section.\n- Home Network Security. Scan your home network for vulnerabilities (wifi status, connected devices, router settings, factory passwords, etc.). This is quite a new approach as we are trying to discover potential problems not isolated on the particular device only, but in the entire network of devices you use or connect to the Internet from.\n- SecureDNS (this feature is active in the paid versions only). We are introducing a new provider which guards against unprotected DNS/DNS hijack on a router/client (including unsecured networks, public ones, etc.).\n- Smart Scan. Integrated all on demand scans into one (Antivirus, Software updates, Home Network, GrimeFighter). One scan, different results and recommendations.\n- New Support System. Easy contact for paid users to submit a ticket with all info included automatically. Improved knowledge base for free users. Help is completely online and is more up to date.\n- General bugfixing. This covers a lot of stability and performance changes in all components (but the main focus was traditionally on the network and engine components).\n- GrimeFighter Free. GrimeFighter will offer free cleaning of junk files and tuning of system settings. These tasks are performed by our Zilch and Torque minions. Other minion functions remain as paid-for features.\n- AVAST NG. A hardware based virtualization solution capable of running each Windows process in standalone safe virtualized environment (VM) and fully integrated to your desktop. Each process is executed in its own instance of VM, which means totally isolated from your other applications. This feature is now powering the Avast DeepScreen, resulting in better detection. The technology will also eventually power the Sandbox and SafeZone components (although it does not now).\n\nOS : Windows 8/7/Vista/XP x86/x64\nLanguage : Multilingual",
  "parsed": {
    "xt": "urn:btih:367d1ef7830529894e1573631254663394cdd03b",
    "dn": "Avast Internet Security 2015 v.10.3.2216.980 Final with license-",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "367d1ef7830529894e1573631254663394cdd03b",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        54,
        125,
        30,
        247,
        131,
        5,
        41,
        137,
        78,
        21,
        115,
        99,
        18,
        84,
        102,
        51,
        148,
        205,
        208,
        59
      ]
    },
    "name": "Avast Internet Security 2015 v.10.3.2216.980 Final with license-",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 59,
  "peers": 9,
  "last_updated": "2016-12-24T22:05:16.519Z"
}