{
  "title": "Gordon Ramsay's Home Cooking - Gordon Ramsay [Epub &amp; Mobi] [",
  "uid": 9843864,
  "size": 31230673,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:3754ad80b8233fc82a73feb690ff7684f7d479a4&amp;dn=Gordon+Ramsay%27s+Home+Cooking+-+Gordon+Ramsay+%5BEpub+%26amp%3B+Mobi%5D+%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 46,
  "leechers": 4,
  "uploader": "krystine",
  "files": -1,
  "time": 1396039487,
  "description": "Description\nGordon Ramsay's Home Cooking: Everything You Need to Know to Make Fabulous Food\nAuthor: Gordon Ramsay\nPublished: 2013\nPublisher: Grand Central Life &amp; Style\nISBN: 9781455525251\nFormat: Retail Epub and Mobi\nReader Required:\nEpub- Adobe Digital Editions, Calibre, MoonReader for Android\nMobi- Kindle app, Calibre, MoonReader for Android\n\nTested on the above readers with no problems on laptop and Android tablet. \nDon't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss. \nPlease allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nEnjoy! \n\n\nBased on a new cooking show, this book will give experienced as well as novice cooks the desire, confidence and inspiration to get cooking. Ramsay will offer simple, accessible recipes with a &quot;wow&quot; factor. Gordon has travelled the world from India and the Far East to LA and Europe, and the recipes in this book will draw all these culinary influences together to show us simple, vibrant and delicious recipes that reflect the way we eat today. For example: Miso braised salmon fillet with Asian vegetables, Pork and Bacon slider with home made bbq sauce, Curried Sweetcorn Soup, Wild Mushroom Risotto Arrancini, and Baked Lemon Cheesecake with Raspberries. \n\nEach chapter will concentrate on a different area of cooking--from the classics to the secret of cooking with Chili and spice, through roasting, baking, and helpful sections on cooking good food for less and cooking for a crowd. Woven into the book will be useful tricks and tips--from ways to save time and money, to cleaning and prepping ingredients, to pan frying like a pro. \n\nStuffed full of delicious recipes, invaluable tips and lashings of Gordon's trademark cheeky wit, Gordon Ramsay's Home Cooking is the ultimate cooking lesson from the ultimate chef.\n",
  "parsed": {
    "xt": "urn:btih:3754ad80b8233fc82a73feb690ff7684f7d479a4",
    "dn": "Gordon Ramsay's Home Cooking - Gordon Ramsay [Epub &amp; Mobi] [",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "3754ad80b8233fc82a73feb690ff7684f7d479a4",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        55,
        84,
        173,
        128,
        184,
        35,
        63,
        200,
        42,
        115,
        254,
        182,
        144,
        255,
        118,
        132,
        247,
        212,
        121,
        164
      ]
    },
    "name": "Gordon Ramsay's Home Cooking - Gordon Ramsay [Epub &amp; Mobi] [",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 82,
  "peers": 16,
  "last_updated": "2016-12-26T21:20:37.217Z"
}