{
  "title": "Led Zeppelin - Complete Studio Album Discography 1969-1982 [FLAC",
  "uid": 10402039,
  "size": 2924541186,
  "categoryP": "audio",
  "categoryS": "flac",
  "magnet": "?xt=urn:btih:38098aef87b7c11fde9b21315a6e96c60f8771ee&amp;dn=Led+Zeppelin+-+Complete+Studio+Album+Discography+1969-1982+%5BFLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 50,
  "leechers": 11,
  "uploader": "rudown78",
  "files": 258,
  "time": 1403382614,
  "description": "Led Zeppelin - Complete Studio Album Discography 1969-1982 [FLAC]\n\n\nLed Zeppelin was the definitive heavy metal band. It wasn't just their crushingly loud interpretation of the blues -- it was how they incorporated mythology, mysticism, and a variety of other genres (most notably world music and British folk) -- into their sound. Led Zeppelin had mystique. They rarely gave interviews, since the music press detested the band. Consequently, the only connection the audience had with the band was through the records and the concerts. More than any other band, Led Zeppelin established the concept of album-oriented rock, refusing to release popular songs from their albums as singles. In doing so, they established the dominant format for heavy metal, as well as the genre's actual sound.\n\nLed Zeppelin formed out of the ashes of the Yardbirds. Jimmy Page had joined the band in its final days, playing a pivotal role on their final album, 1967's Little Games, which also featured string arrangements from John Paul Jones. During 1967, the Yardbirds were fairly inactive. While the Yardbirds decided their future, Page returned to session work in 1967. In the spring of 1968, he played on Jones' arrangement of Donovan's &quot;Hurdy Gurdy Man.&quot; During the sessions, Jones requested to be part of any future project Page would develop. Page would have to assemble a band sooner than he had planned. In the summer of 1968, the Yardbirds' Keith Relf and James McCarty left the band, leaving Page and bassist Chris Dreja with the rights to the name, as well as the obligation of fulfilling an upcoming fall tour. Page set out to find a replacement vocalist and drummer. Initially, he wanted to enlist singer Terry Reid and Procol Harum's drummer B.J. Wilson, but neither musician was able to join the group. Reid suggested that Page contact Robert Plant, who was singing with a band called Hobbstweedle.\n\nAfter hearing him sing, Page asked Plant to join the band in August of 1968, the same month Chris Dreja dropped out of the new project. Following Dreja's departure, John Paul Jones joined the group as its bassist. Plant recommended that Page hire John Bonham, the drummer for Plant's old band, the Band of Joy. Bonham had to be persuaded to join the group, as he was being courted by other artists who offered the drummer considerably more money. By September, Bonham agreed to join the band. Performing under the name the New Yardbirds, the band fulfilled the Yardbirds' previously booked engagements in late September 1968. The following month, they recorded their debut album in just under 30 hours. Also in October, the group switched its name to Led Zeppelin. The band secured a contract with Atlantic Records in the United States before the end of the year. Early in 1969, Led Zeppelin set out on their first American tour, which helped set the stage for the January release of their eponymous debut album. Two months after its release, Led Zeppelin had climbed into the U.S. Top Ten. Throughout 1969, the band toured relentlessly, playing dates in America and England. While they were on the road, they recorded their second album, Led Zeppelin II, which was released in October of 1969.\n\nLike its predecessor, Led Zeppelin II was an immediate hit, topping the American charts two months after its release and spending seven weeks at number one. The album helped establish Led Zeppelin as an international concert attraction, and for the next year, the group continued to tour relentlessly. Led Zeppelin's sound began to deepen with Led Zeppelin III. Released in October of 1970, the album featured an overt British folk influence. The group's infatuation with folk and mythology would reach a fruition on the group's untitled fourth album, which was released in November of 1971. Led Zeppelin IV was the band's most musically diverse effort to date, featuring everything from the crunching rock of &quot;Black Dog&quot; to the folk of &quot;The Battle of Evermore,&quot; as well as &quot;Stairway to Heaven,&quot; which found the bridge between the two genres. &quot;Stairway to Heaven&quot; was an immediate radio hit, eventually becoming the most played song in the history of album-oriented radio; the song was never released as a single. Despite the fact that the album never reached number one in America, Led Zeppelin IV was their biggest album ever, selling well over 16 million copies over the next two and a half decades.\n\nLed Zeppelin did tour to support both Led Zeppelin III and Led Zeppelin IV, but they played fewer shows than they did on their previous tours. Instead, they concentrated on only playing larger venues. After completing their 1972 tour, the band retreated from the spotlight and recorded their fifth album. Released in the spring of 1973, Houses of the Holy continued the band's musical experimentation, featuring touches of funk and reggae among their trademark rock and folk. The success of Houses of the Holy set the stage for a record-breaking American tour. Throughout their 1973 tour, Led Zeppelin broke box-office records -- most of which were previously held by the Beatles -- across America. The group's concert at Madison Square Garden in July was filmed for use in the feature film The Song Remains the Same, which was released three years later. After their 1973 tour, Led Zeppelin spent a quiet year during 1974, releasing no new material and performing no concerts. They did, however, establish their own record label, Swan Song, which released all of Led Zeppelin's subsequent albums, as well as records by Dave Edmunds, Bad Company, the Pretty Things, and several others. Physical Graffiti, a double album released in February of 1975, was the band's first release on Swan Song. The album was an immediate success, topping the charts in both America and England. Led Zeppelin launched a large American tour in 1975, but it came to a halt when Robert Plant and his wife suffered a serious car crash while vacationing in Greece. The tour was canceled and Plant spent the rest of the year recuperating from the accident.\n\nLed Zeppelin returned to action in the spring of 1976 with Presence. Although the album debuted at number one in both America and England, the reviews for the album were lukewarm, as was the reception to the live concert film The Song Remains the Same, which appeared in the fall of 1976. The band finally returned to tour America in the spring of 1977. A couple of months into the tour, Plant's six-year-old son Karac died of a stomach infection. Led Zeppelin immediately canceled the tour and offered no word whether or not it would be rescheduled, causing widespread speculation about the band's future. For a while, it did appear that Led Zeppelin were finished. Robert Plant spent the latter half of 1977 and the better part of 1978 in seclusion. The group didn't begin work on a new album until late in the summer of 1978, when they began recording at ABBA's Polar studios in Sweden. A year later, the band played a short European tour, performing in Switzerland, Germany, Holland, Belgium, and Austria. In August of 1979, Led Zeppelin played two large concerts at Knebworth; the shows would be their last English performances.\n\nIn Through the Out Door, the band's much-delayed eighth studio album, was finally released in September of 1979. The album entered the charts at number one in both America and England. In May of 1980, Led Zeppelin embarked on their final European tour. In September, Led Zeppelin began rehearsing at Jimmy Page's house in preparation for an American tour. On September 25, John Bonham was found dead in his bed -- following an all-day drinking binge, he had passed out and choked on his own vomit. In December of 1980, Led Zeppelin announced they were disbanding, since they could not continue without Bonham.\n\nFollowing the breakup, the remaining members all began solo careers. John Paul Jones returned to producing and arranging, finally releasing his solo debut, Zooma, in 1999. After recording the soundtrack for Death Wish II, Jimmy Page compiled the Zeppelin outtakes collection Coda, which was released at the end of 1982. That same year, Robert Plant began a solo career with the Pictures at Eleven album. In 1984, Plant and Page briefly reunited in the all-star oldies band the Honeydrippers. After recording one EP with the Honeydrippers, Plant returned to his solo career and Page formed the Firm with former Bad Company singer Paul Rogers. In 1985, Led Zeppelin reunited to play Live Aid, sparking off a flurry of reunion rumors; the reunion never materialized. In 1988, the band re-formed to play Atlantic's 25th anniversary concert. During 1989, Page remastered the band's catalog for release on the 1990 box set Led Zeppelin. The four-disc set became the biggest-selling multi-disc box set of all time, which was followed up three years later by another box set, the mammoth ten-disc set The Complete Studio Recordings.\n\nIn 1994, Page and Plant reunited to record a segment for MTV Unplugged, which was released as No Quarter in the fall of 1994. Although the album went platinum, the sales were disappointing considering the anticipation of a Zeppelin reunion. The following year, Page and Plant embarked on a successful international tour, which eventually led to an all-new studio recording in 1998, the Steve Albini-produced Walking Into Clarksdale. Surprisingly, the album was met with a cool reception by the record-buying public, as Page and Plant ended their union shortly thereafter, once again going their separate ways (Page went on to tour with the Black Crowes, while Plant resumed his solo career). Further Zeppelin compilation releases saw the light of day in the late '90s, including 1997's stellar double-disc BBC Sessions, plus Zep's first true best-of collections -- 1999's Early Days: The Best Of, Vol. 1 and 2000's Latter Days: The Best Of, Vol. 2. A full reunion of the surviving members of the band, with Jason Bonham filling in for his late father on drums, took place in 2007 when the group played a historic concert at London's 02 in memory of Atlantic Records founder Ahmet Ertegun. The set was filmed and recorded, and finally appeared as a commercial release under the title Celebration Day in the fall of 2012.\n\nIn 2014, Led Zeppelin launched a massive catalog campaign supervised by Jimmy Page, containing newly remastered versions of all their albums, available on CD, high-resolution downloads, and vinyl. Additionally, there were deluxe editions containing previously unreleased material from the vaults. The first round of reissues contained the band's first three albums and appeared in June 2014.\n\n\n1969 - Led Zepellin \n1969 - led Zeppelin II\n1970 - Led Zeppelin III\n1971 - Led Zeppelin IV\n1973 - Houses of the Holy\n1975 - Physical Graffiti\n1976 - Presence\n1979 - In Through the Out Door\n1982 - Coda\n\n\nNote: All of the albums are the Jimmy Page and George Marino remasters that were released in 1994. \n\nFull album artwork and rip logs are also included. \n\nEnjoy!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n",
  "parsed": {
    "xt": "urn:btih:38098aef87b7c11fde9b21315a6e96c60f8771ee",
    "dn": "Led Zeppelin - Complete Studio Album Discography 1969-1982 [FLAC",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "38098aef87b7c11fde9b21315a6e96c60f8771ee",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        56,
        9,
        138,
        239,
        135,
        183,
        193,
        31,
        222,
        155,
        33,
        49,
        90,
        110,
        150,
        198,
        15,
        135,
        113,
        238
      ]
    },
    "name": "Led Zeppelin - Complete Studio Album Discography 1969-1982 [FLAC",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 61,
  "peers": 0,
  "last_updated": "2016-12-24T22:14:46.793Z"
}