{"title":"Stronghold Legends Steam Edition-TiNYiSO","uid":15840027,"size":1876338567,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:39d883ebb5f8c7f41b34a48a0d733210f6873f49&amp;dn=Stronghold+Legends+Steam+Edition-TiNYiSO&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":41,"leechers":9,"uploader":"dauphong","files":5,"time":1474028466,"description":"Proudly Presents\r\n\r\nStronghold Legends: Steam Edition (c) FireFly Studios\r\nRelease On: 16 September 2016 Disk Amount/Format: 1 DVD\r\nType of Game: Strategy Media Protection: Steam\r\n\r\nLead the siege as fantasy characters throughout history! Stronghold\r\nLegends: Steam Edition takes the beloved castle building series and plunges\r\nit into myth and legend with three unique factions and new Steam-exclusive\r\ncontent. Play as King Arthur and command his Knights of the Round Table\r\nally with the demonic Vlad Dracula or relive the heroic saga of Siegfried\r\nof Xanten in 24 story missions. Build and destroy castles using powerful\r\nspells, mythical beasts and legendary hero units!\r\n\r\nFeatures:\r\n\r\nRemastered for Steam - Steam multiplayer, Workshop support, achievements\r\nnew maps, a digital art book, trading cards and DLC campaigns\r\nBecome Legendary Heroes - Unique fantasy setting with campaigns following\r\nthe exploits of King Arthur, Siegfried and Vlad Dracula\r\nCommand Mythical Beasts - Three playable factions with access to frost\r\ngiants, creepers, werewolves and more!\r\nCast Powerful Spells - Hero units ranging from the wizard Merlin to fire\r\nbreathing dragons and the Knights of the Round Table\r\nBattle AI Lords - Skirmish multiplayer against computer-controlled\r\nopponents and human players\r\nBesiege Players Online - Deathmatch, King of the Hill, Economic War and\r\nCapture the Flag game modes\r\n\r\nSteam Edition\r\nInspired by medieval folklore and introducing magic to the series for the\r\nfirst time, Stronghold Legends introduces new environments, units\r\nchallenges and gameplay with each single player campaign and bonus trail\r\nCatapult werewolves over castle walls, incinerate troops using dragon fire\r\nor command mighty ice giants to obliterate enemy defenses! Go online with\r\nup to four players in competitive multiplayer over Steam or skirmish\r\noffline against computer-controlled opponents\r\n\r\nCreated exclusively for Steam, Stronghold Legends: Steam Edition comes with\r\nfull Steam multiplayer, achievements, new maps, a digital art book, trading\r\ncards and all DLC campaigns. The Steam edition also updates Legends with\r\nfull Steam Workshop support! Sculpt an icy tundra to wage war on, a\r\nscorched earth battleground using the evil terrain type or conjure up a\r\nmagical kingdom fit for King Arthur himself\r\n\r\nBurn/mount, install, copy crack, play!\r\n\r\nGreetz: LARGEiSO and MEDIUMiSO\r\n\r\n(C) E/dfs\r\n&quot; SIZE DOES NOT MATTER! &quot;","torrent":{"xt":"urn:btih:39d883ebb5f8c7f41b34a48a0d733210f6873f49","amp;dn":"Stronghold+Legends+Steam+Edition-TiNYiSO","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39d883ebb5f8c7f41b34a48a0d733210f6873f49","infoHashBuffer":{"type":"Buffer","data":[57,216,131,235,181,248,199,244,27,52,164,138,13,115,50,16,246,135,63,73]},"announce":[],"urlList":[]}}