{
  "title": "The Aztec: The Last Great Civilization of Mesoamerica",
  "uid": 15891843,
  "size": 1866163,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:3aa68e35a93046c77ede9a5152f6661a1f36212c&amp;dn=The+Aztec%3A+The+Last+Great+Civilization+of+Mesoamerica&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 68,
  "leechers": 1,
  "uploader": "marty14",
  "files": 1,
  "time": 1474762537,
  "description": "The Aztec: The Last Great Civilization of Mesoamerica - Duncan Ryan [epub]\r\n\r\nThe Aztec, moving into the Valley of Mexico late in the pre-Columbian history of Mesoamerica, rapidly grew from little more than a nomadic tribe to a civilization the likes of which had seldom been seen on Earth, rivaling even the greatest cultures of Europe and Asia at the time. With a strong society, a rich cultural tradition and a military that was second to none in the New World, the Aztec became the dominating force in all of Mexico. At the same time, their religion, one which demanded a hefty toll in human sacrifice, became one of the most singular in all of human history, often going so far as to deprive the Aztec society itself of human resources and spur wars intended almost exclusively to acquire new sacrifices. \r\n\r\nThough these are the commonly known elements of Aztec society, there is much that is often ignored because of the more sensational elements of their history. Trade, for example, was a massive facet of Aztec society, which the empire exploited by establishing trade routes that crisscrossed Mesoamerica from the American southwest to the Inca Empire in the Peruvian Andes. Art, science and technology also made up part of this rich cultural tradition among the Aztec. \r\n\r\nIn all of Mesoamerican history, there had never been a civilization quite like the Aztec empire. Now, with modern archaeology and antique records, historical researchers the world over have managed to create a comprehensive profile of this remarkable society. The Aztec: The Last Great Civilization of Mesoamerica offers the reader an overview of what has been learned about this great empire, including some recently discovered facts and conclusions that have been drawn from ongoing research throughout a broad scholarly community",
  "parsed": {
    "xt": "urn:btih:3aa68e35a93046c77ede9a5152f6661a1f36212c",
    "dn": "The Aztec: The Last Great Civilization of Mesoamerica",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "3aa68e35a93046c77ede9a5152f6661a1f36212c",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        58,
        166,
        142,
        53,
        169,
        48,
        70,
        199,
        126,
        222,
        154,
        81,
        82,
        246,
        102,
        26,
        31,
        54,
        33,
        44
      ]
    },
    "name": "The Aztec: The Last Great Civilization of Mesoamerica",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 69,
  "peers": 23,
  "last_updated": "2016-12-24T22:32:47.183Z"
}