{
  "title": "HACKING Ultimate Beginners Guide Computer Hacking 2016 WWRG",
  "uid": 16043562,
  "size": 1015138,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:3b95d51f3d81ffd8128e19da259dc5ab4dd1c578&amp;dn=HACKING+Ultimate+Beginners+Guide+Computer+Hacking+2016+WWRG&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 159,
  "leechers": 64,
  "uploader": "Lion.King",
  "files": 6,
  "time": 1476538794,
  "description": "Publisher: CreateSpace Independent Publishing Platform (August 30, 2016)\r\nLanguage: English\r\nISBN-10: 1537369768\r\nISBN-13: 978-1537369761\r\n\r\n\r\nAre interested in getting into computer hacking or just hacking in general, but don't know where to start? Well today is your lucky day then, because reading this book will get your feet wet into the world of computer hacking, but won't overwhelm you at the same time. This is a beginner's guide that I created strictly for people like you to get introduced to the basics of what hacking is all about! This book contains very basic information on the ins and outs of beginner level hacking. There are many misconceptions and ideas that people have about the world of hacking, and you are going to learn a little bit about them. Hacking is an extremely complex activity that requires a lot of skills and knowledge. This book will give you a basic idea about what hacking is and how it can be done. In a world where no information is private, hacking is a useful tool. Itâ™s illegal in some cases but that depends on the way it is used. Hacking is only beneficial when you use it to make the world a better place. The final choice of what you will do with the information that is provided in this book is entirely up to you. Hacking is not easy. It will require a lot of time and patience in order to master it. There are many risks involved in hacking and you should consider them all before you start on your journey as a hacker. There are various kinds of hacking that are possible. You can easily hack someoneâ™s laptop or mobile phone if you have the requisite knowledge. This book will guide you on how to secure your own networks and also how to start with hacking basics such as figuring out a password",
  "parsed": {
    "xt": "urn:btih:3b95d51f3d81ffd8128e19da259dc5ab4dd1c578",
    "dn": "HACKING Ultimate Beginners Guide Computer Hacking 2016 WWRG",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "3b95d51f3d81ffd8128e19da259dc5ab4dd1c578",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        59,
        149,
        213,
        31,
        61,
        129,
        255,
        216,
        18,
        142,
        25,
        218,
        37,
        157,
        197,
        171,
        77,
        209,
        197,
        120
      ]
    },
    "name": "HACKING Ultimate Beginners Guide Computer Hacking 2016 WWRG",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 163,
  "peers": 251,
  "last_updated": "2016-12-26T21:49:15.152Z"
}