{
  "title": "CompTIA A+ Complete Study Guide (220-801), 2E [PDF]~StormRG~",
  "uid": 9523440,
  "size": 27371280,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:3bd190847b1e38fc2402e2087db6256e65b503e8&amp;dn=CompTIA+A%2B+Complete+Study+Guide+%28220-801%29%2C+2E+%5BPDF%5D%7EStormRG%7E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 72,
  "leechers": 3,
  "uploader": "steelballz",
  "files": -1,
  "time": 1390689871,
  "description": "Description\nCompTIA A+ Complete Study Guide Authorized Courseware, Second Edition\nAuthor: Quentin, Dulaney, Emmett, Skandier, Toby Docter\nPublished: October 30, 2012\nPublisher: Sybex; 2 edition\nISBN: 1118324064\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\n\nTested on the above readers with no problems on laptop and Android tablet.\nDon't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss. Please allow a couple\nseconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\nimage\nCover from actual book file\n\n\n\nBook Description\nPublication Date: October 30, 2012 | ISBN-10: 1118324064 | ISBN-13: 978-1118324066 | Edition: 2\nEverything you need to prepare for the CompTIA A+ exams\n\nCompTIA A+ is the most sought-after certification for PC technicians. This guide covers every aspect of the required exams 220-801 and 220-802. Fully updated to cover the latest best practices, current software and hardware, and mobile OSes, this Deluxe guide also includes an exclusive bonus CD featuring additional practice exams, flashcards, instructional videos, and the entire e-book in ePDF, eMobi, and ePub versions.\n\nIncludes a coupon for 10% Off CompTIA Certification Exams\nFully updated to cover the latest exams and exam objectives\nCovers personal computer components, laptops and portable devices, operating systems, printers and scanners, networks, security, safety and environmental issues, communication, and professionalism\nBonus CD features the Sybex Test Engine with additional practice exams, twice the electronic flashcards as the Standard edition, and eMobi, ePub, and ePDF versions of the book\n\nCompTIA A+ Complete Deluxe Study Guide, 2nd Edition is a complete test-prep guide that will help you pass the A+ exam with confidence.\n\nFrom the Back Cover\n\nIncludes Real-World Scenarios, Hands-On Exercises, and a Deluxe CD Featuring:\n\nCustom Test Engine with Eight Practice Exams\n\nHundreds of Sample Questions\n\nOver an Hour of Instructor-Led Videos on Key Topics\n\nElectronic Flashcards\n\nEntire Book in ePDF, Mobi, and ePub formats\n\nCompTIA Recommended Courseware for the A+ Exams\n\nPrepare for CompTIA A+ Exams 220-801 and 220-802 with this deluxe version of Sybex's popular CompTIA A+ Complete Study Guide, Second Edition. Revised and updated, this new book offers all the value of the regular study guide, but also includes a CD with eight practice exams, twice as many electronic flashcards, over an hour of author-led instructional videos on key topics, and the entire book in three different e-book formats. Start your A+ prep today with:\n\nFull coverage of all exam objectives in a systematic approach, so you can be confident you're getting the instruction you need for the exam\n\nReal-world scenarios that put what you've learned in the context of actual job roles\n\nOver an hour of author-led instructional videos on key topics\n\nMore than 400 electronic flashcards to give you extra practice\n\nChallenging review questions in each chapter to prepare you for exam day\n\nExam Essentials, a key feature in each chapter that identifies critical areas you must become proficient in before taking the exam\n\nFeatured on the CD-ROM\n\nSYBEX TEST ENGINE\n\nTest your knowledge with advanced testing software. Includes all chapter review questions and eight practice exams.\n\nELECTRONIC FLASHCARDS\n\nReinforce your understanding with over 400 electronic flashcards.\n\nINSTRUCTIONAL VIDEO\n\nLearn how to perform key tasks with over an hour of instructional video from the authors.\n\nAlso on the CD, you'll find the entire book in ePDF, Mobi, and ePub formats.\n\n\nimage\nScientia est potentia",
  "parsed": {
    "xt": "urn:btih:3bd190847b1e38fc2402e2087db6256e65b503e8",
    "dn": "CompTIA A  Complete Study Guide (220-801), 2E [PDF]~StormRG~",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "3bd190847b1e38fc2402e2087db6256e65b503e8",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        59,
        209,
        144,
        132,
        123,
        30,
        56,
        252,
        36,
        2,
        226,
        8,
        125,
        182,
        37,
        110,
        101,
        181,
        3,
        232
      ]
    },
    "name": "CompTIA A  Complete Study Guide (220-801), 2E [PDF]~StormRG~",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 75,
  "peers": 19,
  "last_updated": "2016-12-24T22:40:20.821Z"
}