{"title":"Mastering Autodesk Revit MEP 2015 [PDF] [StormRG]","uid":10643074,"size":25508492,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3c704c176d64c45688ed136c1291d8ce9b6cd3e2&amp;dn=Mastering+Autodesk+Revit+MEP+2015+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":40,"leechers":0,"uploader":"steelballz","files":-1,"time":1406504092,"description":"Description\nMastering Autodesk Revit MEP 2015\nAuthor:Bokmiller, Don, Whitbread, Simon, Morrison, Daniel\nPublisher and Published Date:Sybex (June 23 2014)\nISBN-10:1118871154\nISBN-13:9781118871157\nFormat: Retail PDF\nReader Required: Adobe Acrobat\n\n\nDon't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss. Please allow a couple\nseconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\nIt should also be noted that any reference to any dvd, cd, or any other dlc or extra content in this, or any other torrent I upload, is not available in the torrent unless I state otherwise. If you want the extras, buy the product\nThis PDF is encrypted! This encryption will NOT interfere with opening, printing, or copying the PDF. It will only prevent editing of the PDF. I have my reasons for it. If you have questions pm me through my acct on KAT\nIf you do have difficulties opening this file while running a Linux OS, try opening in windows or mac using Adobe Acrobat. If you still can't open, pm me and I'll investigate.\n\n\nimage\nCover from actual book file\n\n\nProduct Description\n\nThe definitive guide to Autodesk Revit MEP\n\nThe expert author team for this Autodesk Official Press book has employed their years of experience to develop this exhaustive reference and tutorial, which is perfectly paced to cover all the core concepts and functionality of Revit MEP including:\n\nNavigating the interface\nProject setup and templates\nWorksharing\nMechanical concerns such as building loads and ductwork\nElectrical concerns such as lighting and communications outlets\nPlumbing concerns such as fixtures and water systems\n\nThis revision covers all of Revit MEP's new features and includes more advanced electrical and plumbing information. In addition, the book features real-world sidebars and hands-on tutorials that reinforce the detailed discussions, along with downloadable before-and-after tutorial files to help you complete the hands-on projects. This Autodesk Official Press book is the perfect resource for becoming a Revit MEP expert.\n\nFrom the Back Cover\n\nBecome an Autodesk Revit MEP 2015 Expert\n\nPerfectly paced and covering all the core concepts and functionality of Autodesk Revit MEP 2015, this complete reference helps you master project set-up and templates, create logical air, water, and fire protection systems, evaluate building loads, and more. If you need to quickly learn Revit MEP 2015, the discussions and real-world tutorials in this book are the ideal resources to get you up to speed.\n\nLoaded with tips, tricks, and exercises that reinforce the detailed discussions, this fully updated edition also gives you access to a companion website where you can download before-and-after tutorial files to compare your finished work to projects completed by professionals.\n\nCoverage includes:\n\nCreating and using project templates\nImproving efficiency with worksharing and collaboration\nGenerating schedules that show quantities, materials, and design dependencies\nImporting and exporting gbXML\nLighting, power receptacles, and equipment\nGenerating and modeling content\nMaking sense of more advanced electrical and plumbing information\nCreating and managing systems to get Autodesk Revit MEP 2015 to work for you\nReducing time spent on drafting tasks with symbols and annotations\nUtilizing the Detail Line button to draw linework that is specific to the view in which it is created\n\nGrasp the Newest Features of Autodesk Revit MEP 2015\n\nBuild Loads and Ductwork with Confidence and Ease\n\nPlace Air and Water Distribution Equipment Correctly\n\nCreate Water Systems, Plumbing Fixtures, and Their Connectors\n\nUse Symbols and Create Equipment, Fixtures, and Devices\nAbout the Author\n\nDon Bokmiller is a Design Technologist at Clark Nexsen, Inc. He has 17 years of experience working in the AEC industry and is a frequent speaker at the Revit Technology Conference (RTC) events in North America.\n\nSimon Whitbread has over 25 years of experience in the construction industry, has taught Revit to students of all experience levels, and is a committee member for RTC.\n\nDan Morrison has over 20 years experience as a mechanical engineer and has presented at numerous RTCs and other BIM conferences; he is VDC engineer with BGC Posco international in Perth, Australia, managing all aspects of BIM from design through handover.\n\n\nimage\nScientia est potentia\n","torrent":{"xt":"urn:btih:3c704c176d64c45688ed136c1291d8ce9b6cd3e2","amp;dn":"Mastering+Autodesk+Revit+MEP+2015+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c704c176d64c45688ed136c1291d8ce9b6cd3e2","infoHashBuffer":{"type":"Buffer","data":[60,112,76,23,109,100,196,86,136,237,19,108,18,145,216,206,155,108,211,226]},"announce":[],"urlList":[]}}