{
  "title": "HuniePop Valentine's Day Update v1.2.0",
  "uid": 11743460,
  "size": 702693998,
  "categoryP": "porn",
  "categoryS": "games",
  "magnet": "?xt=urn:btih:3c850d435cd57bbc8220be841286ceb79a272774&amp;dn=HuniePop+Valentine%27s+Day+Update+v1.2.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 370,
  "leechers": 16,
  "uploader": "dauphong",
  "files": 1,
  "time": 1425890527,
  "description": "Valentine's Day Update Is Live! (v1.2.0)\nHey guys! Let your significant other know you''ve got better things to do tomorrow because HuniePop''s Valentine''s Day update is now live!\n\nHere are the details of this update (SPOILERS Ahead):\nEnding Scene: HuniePop is decidedly not a story heavy game, but some players felt a little disoriented at the end; wondering if they had &quot;beaten&quot; the game. So we put together a short conclusion scene between Kyu and the player, just for closure. For players that have already completed the game, you can access this scene by spending the night with Venus one more time. Kyu will visit you the following morning.\n\n100% Completion Changes: We have implemented a few changes that begin to take effect after the player has witnessed the ending scene. These changes will help make getting to a 100% completion rate less of a grind.\nYou will be able to buy girls'' collection items directly from their collection screen, but at a steep Hunie cost.\nYou will be able to choose which date location to go to with girls that you have already spent the night with.\nThe chance of getting a &quot;learn a detail&quot; question when talking with her will double for girls you have already spent the night with.\n\nAlpha Mode: We have added a new post-game feature called &quot;Alpha Mode&quot;. Alpha mode is sort of like an endless freeplay mode. You will be locked into the &quot;Hard&quot; difficulty setting and each date you go on will be progressively more difficult, indefinitely. The challenge is to see how many Alpha mode dates you can get through. To activate Alpha Mode you have to give Kyu each of the 12 pairs of panties, but you can only do this after you have witnessed the ending scene.\n\nSteam Achievements: As highly requested we''ve added 20 Steam Achievements to unlock; half progress and half challenge. The progress achievements will be unlocked retroactively. All you have to do to retroactively unlock is boot up the game and load into your save file. If you''d rather earn them from scratch simply start a new save file. (If your achievement descriptions say &quot;Locked For V-Day&quot; just restart Steam.)\n\nWe have completely re-done Kyu''s final CG photo, replacing the old one.\nYou can exchange the Tissue Box for a new special date gift that you can''t get any other way.\nIf you happen to have tossed away a pair of panties, you will now be able to re-earn them by spending the night with that girl again.\nYou now must also have spent the night with Kyu, in addition to the eight normal girls in order to unlock Venus.\nYour date''s bra will fall off halfway through the bedroom bonus round.\nA handful of game balance tweaks and a handful of minor bug fixes.\nVersion number and censored/uncensored flag added to title file load screen.\nIf you are playing on Steam, just download the latest game update (you may need to restart Steam for it to recognize there is an update to download). If you are playing the version purchased from either Humble or MangaGamer, all you have to do is go re-download the game from that respective service. Feel free to delete and replace your old game executable (and data folder if you are on Windows). You will not lose your save data as that is stored in a different location. \n\nRelease Date: 2015\nGenre: ADV, SLG, Puzzle, Fantasy, Yuri, Comedy, Fairy \nCensorship: None \nDeveloper / Publisher: huniepop, Mangagamer \nPlatform: PC / Windows 32bit / 64bit \nPublication Type: Original (licensed) \nLicense: Freeware \nVersion: Ver1.2.0 \nLanguage games: English \nVoice set Language: English",
  "parsed": {
    "xt": "urn:btih:3c850d435cd57bbc8220be841286ceb79a272774",
    "dn": "HuniePop Valentine's Day Update v1.2.0",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "3c850d435cd57bbc8220be841286ceb79a272774",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        60,
        133,
        13,
        67,
        92,
        213,
        123,
        188,
        130,
        32,
        190,
        132,
        18,
        134,
        206,
        183,
        154,
        39,
        39,
        116
      ]
    },
    "name": "HuniePop Valentine's Day Update v1.2.0",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 386,
  "peers": 50,
  "last_updated": "2016-12-24T22:44:37.962Z"
}