{"title":"Kyle Leon's Customized Fat Loss - Somanabolic Muscle Maximizer","uid":6503326,"size":52223723,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3e4836751a98f334eb7c1ffdd9810e7f4dd7dc85&amp;dn=Kyle+Leon%5C%27s+Customized+Fat+Loss+-+Somanabolic+Muscle+Maximizer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":56,"leechers":0,"uploader":"iamneo33","files":16,"time":1309337826,"description":"Muscle Building Tips To Build Muscle Without Fat From The Muscle Maximizer Kyle Leon \n\npreviously known as Lanky Leon, now supplement sponsored athlete, you\\'ll discover 3 advanced muscle building and bodybuilding techniques to get more muscle mass onto your body, without the ugly body fat that covers up your six pack abs. These unheard of muscle building tips, especially the second one, will help you build muscle and gain weight as fast as humanly possible week after week until you don\\'t recognize the body starring back at you in the mirror. After you watch the video, check out this brand new video from The Muscle Maximizer himself, Kyle Leon, who will explain the 3 BIGGEST mistakes you must address if you want to build muscle and gain weight WITHOUT getting fat and while keeping your ripped abs and six pack 365-days a year. Avoiding the mistakes in this video will ensure you gain new muscle size and improve your physique. \n\nThe Kyle Leon\\'s Somanabolic Muscle Maximizer reveals How to build muscle fast without fat. Get ripped, Get shredded and break through any muscle building plateau. The evolution of video sales letters has arrived! This proven system promises to pack-on muscle without fat and delivers with this amazingly unique, custom, interactive nutritional software\n\n-------------------------------------------------------------------\n\nNow I am not sure if this weight loss program works or not, I am going to give this a try...\n\nIf you try this program, please let me know the results here.  I will post my failure or sucess with this here as well.\n\nAgain if you have great success with this, please consider paying for this.\n\nThanks and good luck with your muscle building/weight loss...\n\nNeo... June 29, 2011\t","torrent":{"xt":"urn:btih:3e4836751a98f334eb7c1ffdd9810e7f4dd7dc85","amp;dn":"Kyle+Leon%5C%27s+Customized+Fat+Loss+-+Somanabolic+Muscle+Maximizer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e4836751a98f334eb7c1ffdd9810e7f4dd7dc85","infoHashBuffer":{"type":"Buffer","data":[62,72,54,117,26,152,243,52,235,124,31,253,217,129,14,127,77,215,220,133]},"announce":[],"urlList":[]}}