{"title":"Metallica - Kill Em All [remastered vinyl version 2008]","uid":11196396,"size":121721004,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3e5c2d45430935b245d64285aff451dbfb2503eb&amp;dn=+Metallica+-+Kill+Em+All+%5Bremastered+vinyl+version+2008%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":45,"leechers":4,"uploader":"analogkid6103","files":10,"time":1413095034,"description":"\nMetallica  is an American heavy metal band from Los Angeles, California, formed in 1981. Founded when drummer Lars Ulrich posted an advertisement in a local newspaper, Metallica's line-up has primarily consisted of Ulrich, rhythm guitarist and vocalist James Hetfield and lead guitarist Kirk Hammett, while going through a number of bassists. Currently, the spot is held by Robert Trujillo.\n\nMetallica's early releases included fast tempos, instrumentals, and aggressive musicianship that placed them as one of the &quot;big four&quot; of the thrash metal subgenre alongside Slayer, Megadeth, and Anthrax during the genre's development into a popular style.The band earned a growing fan base in the underground music community and critical acclaim, with the 1986 release Master of Puppets described as one of the most influential and &quot;heavy&quot;\nthrash metal albums. The band achieved substantial commercial success with Metallica (1991), which debuted at number one on the Billboard 200. With this release the band expanded its musical direction resulting in an album\nthat appealed to a more mainstream audience.\n\nIn 2000, Metallica was among several artists who filed a lawsuit against Napster for sharing the band's copyright-protected material for free without the band members' consent.A settlement was reached, and Napster became a pay-to-use service. Despite reaching number one on the Billboard 200, the release of St. Anger alienated\nmany fans with the exclusion of guitar solos and the &quot;steel-sounding&quot; snare drum. A film titled Some Kind of Monster documented the recording process of St. Anger.\n\nMetallica has released nine studio albums, two live albums, two EPs, twenty-four music videos, and forty five singles. The band has won nine Grammy Awards, and has had five consecutive albums debut at number one on the Billboard 200 , making Metallica the first band to do so, this record was later matched by the Dave Matthews Band. The band's 1991 album, Metallica, has sold over 15 million copies in the United States, and 22 million copies\nworldwide, which makes it the 25th-highest-selling album in the country.In December 2009, it became the highest-selling album of the SoundScan era, surpassing 1997's Come on Over by country artist Shania Twain.\n\nThe band has sold an estimated 100 million records worldwide as of the release of their latest album, Death Magnetic. As of December 2009,Metallica is the fourth highest-selling music artist since the SoundScan era began tracking sales on May 25, 1991, selling a total of 52,271,000 albums in the United States alone.\n\n\n\n\n`Kill 'Em All` [1983]  @320k\n[remastered vinyl version 2008]\n\n1. &quot;Hit the Lights&quot;   James Hetfield, Lars Ulrich, 4:16\n2. &quot;The Four Horsemen&quot;   James Hetfield, Lars Ulrich, Dave Mustaine 7:11\n3. &quot;Motorbreath&quot;   James Hetfield 3:08\n4. &quot;Jump in the Fire&quot;   James Hetfield, Lars Ulrich, Dave Mustaine 4:39\n5. &quot;(Anesthesia) Pulling Teeth&quot; (Instrumental) Cliff Burton 4:14\n6. &quot;Whiplash&quot;   James Hetfield, Lars Ulrich 4:10\n7. &quot;Phantom Lord&quot;   James Hetfield, Lars Ulrich, Dave Mustaine 4:57\n8. &quot;No Remorse&quot;   James Hetfield, Lars Ulrich 6:26\n9. &quot;Seek &amp; Destroy&quot;   James Hetfield, Lars Ulrich 6:53\n10. &quot;Metal Militia&quot;   James Hetfield, Lars Ulrich, Dave Mustaine 5:10\n\n\nIm shooting this one out for ya while I work on the other","torrent":{"xt":"urn:btih:3e5c2d45430935b245d64285aff451dbfb2503eb","amp;dn":"+Metallica+-+Kill+Em+All+%5Bremastered+vinyl+version+2008%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e5c2d45430935b245d64285aff451dbfb2503eb","infoHashBuffer":{"type":"Buffer","data":[62,92,45,69,67,9,53,178,69,214,66,133,175,244,81,219,251,37,3,235]},"announce":[],"urlList":[]}}