{"title":"peppa pig series 4 eps 1-13","uid":6440312,"size":554430464,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3e7f3554ce46cc029858050d76c1cf371fff9b00&amp;dn=peppa+pig+series+4+eps+1-13&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":58,"leechers":2,"uploader":"eeionn.","files":13,"time":1306958110,"description":"The first episodes of series 4 of Peppa pig.  These are all tv rips.  Thanks so much to the original uploaders.\n\n\n\n1 &quot;Potato City&quot; Peppa and her family visit a new theme park where there is lots of fun to be had with vegetables.\n\n2 &quot;The New House&quot; Peppa and George are taken to visit the home that Mr Bull is building. Will they find out who their new neighbours are?\n\n3 &quot;Basketball&quot; Daddy teaches the children how to play basketball, and it is not long before they are good enough to take on a team.\n\n4 &quot;Horsey Twinkle Toes&quot; There is much excitement when Mr Zebra delivers a package from Aunt Dottie for Peppa and George.\n\n5 &quot;Naughty Tortoise&quot; Dr Hamster's pet tortoise Tiddles gets stuck up a tree - who is going to come to the rescue?\n\n6 &quot;Mr Fox's Shop&quot; Peppa and George visit Mr Fox's Shop to buy Granny and Grandpa an anniversary present, but what will they choose?\n\n7 &quot;Shadows&quot; Peppa and George realise that they have shadows and no matter what they do, they can't escape from them.\n\n8 &quot;International Day&quot; Peppa and all her friends at playgroup dress up as different countries from all over the world.\n\n9 &quot;The Rainy Day Game&quot; Daddy teaches Peppa and George a fun game to play while they wait inside for the rain to stop.\n\n10 &quot;Mummy Rabbit's Bump&quot; Everyone is excited when Mummy Rabbit arrives with a big tummy and they learn that there is a baby bunny inside.They think of a name called Rosie &amp; Robbie\n\n11 &quot;Pedro the Cowboy&quot; Pedro Pony pretends he is a proper cowboy, telling everyone stories in the camp he has set up in the garden.\n\n12 &quot;Peppa and George's Garden&quot; Grandpa Pig pops round with some seeds for Peppa and George. Daddy Pig helps out by being a scarecrow.\n\n13 &quot;The Flying Vet&quot; Doctor Hamster is rushed off her feet when nearly all the animals need her help on the same day.","torrent":{"xt":"urn:btih:3e7f3554ce46cc029858050d76c1cf371fff9b00","amp;dn":"peppa+pig+series+4+eps+1-13","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e7f3554ce46cc029858050d76c1cf371fff9b00","infoHashBuffer":{"type":"Buffer","data":[62,127,53,84,206,70,204,2,152,88,5,13,118,193,207,55,31,255,155,0]},"announce":[],"urlList":[]}}