{
  "title": "Zbrush 4R6 -Reupload- [TheFoundry]",
  "uid": 8694049,
  "size": 766481756,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:3e96954ab6514c47bb2501e96e3734d1697d22d7&amp;dn=Zbrush+4R6+-Reupload-+%5BTheFoundry%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 137,
  "leechers": 5,
  "uploader": "onyxx1606",
  "files": -1,
  "time": 1373931300,
  "description": "ZBrush is a digital sculpting and painting program that has revolutionized the 3D industry with its powerful features and intuitive workflows. Built within an elegant interface, ZBrush offers the worldÎ“Ã‡Ã–s most advanced tools for todayÎ“Ã‡Ã–s digital artists. With an arsenal of features that have been developed with usability in mind, ZBrush creates a user experience that feels incredibly natural while simultaneously inspiring the artist within. With the ability to sculpt up to a billion polygons, ZBrush allows you to create limited only by your imagination.\n\nDesigned around a principle of circularity, the menus in ZBrush work together in a non-linear and mode-free method. This facilitates the interaction of 3D models, 2D images and 2.5D Pixols in new and unique ways.\n\nZBrush gives you all of the tools needed to quickly sketch out a 2D or 3D concept and then take that idea all the way to completion. You can create realistic renders directly in ZBrush with lighting and atmospheric effects. With the many powerful export options, you can easily prepare your model for 3D printing or use within any other digital application.\n\nBecause ZBrush users are enabled by its powerful software processing, you can sculpt and paint with millions of polygons with out having to worry about purchasing expensive graphics cards. It is for this reason why ZBrush is used by everyone from art enthusiast to major film and games studios.\n\nLeave technical hurdles and steep learning curves behind, as you sculpt and paint with familiar brushes and tools.\n------------------------------------------\n\nDownloading Torrents Like These Is ILLEGAL, Please if you enjoy the Zbrush, go and Purchase It",
  "parsed": {
    "xt": "urn:btih:3e96954ab6514c47bb2501e96e3734d1697d22d7",
    "dn": "Zbrush 4R6 -Reupload- [TheFoundry]",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "3e96954ab6514c47bb2501e96e3734d1697d22d7",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        62,
        150,
        149,
        74,
        182,
        81,
        76,
        71,
        187,
        37,
        1,
        233,
        110,
        55,
        52,
        209,
        105,
        125,
        34,
        215
      ]
    },
    "name": "Zbrush 4R6 -Reupload- [TheFoundry]",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 142,
  "peers": 128,
  "last_updated": "2016-12-24T22:58:47.212Z"
}