{"title":"The Science of Mindfulness: How Changing Your Brain Changes Your","uid":9540837,"size":24566179,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3eb6218560e630106bee00e9c3f9a2cf1f394a89&amp;dn=The+Science+of+Mindfulness%3A+How+Changing+Your+Brain+Changes+Your&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":37,"leechers":2,"uploader":"Dimhirwen","files":-1,"time":1391038454,"description":"The Science of Mindfulness: How Changing Your Brain Changes Your Life\n\n\nMP3 | avg. bitrate: 64kbps, Joint Stereo / 44100 hz\n\n\nI. Sampler description\n\nTo be mindful is to pay attention to whatever arises in the moment. Whether in response to thoughts, feelings, emotions, or bodily sensations, when we are present to our experience in an open and nonjudgmental way, we are practicing mindfulness. With The Science of Mindfulness, you will join five Sounds True authors for an introductory program exploring the ways that science has begun to validate what the world's wisdom traditions have said for centuries: mindfulness practice has the power to transform every facet of our lives.\n\nII. Track titles\n\n1. &quot;What Is Mindfulness?&quot; from Mindfulness for Beginners by Jon Kabat-Zinn\n\nThe teacher who brought mindfulness meditation into the mainstream of medicine and society describes the many benefits of daily practice.\n\n2. &quot;Mindfulness and the Brain&quot; from The Mindful Brain by Daniel J. Siegel, MD\n\nDr. Siegel explains the effects of mindfulness practice on our mental health and physiology.\n\n3. &quot;Happiness, Enlightenment, and the Brain&quot; from The Enlightened Brain by Rick Hanson, PhD\n\nWe know more about the brain today than ever before. Dr. Hanson discusses how we can use this knowledge to cultivate lasting experiences of happiness and fulfillment.\n\n4. &quot;The Perception of Separation&quot; from Meditation and Psychotherapy by Tara Brach, PhD\n\nTara Brach explains how the practice of mindfulness can help us break through the false sense of separation that so often leads to suffering.\n\n5. &quot;Mindfulness and the Experiencing Self&quot; from The Neuroscience of Change by Kelly McGonigal, PhD\n\nDr. McGonigal describes an alternative state of mind known as &quot;the experiencing self,&quot; a positive alternative to harmful default states that we can cultivate through practice.\n\n\n","torrent":{"xt":"urn:btih:3eb6218560e630106bee00e9c3f9a2cf1f394a89","amp;dn":"The+Science+of+Mindfulness%3A+How+Changing+Your+Brain+Changes+Your","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3eb6218560e630106bee00e9c3f9a2cf1f394a89","infoHashBuffer":{"type":"Buffer","data":[62,182,33,133,96,230,48,16,107,238,0,233,195,249,162,207,31,57,74,137]},"announce":[],"urlList":[]}}