{
  "title": "Propellerhead Reason 5 [CRACKED]",
  "uid": 6337121,
  "size": 2686524296,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:3eeea70dc648298f200bf3971a4e4672dbaae6f9&amp;dn=Propellerhead+Reason+5+%5BCRACKED%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 279,
  "leechers": 10,
  "uploader": "theLEAK",
  "files": 2,
  "time": 1303512916,
  "description": "Reason is a music software program developed by Swedish software developers Propellerhead Software. It emulates a rack of hardware synthesizers, samplers, signal processors, sequencers and mixers, all of which can be freely interconnected in an arbitrary manner. Reason can be used either as a complete virtual music studio, or as a collection of virtual instruments to be played live or used with other sequencing software.\n\nReason 5 was released on 25 August 2010. For the first time, Reason can directly sample audio with any of its sample-playing instruments such as the Redrum, the NN-19, the NN-XT, and the Kong Drum Designer.\n\nThe Dr. Rex loop player has been given an overhaul and is now called \\&quot;Dr. Octo Rex\\&quot; and can play up to eight sample loops (one at a time), and includes many new features for editing the loops and individual clips.\n\nNew to the program is the \\&quot;Kong Drum Designer,\\&quot; a 16-pad device that can create drum and percussion sounds using various sound production techniques, including physical modeling, sample playback (the \\&quot;NN-Nano\\&quot; module), and virtual analog synthesis.\n\nSignature Patches created by well known Reason users have been added, including patches made by Two Lone Swordsmen, Vengeance and Richard Barbieri.\n\nFinally, a new pattern editing tool called \\&quot;Blocks\\&quot; has been created for easier song arrangement and mixing.\n\n\n\nInstructions:\n\n1) Extract using WinRar\n2) Mount and install using Daemon Tools or any other disk image emulator\n3) Do not run or open Reason 5 when the installation is finsihed\n4) Open Reason keygen and select \\&quot;v5\\&quot;\n5) Generate and copy serial number\n6) Open Reason 5 and paste the serial number\n7) Enjoy!\n\n\n\nAny problem during or after the installation, comment below.\n\n-theLEAK team\t\t",
  "parsed": {
    "xt": "urn:btih:3eeea70dc648298f200bf3971a4e4672dbaae6f9",
    "dn": "Propellerhead Reason 5 [CRACKED]",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "3eeea70dc648298f200bf3971a4e4672dbaae6f9",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        62,
        238,
        167,
        13,
        198,
        72,
        41,
        143,
        32,
        11,
        243,
        151,
        26,
        78,
        70,
        114,
        219,
        170,
        230,
        249
      ]
    },
    "name": "Propellerhead Reason 5 [CRACKED]",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 289,
  "peers": 120,
  "last_updated": "2016-12-24T23:01:09.779Z"
}