{
  "title": "STEPHEN KING ~ [Bill Hodges Trilogy  03] - End of Watch",
  "uid": 15633965,
  "size": 375901362,
  "categoryP": "audio",
  "categoryS": "audio_books",
  "magnet": "?xt=urn:btih:3f6581ffa1c70bdb055b34612830549976d70126&amp;dn=STEPHEN+KING+%7E+%5BBill+Hodges+Trilogy++03%5D+-+End+of+Watch&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 37,
  "leechers": 0,
  "uploader": null,
  "files": 118,
  "time": 1471974609,
  "description": "General Information\r\n===============\r\nBook........................End Of Watch\r\nSeries Name............Bill Hodges Trilogy\r\nSeries No.................03\r\nAuthor......................Stephen King\r\nNarrator...................Will Paton\r\nUnabridged..............Yes\r\nGenre.......................Crime Thriller\r\nPublisher..................Hodder &amp; Stoughton\r\n\r\nFile Information\r\n============\r\nSource.....................eDownloaded 64 Kb File\r\n# of MP3 files.........113 Chapterised Files\r\nTotal Runtime.........12 Hours 55 Minutes\r\nEncoder...................Lame 3.99r\r\nConverted to...........64 Kb | CBR | 44,100 Hz | Mono\r\nTotal Size................357 MB\r\nConverted By..........OldScotsman\r\nDate Converted......7-June 2016\r\nID3 Tags..................Includes Image and all info shown on this page (Smart Phone Ready)\r\n\t\t\t\t\r\nABOUT THE BOOK\r\nBrady Hartsfield, perpetrator of the Mercedes Massacre, where eight people were killed and many more were badly injured, has been in the Traumatic Brain Injury Clinic for five years, in a vegetative state. According to his doctors, anything approaching a complete recovery is unlikely. But behind the drool and stare, Brady is awake, and in possession of deadly new powers that allow him to wreak unimaginable havoc without ever leaving his hospital room.\r\nRetired police detective Bill Hodges, the unlikely hero of Mr. Mercedes and Finders Keepers, now runs an investigation agency with his partner, Holly Gibney, who delivered the blow to Hartsfield's head that put him on the brain injury ward. Brady also remembers that. When Bill and Holly are called to a murder-suicide with ties to the Mercedes Massacre, they find themselves pulled into their most dangerous case yet, one that will put not only their lives at risk, but those of Hodges’s friend Jerome Robinson and his teenage sister, Barbara. Because Brady Hartsfield is back, and planning revenge not just on Bill Hodges and his friends, but on an entire city.\r\n\r\nABOUT THE AUTHOR\r\nStephen Edwin King is of Scot-Irish ancestry, was born in Portland, Maine in 1947. He attended the grammar school in Durham and then Lisbon Falls High School. From his sophomore year at the University of Maine at Orono, he wrote a weekly column for the school newspaper. He was also active in student politics, arriving at his stance that the war in Vietnam was unconstitutional. He graduated in 1970, with a B.A. in English and qualified to teach on the high school level.\r\nHe and Tabitha Spruce married in January of 1971. Stephen made his first professional short story sale ('The Glass Floor') to Startling Mystery Stories in 1967. Throughout the early years of his marriage, he continued to sell stories to men's magazines. Many of these were later gathered into the Night Shift collection.\r\nIn the fall of 1971, Stephen began teaching high school English classes at Hampden Academy. Then, in the spring of 1973, his novel Carrie was accepted for publication. This was followed by 'Salem's Lot. The following year, the Kings left Maine for Boulder, Colorado, where Stephen wrote The Shining. Returning to a home in the Lakes Region of western Maine, Stephen finished The Stand and The Dead Zone.\r\nIn 1977, the Kings spent three months in England. He and his wife now spend winters in Florida, and the remainder of the year in their Bangor and Lovell homes in Maine. Stephen King has written more than fifty books, all of them worldwide bestsellers. His acclaimed novels and short story collections include Carrie, The Shining, The Stand, Misery and 11.22.63. He is also the author of The Dark Tower fantasy series and a wonderful non-fiction book: On Writing: A Memoir of the Craft.\r\n\r\nABOUT THE READER\r\nWill Patton (born June 14, 1954) is an American actor. He is one of the more recognized character actors in Hollywood, appearing in numerous movies over the last 10 years.\r\nPatton was born in Charleston, South Carolina, the eldest son of a Lutheran minister. He attended the North Carolina School of the Arts and The Actors Studio and won two Obie Awards for best actor for his performances in Sam Shepard's play Fool for Love and the Public Theatre production of What Did He See?. He was nominated for the Saturn Award for Best Supporting Actor for his portrayal of General Bethlehem in The Postman. He also portrayed Coach Bill Yoast in Remember the Titans. Patton recently provided the voice for the audio version of The Assault on Reason by Al Gore",
  "parsed": {
    "xt": "urn:btih:3f6581ffa1c70bdb055b34612830549976d70126",
    "dn": "STEPHEN KING ~ [Bill Hodges Trilogy  03] - End of Watch",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "3f6581ffa1c70bdb055b34612830549976d70126",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        63,
        101,
        129,
        255,
        161,
        199,
        11,
        219,
        5,
        91,
        52,
        97,
        40,
        48,
        84,
        153,
        118,
        215,
        1,
        38
      ]
    },
    "name": "STEPHEN KING ~ [Bill Hodges Trilogy  03] - End of Watch",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 37,
  "peers": 161,
  "last_updated": "2016-12-24T23:03:50.500Z"
}