{"title":"Empire: Total War 1.6 Incl All DLC","uid":5661729,"size":14533254403,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4088fbdc88836e2c8d46a7cfb16a8951d26660a9&amp;dn=Empire%3A+Total+War+1.6+Incl+All+DLC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":42,"leechers":21,"uploader":"tranceg","files":43,"time":1277998885,"description":"FOR THE WARPATH CAMPAIGN, USE THE LAST STEP HERE, NOT THE LAST STEP IN TORRENT\n\nFOR THE WARPATH CAMPAIGN, USE THE LAST STEP HERE, NOT THE LAST STEP IN TORRENT\n\nFOR THE WARPATH CAMPAIGN, USE THE LAST STEP HERE, NOT THE LAST STEP IN TORRENT\n\nFOR THE WARPATH CAMPAIGN, USE THE LAST STEP HERE, NOT THE LAST STEP IN TORRENT\n\nFOR THE WARPATH CAMPAIGN, USE THE LAST STEP HERE, NOT THE LAST STEP IN TORRENT\n\n\n\nDisclaimer: The contents of this torrent were originally created by Razor1911 and\nTanauser, as such all nfo files were left in tact, while some folder names were\nchanged. I created none of the patches, all I have done is compiled the\ninstructions and all required files in a neatly packaged torrent as I found it\nrather difficult to gather the required files and instructions for this particular\ngame. I do not condone piracy, and I strongly urge you to purchase this game if\nyou enjoy it. I however do believe in being able to FULLY test a game before I\npurchase it, without time limitations, or &quot;demo&quot; versions that do not show the\nfull extent of the game. Once again, don't be cheap, if you like the game,\nPURCHASE IT. Without your purchase, the software developers cannot continue to\nmake games, as it is un-profitable.\n\nNow for the instructions :D\n\n1.) Mount the first dvd located in the Game folder in some sort of software that\n    is capable of this (I recommend Daemon Tools Lite).\n\n2.) Run the setup.exe file located in the first dvd.\n\n3.) Proceed through the install process, it will ask you for the locations of a\n    few files, proceed to direct it to the file located in the root of the first\n    dvd you mounted, until it asks for the file named &quot;disc2_0.sid&quot;, or similar.\n    Once it asks for this file, you will need to mount the second dvd, and\n    proceed as you did for the first dvd. Once the installation is done, it will\n    simply close abruptly, don't worry, it installed fine.\n\t\n4.) Copy the contents of the folder named &quot;1&quot; in the crack dir to the install dir.\n\t\n5.) Copy rzr-etw8.exe from the folder named &quot;2&quot; to the install dir and run it.\n\t\n6.) Copy the files from the razor1911 folder inside of the folder named &quot;2&quot; to\n    the install dir.\n\n7.) Repeat steps 5 and 6 for folders 3 and 4, replacing &quot;rzr-etw8.exe&quot; with the\n    similarly named executable in each of these two folders.\n\n8.) Delete the rzr-*.exe files from the installation dir, as they are no longer\n    needed.\n\n9.) Copy the contents of the folder named &quot;5&quot; in the crack dir to the\n    installation dir.\n\n10.) Run install.redist.cmd from the install dir.\n\n11.) OPTIONAL: If you would like the warpath campaign, COPY the natives folder\n     inside of the installation folder\\data\\campaigns to the main installation \n     directory.\n\t \nAll files were scanned with Malwarebytes' Anti-Malware fully updated, run-time and\nscan-time as of 7/1/2010 9:24 AM EST, however I recommend you scan the files\nyourself, as the definitions may have been updated to find new malware, and as I\ndid not create the files, I cannot guarantee they don't contain any malware.","torrent":{"xt":"urn:btih:4088fbdc88836e2c8d46a7cfb16a8951d26660a9","amp;dn":"Empire%3A+Total+War+1.6+Incl+All+DLC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4088fbdc88836e2c8d46a7cfb16a8951d26660a9","infoHashBuffer":{"type":"Buffer","data":[64,136,251,220,136,131,110,44,141,70,167,207,177,106,137,81,210,102,96,169]},"announce":[],"urlList":[]}}