{
  "title": "Castles - Their Construction and History (gnv64)",
  "uid": 15577904,
  "size": 30548711,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:421c38cf6fa240fc3eeba49083010500fa0fb5bc&amp;dn=Castles+-+Their+Construction+and+History+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 58,
  "leechers": 5,
  "uploader": "gnv65",
  "files": 5,
  "time": 1471365295,
  "description": "Castles - Their Construction and History\r\nBy Sidney Toy\r\nDover Publications | December 1985 | ISBN-10: 0486248984 | 256 Pages | scanned PDF | 28.9 mb\r\n\r\nThe art of fortification had reached a high state of development even at the dawn of history. Powerful military works, dating from the remotest periods, have been found in Asia Minor, in Greece, and in the basins of the Tigris, the Euphrates, and the Nile rivers. The medieval castle, with its strategic, crenellated ramparts and aura of legend and romance, represents perhaps the most familiar form of a long-crucial art.\r\nThis concise, scholarly volume traces the history of the castle from its ancient roots in the Levant, through Roman times and the Middle Ages, to the fanciful chateaux of the sixteenth century. Profusely illustrated with nearly 200 photographs, floor-plan diagrams, and pen-and-ink renderings, Castles explores innovations in castle design, siege operations, artillery, and other weapons, living conditions within the castle, and clearly explains intriguing features of construction: moats, baileys, keeps, donjons, barbicans, double curtains, loopholes, and many others.\r\nIn addition, noted historian and fortification expert Sidney Toy takes the reader on a detailed guided tour of over 120 of the most famous castles and fortresses of Europe and the Middle East. Explore Caernarvon Castle (associated with the Princes of Wales), Dover Castle, Arundel Castle, Hadrian's Wall, the Tower of London, the famed city of Troy, and dozens of others in vivid accounts focusing on the architecture, offensive and defensive modifications, and historical importance of each structure or site.\r\nCastle enthusiasts, medievalists, military buffs, travelers, and anyone interested in the evolution and development of the castle will find this meticulously researched overview an informative and absorbing account.\r\n\r\nCONTENTS\r\nPreface xiii\r\nI. The Ancient Fortresses of Babylon, Mesopotamia, Assyria, Asia Minor and Greece i\r\nII. Fortifications of Greece and Rome, 300 B.C. to 200 b.g. 16\r\nIII. Fortifications of the Levant, Rome, and Western Europe, 200 B.C. to 30 B.C. 21\r\nIV. Fortifications of the Roman Empire 29\r\nV. Byzantine Fortifications from the Fifth to the Tenth Century 41\r\nVI. Fortifications of Western Europe from the Fifth to the Eleventh Century 50\r\nVII. Rectangular Keeps or Donjons 66\r\nVIII. Byzantine and Saracen Fortifications of the Twelfth Century 83\r\nIX. Transitional Keeps of the Twelfth Century 90\r\nX. Fortifications and Buildings of the Bailey in the Eleventh and Twelfth Centuries 100\r\nXL Castles from about 1 190 to 1270 116\r\nXII. Siege Engines and Siege Operations of the Middle Ages 141\r\nXIII. Edwardian and Contemporary Castles 153\r\nXIV. Towns, Fortified Bridges, and Towers 170\r\nXV. Gatehouses and Defences of the Curtain during the Thirteenth and Fourteenth Centuries 189\r\nXVI. Development of the Tower-House 210\r\nXVII. Sixteenth-Century Forts 230\r\nIndex 237\r\n \nhttps://s4.postimg.io/wig46do8t/Castles_Their_Construction_and_History.jpg",
  "parsed": {
    "xt": "urn:btih:421c38cf6fa240fc3eeba49083010500fa0fb5bc",
    "dn": "Castles - Their Construction and History (gnv64)",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "421c38cf6fa240fc3eeba49083010500fa0fb5bc",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        66,
        28,
        56,
        207,
        111,
        162,
        64,
        252,
        62,
        235,
        164,
        144,
        131,
        1,
        5,
        0,
        250,
        15,
        181,
        188
      ]
    },
    "name": "Castles - Their Construction and History (gnv64)",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 62,
  "peers": 58,
  "last_updated": "2016-12-26T22:30:53.898Z"
}