{
  "title": "Deus.Ex.Human.Revolution.Directors.Cut-RELOADED",
  "uid": 9086137,
  "size": 19121118661,
  "categoryP": "games",
  "categoryS": "pc",
  "magnet": "?xt=urn:btih:421e15bbe8cb4419515604cf2d2f3fca68d65f1b&amp;dn=Deus.Ex.Human.Revolution.Directors.Cut-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 89,
  "leechers": 50,
  "uploader": "Mr.Stifmeister",
  "files": 2,
  "time": 1382493934,
  "description": "\nnERv\n\nDeus Ex: Human Revolution - Director's Cut (c) SQUARE ENIX, Eidos Interactive\n\n10/2013 :..... RELEASE.DATE .. PROTECTION .......: STEAM\n1 :.......... DISC(S) .. GAME.TYPE ........: Action, RPG\n\nYou play Adam Jensen, an ex-SWAT specialist who's been handpicked to oversee\nthe defensive needs of one of America's most experimental biotechnology\nfirms. Your job is to safeguard company secrets, but when a black ops team\nbreaks in and kills the very scientists you were hired to protect,\neverything you thought you knew about your job changes\n\nKey Features\n- A divided near-future: discover a time of great technological advancement,\nbut also a time of chaos and conspiracy. Mechanical augmentations of the\nhuman body have divided society between those who can afford them, and\nthose who cant. Opposing forces conspire from the shadow to control the\ndestiny of mankind: a human revolution is coming.\n- A perfect mix of action and role-play: the game uniquely combines action\npacked close-quarters takedowns with intense shooting, offering a vast\narray of character augmentations and upgrades for the many weapons at your\ndisposal. Unlock new abilities and increase your stealth, social, hacking\nor combat skills: the game rewards all styles of play and approaches\nDetermine how you want your character to evolve, based on how you want to\nplay the game.\n- Choices and consequences: shoot your way through the enemies, sneak up\nbehind them without being traced, hack systems to retrieve crucial\ninformation, or use your social skills to extract information from key\ncharacters there are always choices, multiple approaches, multiple paths\nand multiple tools at your disposal including the Intel Screen Control for\na more immersive user experience. Choose your playing style and face the\nconsequences of your actions: you decide how the story unfolds in his\nenhanced storyline featuring the full integration of &quot;The Missing Link\nand &quot;Tongs Mission&quot;. Find more ways to defeat the new and improved Boss\nFights, use the Newgame feature to replay the story with your previously\nacquired augmentations. Learn more about the game with the developers\ncommentaries in ENGLISH ONLY and the original &quot;Making of&quot;video\n\n1. Unrar\n2. Burn or mount the image\n3. Install the game.\n4. Copy over the cracked content from the /Crack directory on the image to\nyour game install directory\n5. Play the game\n6. Support the software developers. If you like this game, BUY IT\n\n",
  "parsed": {
    "xt": "urn:btih:421e15bbe8cb4419515604cf2d2f3fca68d65f1b",
    "dn": "Deus.Ex.Human.Revolution.Directors.Cut-RELOADED",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "421e15bbe8cb4419515604cf2d2f3fca68d65f1b",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        66,
        30,
        21,
        187,
        232,
        203,
        68,
        25,
        81,
        86,
        4,
        207,
        45,
        47,
        63,
        202,
        104,
        214,
        95,
        27
      ]
    },
    "name": "Deus.Ex.Human.Revolution.Directors.Cut-RELOADED",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 139,
  "peers": 28,
  "last_updated": "2016-12-24T23:20:50.601Z"
}