{
  "title": "The Penguin Book of Norse Myths (2011) edited by Crossley",
  "uid": 15852333,
  "size": 4066460,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:42433e17e067e1adddd45987cb917c63eb83d996&amp;dn=The+Penguin+Book+of+Norse+Myths+%282011%29+edited+by+Crossley&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 36,
  "leechers": 0,
  "uploader": "BanchMon2",
  "files": 2,
  "time": 1474172234,
  "description": "The Penguin Book of Norse Myths, edited by Kevin Crossley-Holland\r\nPaperback: 320 pages\r\n Publisher: Penguin UK (May 24, 2011)\r\n Language: English\r\n ISBN-10: 0241953219\r\n ISBN-13: 978-0241953211\r\n Format: ePub, Mobi\r\n\r\n Dramatic, compelling and comprehensive - the great cycle of Norse myths are retold for the modern reader in The Penguin Book of Norse Myths by Kevin Crossley-Holland. 'Burning ice, biting flame; that is how life begins' The extraordinary Scandinavian myth cycle is one of the most enduring, exciting, dramatic and compelling of the world's great stories. A series of intertwined tales which together form a strange and fantastical world teeming with gods and goddesses, heroes and monsters, battles and couplings, the Norse myths are as exciting to read as they are of vast cultural and historical importance. Taking us from the creation of the world through the building of Asgard's Wall to the final end in Ragnorak, and featuring the exploits and adventures of such legendary figures as Odin, Thor and Loki, The Penguin Book of the Norse Myths brings alive the passion, cruelty and heroism of these unforgettable stories. 'Stately or bucolic, heroic or comic, romantic or gross, horrific or gentle, deeply ironic or deeply moving, the myths here retold yield up their mood and substance'The Times Literary Supplement 'A collection of dramatic, moving, intricately structured stories ... a scholarly survey and compendium of Norse mythology ... a sustained poem distinguished by the icy precision of its language' The Times Educational Supplement Kevin Crossley-Holland is an eminent poet, translator and prize-winning children's author. His translations of Old English poetry are brought together in The Anglo-Saxon World, and he has also translated The Exeter Book Riddles for Penguin Classics. Among his many publications are eight volumes of poetry, various anthologies, including The Oxford Book of Travel Verse and Folk Tales of the British Isles, as well as two operas, a play and a memoir. He was previously Gregory Fellow in Poetry at the University of Leeds, editorial director of Victor Gollancz, Lecturer in Anglo-Saxon Literature and Culture for the Tufts University London program, Fulbright Visiting Scholar at St Olaf College and Endowed Chair in the Humanities and Fine Arts at the University of St Thomas. He is a fellow of the Royal Society of Literature and lives in Norfolk",
  "parsed": {
    "xt": "urn:btih:42433e17e067e1adddd45987cb917c63eb83d996",
    "dn": "The Penguin Book of Norse Myths (2011) edited by Crossley",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "42433e17e067e1adddd45987cb917c63eb83d996",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        66,
        67,
        62,
        23,
        224,
        103,
        225,
        173,
        221,
        212,
        89,
        135,
        203,
        145,
        124,
        99,
        235,
        131,
        217,
        150
      ]
    },
    "name": "The Penguin Book of Norse Myths (2011) edited by Crossley",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 20,
  "peers": 21,
  "last_updated": "2016-12-26T22:31:44.106Z"
}