{"title":"Taoist Breathing for Tai Chi and Meditation: 24 Exercises to Red","uid":9092287,"size":42545372,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:43ddd77e0b13b738b1834d544054625fe401a8e1&amp;dn=Taoist+Breathing+for+Tai+Chi+and+Meditation%3A+24+Exercises+to+Red&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":128,"leechers":5,"uploader":"acer47x","files":-1,"time":1382623816,"description":"Breathing can transform your life and make you a healthier, more relaxed human being. Dr. Bruce Frantzis has developed a Longevity Breathing program from traditional Taoist breathing methods to help you improve lung capacity, massage your internal organs, and relax your nerves with each breath.\n\nProgression of 24 Sessions\nBruce Frantzis leads you through a progression of 24 sessions that help you extend the length of your breath and fully bring oxygen to the back and sides of your lungs, areas rarely engaged by shallow breathers.\n\nCD-1 teaches you to feel your breath and avoid holding your breath. Next, you learn how to inhale into different parts of your body to strengthen and massage your internal organs and spine. In CD-2, Dr. Frantzis takes you further by teaching you how to lengthen your breath. Taoist breathing techniques enable you to become aware of your emotions and deepen your meditative focus.\n\nThis CD set is a companion to the breathing lessons in the TAO Meditation series: Relaxing into Your Being, The Great Stillness and TAO of Letting Go.","torrent":{"xt":"urn:btih:43ddd77e0b13b738b1834d544054625fe401a8e1","amp;dn":"Taoist+Breathing+for+Tai+Chi+and+Meditation%3A+24+Exercises+to+Red","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43ddd77e0b13b738b1834d544054625fe401a8e1","infoHashBuffer":{"type":"Buffer","data":[67,221,215,126,11,19,183,56,177,131,77,84,64,84,98,95,228,1,168,225]},"announce":[],"urlList":[]}}