{
  "title": "Adobe.InDesign.CC.2015.11.0.072.incl.keygen.MacOSX.DeGun",
  "uid": 12038290,
  "size": 578164766,
  "categoryP": "applications",
  "categoryS": "mac",
  "magnet": "?xt=urn:btih:4713c842ad696bccd3f0ae06698430eebb2d1fc7&amp;dn=Adobe.InDesign.CC.2015.11.0.072.incl.keygen.MacOSX.DeGun&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 56,
  "leechers": 4,
  "uploader": "DeGun",
  "files": 60,
  "time": 1434725301,
  "description": "Drag and drop in tables. Because every keystroke matters. \n\n\nAdobe InDesign CC 2014 software provides precise control over typography and built-in creative tools for designing, preflighting, and publishing documents for print, online, or to mobile devices. Include interactivity, animation, video, and sound in page layouts to fully engage readers.\nSimplified table: Now you can move the columns and rows in the table, simply by dragging them.\n\nFixed Layout EPUB: Create a book in EPUB format with interactive text - children's books, recipe books, guides and tutorials - bright illustrations and photographs, c audio, video or animation. \nLayout and design of pages always remain the same regardless of the size of the screen on which the material is viewed.\n\nConvenient update process: Now when you upgrade to new versions of InDesign and install all styles, including keyboard shortcuts and workspaces, remain unchanged.\n\nColor Groups: Color samples can now be organized into folders for quick selection of a desired color folders with similar paragraph styles.\n\nIntegration with Behance: Save your work directly from the InDesign when Behance, to showcase their finished projects, or publish those working on. As the completion of the project and download the new version immediately receive feedback on their work from other designers from around the world.\n\nScaling effects: Any effects, such as shadows or gradient overlay shading will be automatically scaled when zooming an object or text to which they are applied.\n\nAdvanced Search: Now when you search for text, glyphs or GREP expressions, you can search not only forward but also backward using the appropriate buttons.\n\nSupport for display of high-resolution objects: In addition to supporting high resolution display objects for Mac computers with displays Retina, that InDesign is also optimized for use on a PC with Windows displays HiDPI.\n\nImproved create footnotes: Supported footnotes wrapping text from a text frame and external elements of the page.\n\nImproved creation of QR-code: Now when you merge data is not required to manually create unique QR-code. With this new function, the entire process of creating a code automatically.\n\nImproved package files: In addition to files INDD, related files and fonts when creating the package in InDesign, you can include PDF files and IDML. This helps ensure that your document will be able to open and view the users of different versions of this application.\n\nTransit Print PDF: Submit their documents to print directly on the device with a mechanism PDF Print Engine, without needing to convert the file to PDF.\n\nOS - MacOSX 10.7 or Later\n\n      ###################  Read instructions note  ########################\n\n             Â£  N  J  0  Y - https://ThePirateBay.am/user/Degun",
  "parsed": {
    "xt": "urn:btih:4713c842ad696bccd3f0ae06698430eebb2d1fc7",
    "dn": "Adobe.InDesign.CC.2015.11.0.072.incl.keygen.MacOSX.DeGun",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "4713c842ad696bccd3f0ae06698430eebb2d1fc7",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        71,
        19,
        200,
        66,
        173,
        105,
        107,
        204,
        211,
        240,
        174,
        6,
        105,
        132,
        48,
        238,
        187,
        45,
        31,
        199
      ]
    },
    "name": "Adobe.InDesign.CC.2015.11.0.072.incl.keygen.MacOSX.DeGun",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 62,
  "peers": 43,
  "last_updated": "2016-12-26T23:04:18.769Z"
}