{
  "title": "Lonely Planet - Dublin (Travel Guide) - 10th Ed (2016) Gooner",
  "uid": 15947791,
  "size": 88638947,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:48fb3337d78a6772db5302778689cdea46f8b332&amp;dn=Lonely+Planet+-+Dublin+%28Travel+Guide%29+-+10th+Ed+%282016%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 54,
  "leechers": 9,
  "uploader": "GoonerTPB",
  "files": 2,
  "time": 1475532851,
  "description": "Lonely Planet - Dublin (Travel Guide) - 10th Edition (2016) (Epub) Gooner\r\n\r\nPublisher: Lonely Planet; 10 edition (1 Nov. 2016)\r\nLanguage: English\r\nISBN-10: 1786571293\r\nISBN-13: 978-1786571298\r\n\r\nLonely Planet: The world's leading travel guide publisher\r\n\r\nLonely Planet Dublin is your passport to the most relevant, up-to-date advice on what to see and skip, and what hidden discoveries await you. Sample a Guinness in a genuine Irish pub; soak in the academic atmosphere at Trinity College; or admire impressionist masterpieces at the Dublin City Gallery; all with your trusted travel companion. Get to the heart of Dublin and begin your journey now!\r\n\r\nInside Lonely Planet Dublin Travel Guide:\r\n\r\n* Full-colour maps and images throughout\r\n\r\n* Highlights and itineraries help you tailor your trip to your personal needs and interests\r\n\r\n* Insider tips to save time and money and get around like a local, avoiding crowds and trouble spots\r\n\r\n* Essential info at your fingertips - hours of operation, phone numbers, websites, transit tips, prices\r\n\r\n* Honest reviews for all budgets - eating, sleeping, sight-seeing, going out, shopping, hidden gems that most guidebooks miss\r\n\r\n* Cultural insights give you a richer, more rewarding travel experience - history, literature, music, architecture\r\n\r\n* Free, convenient pull-out Dublin map (included in print version), plus over 25 colour maps\r\n\r\n* Covers Grafton Street, Merrion Square, Temple Bar, Kilmainham &amp; the Liberties, North of the Liffey, Docklands, the Grand Canal and more\r\n\r\nThe Perfect Choice: Lonely Planet Dublin, our most comprehensive guide to the city, is perfect for both exploring top sights and taking roads less traveled.\r\n\r\n* Looking for just the highlights? Check out Lonely Planet Pocket Dublin, a handy-sized guide focused on the can't-miss sights for a quick trip.\r\n\r\n* Looking for more extensive coverage? Check out Lonely Planet Ireland guide for a comprehensive look at all the country has to offer.\r\n\r\nAuthors: Written and researched by Lonely Planet.\r\n\r\nAbout Lonely Planet: Since 1973, Lonely Planet has become the world's leading travel media company with guidebooks to every destination, an award-winning website, mobile and digital travel products, and a dedicated traveler community. Lonely Planet covers must-see spots but also enables curious travelers to get off beaten paths to understand more of the culture of the places in which they find themselves",
  "parsed": {
    "xt": "urn:btih:48fb3337d78a6772db5302778689cdea46f8b332",
    "dn": "Lonely Planet - Dublin (Travel Guide) - 10th Ed (2016) Gooner",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "48fb3337d78a6772db5302778689cdea46f8b332",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        72,
        251,
        51,
        55,
        215,
        138,
        103,
        114,
        219,
        83,
        2,
        119,
        134,
        137,
        205,
        234,
        70,
        248,
        179,
        50
      ]
    },
    "name": "Lonely Planet - Dublin (Travel Guide) - 10th Ed (2016) Gooner",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 63,
  "peers": 30,
  "last_updated": "2016-12-25T00:07:11.395Z"
}