{
  "title": "Roller Coaster Tycoon 3 Platinum - RELOADED",
  "uid": 6503315,
  "size": 490242532,
  "categoryP": "games",
  "categoryS": "pc",
  "magnet": "?xt=urn:btih:4cb7a3103f4d90d6216a6acec47b6ad40dc67907&amp;dn=Roller+Coaster+Tycoon+3+Platinum+-+RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 55,
  "leechers": 4,
  "uploader": "CarlesNeo",
  "files": 19,
  "time": 1309337284,
  "description": "RollerCoaster Tycoon 3 Platinum (Soaked + Wild Expansions)- RELOADED -(DirectPlay)\n\n                                  |=====================|\n                                  |Torrent By CarlesNeo |\n                                  |=====================|\n\n \nDeveloper(s)         Frontier Developments \nPublisher(s)         Atari, Inc. \nComposer(s)          Alistair Lindsay \nPlatform(s)          Mac OS X, Windows (98/ME/2000/XP/Vista/7) \nRelease date(s)      October 26, 2004\n                     November 3, 2004\n \nGenre(s)             Construction and management simulation \nMode(s)              Single-player \nRating(s)            ESRB: E\nOFLC:                G\nPEGI:                3 \n \nMedia/distribution CD-ROM, Steam \n\nSystem requirements \n\nIntel Pentium III 1GHz CPU 256MB RAM, 800MB hard disk space, Any ATI Radeon or NVIDIA GeForce GPU with 32 MB (NVidia Geforce 8500 or equivalent ATI or above recommended.\n\n\n===================================================================================\n\nRollerCoaster Tycoon 3 is a construction and management simulation computer game. It is the third installment in the RollerCoaster Tycoon series, first released on October 26, 2004 in North America. RollerCoaster Tycoon 3 places players in charge of managing amusement parks; rides can be built or demolished, terrain and scenery can be adjusted, and prices can be controlled to keep visitors or &quot;peeps&quot; happy.[1]\n\nRollerCoaster Tycoon 3 features two methods of gameplay. In career mode, players must complete predetermined objectives in predesigned scenarios. In the new sandbox mode, players have unlimited time and money to create their own custom parks.[2] New features include the ability to import and export custom attractions, design custom scenarios and peeps, as well as design an in-game recorder and a fully three dimensional world players can view from all angles.\n\n\n\nGameplay\n\nLike the previous games in the series, RollerCoaster Tycoon 3 is a strategy and simulation game in which players manage all aspects of an amusement park by building or removing rides, scenery and amenities, adjusting the park's finances, hiring staff, and keeping the park visitors, known as &quot;peeps&quot;, happy. RollerCoaster Tycoon features two main game modes. The career mode features scenarios where players must accomplish goals, such as impressing a visiting celebrity or attaining a certain park rating. Each scenario has three levels of objectives, which are ranked as Apprentice, Entrepreneur, and Tycoon; the higher the level, the more challenging the goal is to complete. A third of the scenarios are playable from the start, with the rest unlocked when the player completes the objectives at each level. The second mode of play is the sandbox mode. Players are given a large, empty plot of land and unlimited funds with which to build their own custom parks.[1]\n\nRollerCoaster Tycoon 3 includes new gameplay features such as the CoasterCam, which allows players to &quot;ride&quot; roller coasters and other rides,[1] and the MixMaster, which allows the player to coordinate firework shows and time them to in-game music.[1] Unlike the two previous versions of the game, RollerCoaster Tycoon and RollerCoaster Tycoon 2, the guests, called &quot;peeps&quot;, arrive in groups and show variation in gender and age, including children, teenagers and adults. A day/night cycle changes the demographics of the park's peeps; rides at night appeal to teenagers, while the daytime attracts families with children. Peeps can be harmed and injured by crashing vehicles, but will never die as they did in the previous titles, nor will they drown when placed in water. This change was most likely for user-friendly issues. Furthermore, a new feature was added in which, after a cheat code was entered, people could utilize the Peep Cam from which they could see the park through a peeps' eyes.[3] Parks now have opening and closing times, and the time of day is displayed. Scenery is divided into themes to customize parks, with western-, spooky-, science fiction-, prehistoric-, tropic (Paradise Island)- atlantis- and adventure-themed pieces.[4] Another feature is the ability to import coasters from previous games in the series into RCT3.\n\nThe game uses full 3D graphics instead of the isometric viewpoint of the previous games; this means that players can rotate and zoom the view of the park to any degree. However, there is an option to fix the camera's rotation to 90 angles, as in the previous games. 3D land shaping is also available for creating mountains and hills inside the park.\n\nWhen cars derail from the tracks, they explode after a short period, whilst in the older games, they exploded on contact.\n\n\n Development  \n\nAlthough the core features of RollerCoaster Tycoon 3 are based on the previous games, Chris Sawyer, the developer of the first two games, acted only as a consultant, as the game was developed by Frontier Developments instead, and published and advertised by Atari.\n\n\n Expansions\n\nTwo expansion packs for RollerCoaster Tycoon 3 were released - Soaked! and Wild!. A bundle, RollerCoaster Tycoon 3 Gold, was also released, including the original game and the Soaked! expansion pack; this was followed by RollerCoaster Tycoon 3 Platinum (Deluxe for the EU version of the game), including both expansion packs and the original game. RollerCoaster Tycoon 3 Platinum is available for Windows and Mac OS X.\n\nSoaked!, the first expansion, allows the player to build water parks, including swimming pools and water slides, and adds more ride types and scenery to the original game, along with the ability to add waterfalls. From the expansion pack, players can also make their own water jet displays and co-ordinate them to music, similar to the MixMaster.\n\nWild!, the second expansion, allows the player to build zoos and safari rides, similar to Zoo Tycoon in an amusement park setting, in which animals can be placed, and adds more ride types and scenery to the original game. Additionally, it addressed several criticisms of the first game, such as the inability to build underground, which is available without the expansion pack in the form of an update patch.\n\n\n User Created Content\n\nRCT3 has the ability to make Custom Scenery (CS), Custom Flat Rides (CFR), and Custom Tracked Rides (CTR), with a collection of these, individuals and groups can now make &quot;custom&quot; expansion packs. These can be obtained through internet downloads. Among most downloaded custom scenery downloads are Jcat's Steelworx (for supports and lift hill catwalks), ATH Catwalks (for roller coaster catwalks), and Mattatt14's Space Mountain Set (Space Mountain recreations). As of now there are Numerous User Created Expansion Packs (UCEPs). The most popular of these is the NetOn series, which has a 1.0 and a 2.0 version. Custom Tracks have also been made, however the number of tracks available for download are limited.\n\n\n===================================================================================\n\nInstructions -\n\n \n\n1. Open the file rct3p-rld.7z.001 using 7Zip. \n(These archives can only be opened by 7zip , FreeArc or IZArc)\n( 7Zip (one of the best archivers) is a free archiver.)\n\n2.Then extract the rct3p-rld.iso file. (only from rct3p-rld.7z.001)\n\n3.Then open the rct3p-rld.iso using Daemon tools or 7Zip.\n3.1 If you use daemon tools, you have to mount it then copy the files from it and paste where you want to ! \n3.2 If you use 7Zip, you have to extract it.Extract it where you want to ! \n\n\n \n4. When done, then to play the game, cilck on RCT3plus.exe .\n\n5.Enjoy the Game !!!!!!!!!!!!!!!!!!!!\n\n===================================================================================\nFor any problems or you want me to upload any other torrent comment or contact me at -\n\n&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;b1d2d0c3ddd4c29fdd9fd99fc2dac8c6d0dddad4c3f1d6dcd0d8dd9fd2dedc&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\n===================================================================================\n                                     Thank You\n===================================================================================\n                                  Comment and Seed\n===================================================================================\n      CarlesNeo - &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;8be8eaf9e7eef8a5e7a5e3a5f8e0f2fceae7e0eef9cbece6eae2e7a5e8e4e6&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt; - may be the force with you !\n===================================================================================",
  "parsed": {
    "xt": "urn:btih:4cb7a3103f4d90d6216a6acec47b6ad40dc67907",
    "dn": "Roller Coaster Tycoon 3 Platinum - RELOADED",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "4cb7a3103f4d90d6216a6acec47b6ad40dc67907",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        76,
        183,
        163,
        16,
        63,
        77,
        144,
        214,
        33,
        106,
        106,
        206,
        196,
        123,
        106,
        212,
        13,
        198,
        121,
        7
      ]
    },
    "name": "Roller Coaster Tycoon 3 Platinum - RELOADED",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 50,
  "peers": 50,
  "last_updated": "2016-12-26T23:40:17.649Z"
}