{
  "title": "Great Mysteries of the 20th Century (gnv64)",
  "uid": 15599769,
  "size": 31005603,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:4cdb6b68a702736bfd2af6aece989e2cd16533fa&amp;dn=Great+Mysteries+of+the+20th+Century+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 57,
  "leechers": 4,
  "uploader": "gnv65",
  "files": 4,
  "time": 1471617189,
  "description": "Great Mysteries of the 20th Century\r\nby Editors of Reader's Digest \r\nReaders Digest | January 2000 | ISBN-10: 0762102675 | scanned PDF | 160 pages | 29.5 mb \nhttp://www.amazon.in/Great-mysteries-century-Eventful-Century/dp/0762102675\r\n\r\nAs the millennium draws to a close, THE EVENTFUL CENTURY series presents the vast panorama of the last hundred years — a century that has witnessed the transition from horse-dravvn transport to space travel, and from tlie first telephones to tlie information superhighway.\r\n\r\nThe Eventful Century chronicles epoch-making events like the outbreak of the two world wars, the Russian Revolution and the rise and fall of communism. But major events are only part of the gHttering kaleidoscope. It also describes the everyday background—the way people lived, how diey worked, what they ate and drank, how much they earned, the way they spent their leisure time, the books they read, and the crimes, scandals and unsolved mysteries that set them talking. Here are fads and crazes like the hula hoop and Rubik's cube . . . fashions like the New Look and the miniskirt . . . breakthroughs in entertainment, like the birth of tlie moaes . . . medical milestones like the discovery of penicillin . . . and mai-vels of modem architecture and engineering.\r\n\r\nGreat Mysteries of the 20th Century presents the most profound puzzles of the centun-. Deaths in mysterious circumstances, like that of the Italian banker Roberto Calvi . . . unexplained evidence at the heart of historic events, such as the assassination of President Kennedy . . . strange disappearances, like that of Agatha Christie, a stoiy worthy of one of her own novels . . . paranormal phenomena, like the heavenly vision that appeared to three Portuguese children at Fatima . . . and mysteries of modern science. It might be possible to dismiss all paranormal reports as products of the fallible human mind, were it not that modern science itself challenges eveiy commonsense belief about space and time. Black holes, it appears, may act as conduits into another dimension. Time, it seems, does not run in a ruler-straight line; past, present and future may exist simultaneously. The great mysteries of tlie 20th century warn at eveiy turn against the closed mind; the best we can do is to sift the evidence and acknowledge all realms of possibility.\r\n \nhttps://s3.postimg.io/5vnnfirqr/Great_Mysteries_of_the_20th_Century.jpg",
  "parsed": {
    "xt": "urn:btih:4cdb6b68a702736bfd2af6aece989e2cd16533fa",
    "dn": "Great Mysteries of the 20th Century (gnv64)",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "4cdb6b68a702736bfd2af6aece989e2cd16533fa",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        76,
        219,
        107,
        104,
        167,
        2,
        115,
        107,
        253,
        42,
        246,
        174,
        206,
        152,
        158,
        44,
        209,
        101,
        51,
        250
      ]
    },
    "name": "Great Mysteries of the 20th Century (gnv64)",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 61,
  "peers": 97,
  "last_updated": "2016-12-25T00:31:22.902Z"
}