{
  "title": "Windows Server 2012 Hyper-V Installation and Configuration Guide",
  "uid": 8406891,
  "size": 32589611,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:4d2c996ad6a3948af65927ee11b6caa75e1c763d&amp;dn=Windows+Server+2012+Hyper-V+Installation+and+Configuration+Guide&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 50,
  "leechers": 2,
  "uploader": "2010kaiser",
  "files": -1,
  "time": 1366822965,
  "description": "   Windows Server 2012 Hyper-V Installation and Configuration Guide-2010kaiser\n   ===========================================================================\n\n\nGo-to guide for using Microsoft's updated Hyper-V as a virtualization solution\nWindows Server 2012 Hyper-V offers greater scalability, new components, and more options than ever before for large enterprise systems and small / medium businesses. Windows Server 2012 Hyper-V Installation and Configuration Guide is the place to start learning about this new cloud operating system. You'll get up to speed on the architecture, basic deployment and upgrading, creating virtual workloads, designing and implementing advanced network architectures, creating multitenant clouds, backup, disaster recovery, and more.\nThe international team of expert authors offers deep technical detail, as well as hands-on exercises and plenty of real-world scenarios, so you thoroughly understand all features and how best to use them.\n- Explains how to deploy, use, manage, and maintain the Windows Server 2,012 Hyper-V virtualization solutions in large enterprises and small-to medium-businesses\n- Provides deep technical detail and plenty of exercises showing you how to work with Hyper-V in real-world settings\n-Shows you how to quickly configure Hyper-V from the GUI and use PowerShell to script and automate common tasks\n- Covers deploying Hyper-V hosts, managing virtual machines, network fabrics, cloud computing, and using file servers\n- Also explores virtual SAN storage, creating guest clusters, backup and disaster recovery, using Hyper-V for Virtual Desktop Infrastructure (VDI), and other topics\nHelp make your Hyper-V virtualization solution a success with Windows Server 2012 Hyper-V Installation and Configuration Guide.\n\nTitle: Windows Server 2012 Hyper-V Installation and Configuration Guide\nAuthor: Aidan Finn, Patrick Lownds, Michel Luescher, Damian Flynn\nPublisher: Sybex\nYear: 2013\nFormat: PDF-EPUB\n\n\n\n2010kaiser home page at The Pirate Bay link below:\n\n  &lt;a href=&quot;\nhttp://thepiratebay.se/user/2010kaiser/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2010kaiser/&lt;/a&gt;\n\n\nCheck out the new PirateWiki! Where knowledge is shared ;-)\n\n           &lt;a href=&quot;\nhttps://forum.suprbay.org/wiki/index.php?title=Portal:Main_Page&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/wiki/index.php?title=Portal:Main_Page&lt;/a&gt;\n\n\nFor re-seed requests, help, support or anything else relating to The Pirate Bay. You'll find it all, and more, at suprbay. The official support forum of The Pirate Bay. Visit it at the link below:\n\n  &lt;a href=&quot;\nhttps://forum.suprbay.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/&lt;/a&gt; \n\n\nENJOY AND SEED!!!",
  "parsed": {
    "xt": "urn:btih:4d2c996ad6a3948af65927ee11b6caa75e1c763d",
    "dn": "Windows Server 2012 Hyper-V Installation and Configuration Guide",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "4d2c996ad6a3948af65927ee11b6caa75e1c763d",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        77,
        44,
        153,
        106,
        214,
        163,
        148,
        138,
        246,
        89,
        39,
        238,
        17,
        182,
        202,
        167,
        94,
        28,
        118,
        61
      ]
    },
    "name": "Windows Server 2012 Hyper-V Installation and Configuration Guide",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 52,
  "peers": 34,
  "last_updated": "2016-12-25T00:33:27.355Z"
}