{
  "title": "Nero 2017 Platinum 18.0.06100 Incl Serial Key / Content Pack",
  "uid": 15999930,
  "size": 1128946286,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:4de490be9e92de088ba3ff1863482e9b86541f64&amp;dn=Nero+2017+Platinum+18.0.06100+Incl+Serial+Key+%2F+Content+Pack&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 74,
  "leechers": 108,
  "uploader": "SadeemPC",
  "files": 2,
  "time": 1476114198,
  "description": "Nero 2017 Platinum 18.0.06100 Multilingual + Content Pack\r\n\r\nLooking for improved security for your discs and files, quicker video editing, and even greater ease of use? Letâ™s go for it! Nero 2017 Platinum provides you with top level quality youâ™ve come to expect, all new comprehensive features, powerful technology and digital tutorials to help you in your digital projects.\r\n\r\nSimply greater security!\r\nStart enjoying Nero 2017 Platinum intuitively with new Nero QuickStart and get to grips with the most important tasks in a breath. But thatâ™s not all: Whether audio CD, DVD, or Blu-ray Disc™, you can copy and burn photos, videos, music, and data for the long term using reliable Nero technology. * And if you want maximum security, the new SecurDisc 4.0 provides password protection and 256-bit encryption so what happens on your PC stays on your PC!\r\n\r\nComplete creativity for complete enthusiasm!\r\nThe latest version of Nero 2017 Platinum offers a variety of options for top-quality results and complete creativity for your multimedia files. Import high quality HEVC (H.265) clips or transfer 4K and HD videos to your computer from smartphones, digital cameras, and camcorders.\r\n\r\nCaptivate your audience with express or advanced video editing using 4K video templates and more than 800 spectacular effects. Export individual scenes from long movies in one go. Add high quality, stylish menus to your DVD-Videos™ and Blu-ray Discs™ to allow you to jump straight to the scene you want, design sleeves to your taste with Nero CoverDesigner, and enjoy the highest-quality output for your music and videos. Did we miss anything? Oh yes – popcorn!\r\n\r\nThe entire range of formats!\r\nBring together what belongs together: Import all formats, including even high quality HEVC (H.256), and convert them to almost any format you need. Rip video DVDs*, AVCHD*, and Blu-ray Discs™* and simply reuse the files for new projects. With the 1-click conversion, you can send audio CDs directly to your connected mobile device. In the process, Nero automatically ensures the easiest conversion mode with the best sound.\r\n\r\nSit back and enjoy!\r\nTurn on the speakers, set up the screen: Using Nero MediaHome, photos, videos with subtitles, and music can be found and played quickly. And with the optimized Nero MediaHome WiFi Sync App, they can be imported in a flash and sent to almost any device – whether iOS or Android smartphone, or tablet.\r\n\r\nPlay all audio and video formats, including 4K (Ultra HD) and high quality HEVC. Thanks to the new Gracenote® connection, itâ™s now easier than ever to search through song titles on your mobile device with the help of the album covers. Expand your music collection with Music Recorder and legally record MP3s from thousands of Internet radio stations. Sounds awesome, doesnâ™t it?\r\n\r\nWhat's New in Nero 2017 Platinum ? \nhttps://neroknowhow.com/2016/09/30/whats-new-in-nero-2017-platinum/",
  "parsed": {
    "xt": "urn:btih:4de490be9e92de088ba3ff1863482e9b86541f64",
    "dn": "Nero 2017 Platinum 18.0.06100 Incl Serial Key / Content Pack",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "4de490be9e92de088ba3ff1863482e9b86541f64",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        77,
        228,
        144,
        190,
        158,
        146,
        222,
        8,
        139,
        163,
        255,
        24,
        99,
        72,
        46,
        155,
        134,
        84,
        31,
        100
      ]
    },
    "name": "Nero 2017 Platinum 18.0.06100 Incl Serial Key / Content Pack",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 182,
  "peers": 100,
  "last_updated": "2016-12-25T00:38:12.174Z"
}