{
  "title": "Disk Doctors Data Recovery Suite 1.0.4.388 (Install + Portable)",
  "uid": 14369513,
  "size": 28618929,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:4e4d2874cdb0b9c5cac6478913ff557836c5038d&amp;dn=Disk+Doctors+Data+Recovery+Suite+1.0.4.388+%28Install+%2B+Portable%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 40,
  "leechers": 0,
  "uploader": "jovo_bih",
  "files": 1,
  "time": 1461149002,
  "description": "About this release\r\n\r\nRelease date: 12/04/2016\r\nInstall: run installer, do not run application, copy patched file to installation directory\r\nPortable: already patched, unzip and run DD-DRS\r\nFor both versions: do not allow the app to connect to the internet\r\nVirustotal patch report https://www.virustotal.com/e...ee1280dd6b696f9104/analysis/\r\n\r\nAbout Disk Doctors Data Recovery Suite\r\n\r\nDisk Doctors Data Recovery Suite is user-friendly software designed for professionals to recover data from corrupt, deleted, inaccessible partitions formatted by major operating systems like Windows, Mac, Linux and Unix etc.\r\n\r\nCapabilities\r\n\r\nDisk Doctors Data Recovery Suite is built for most main stream file systems used in Windows, Mac, Linux and Unix Operating Systems. Disk Doctors Data Recovery Suite recovers files from drives damaged by any virus attack, power failure or system crash or due to any human error. It can recover after the volume has been reformatted, even with a different file system. It can also handle the disks with bad sectors.\r\n\r\nKey Features of Disk Doctors Data Recovery Suite\r\n\r\nIt can easily recover files from most main stream file system formats like FAT, FAT16, FAT32, NTFS, NTFS5, Ext2, Ext3 &amp; Ext4, HFS, HFS+, UFS, and XFS etc. It can recover data from:\r\n\r\n- The drive that has been re-initialized\r\n- The partition / volume have been formatted/reformatted or deleted.\r\n- The Files and folders are accidentally deleted\r\n- Any sort of corruption causing inability to boot OS\r\n\r\nSafe Recovery Tool\r\n\r\nDisk Doctors Data Recovery Suite uses its significant non-destructive read only recovery mechanism to recover the lost data. Never install Disk Doctors Data Recovery Suite on the same drive you want to recover data from. Also, never save any data on the same drive from which you are recovering data from. However, you would need to provide a safe destination / healthy drive to write recovered data, or to install the software.\r\n\r\nPreview &amp; Restore Files\r\n\r\nThe preview function of the software lets you identify the important files. In the last step you can pick the important files and click the save button.\r\n\r\nDelivers Fast Results\r\n\r\nDisk Doctors Data Recovery Suite uses TurboScan™ technology and some adjustable tweaks that provide the fastest data recovery ever built. This recovery software recovers files from faulty logical volumes even when file records are lost.\r\n\r\nIntuitive User Interface\r\n\r\nAccompanied by an on-screen &quot;wizard&quot;, you are guided through the recovery processes step by step. The Intuitive Interface is completely linear, meaning it will almost seem to be guiding you through the entire data recovery process. Once the Disk Doctors Data Recovery Suite has completed its repairs, one will be able to access the once-lost data just as before.\r\n\r\nHomepage http://diskdoctors.net/data-Recovery-suite-Software",
  "parsed": {
    "xt": "urn:btih:4e4d2874cdb0b9c5cac6478913ff557836c5038d",
    "dn": "Disk Doctors Data Recovery Suite 1.0.4.388 (Install   Portable)",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "4e4d2874cdb0b9c5cac6478913ff557836c5038d",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        78,
        77,
        40,
        116,
        205,
        176,
        185,
        197,
        202,
        198,
        71,
        137,
        19,
        255,
        85,
        120,
        54,
        197,
        3,
        141
      ]
    },
    "name": "Disk Doctors Data Recovery Suite 1.0.4.388 (Install   Portable)",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 40,
  "peers": 104,
  "last_updated": "2016-12-25T00:40:52.623Z"
}