{
  "title": "Bluestacks App Player V0.9.15.5208 [moded]",
  "uid": 16035838,
  "size": 9531339,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:4e8c29508b5a4ef398ad0c186850f01966414560&amp;dn=Bluestacks+App+Player+V0.9.15.5208+%5Bmoded%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 158,
  "leechers": 26,
  "uploader": "0Fallen173c",
  "files": 3,
  "time": 1476481510,
  "description": "BlueStacks App Player is a very popular application, this application can allow you to be able to run Android applications on the PC computer you own, so you can play the entire game Android on your PC computer and also other applications.\r\nTens of millions of people around the world use top apps like Candy Crush Saga, Telegram, Temple Run 2 and more on their laptops with BlueStacks. It took our engineers two years to build the complex LayerCake technology that enable this to happen. Download App Player for free while it remains in beta. Just click the button below to install on your PC or Mac.\r\n\r\nAfter you install BlueStacks on your Windows PC, you can download directly from the program needed Android-app, without having to use the Android-based smartphone. BlueStacks looks pretty neat and fits naturally into the interface Windows. The program allows you to run Android-application in a window or full screen mode, and will be able to deal with it almost all - BlueStacks translated into 39 languages, including Russian and there. Also, BlueStacks has the support of the new Windows 8 and, of course, can be installed on ultrabooks and tablets based on x86 CPUs.\r\n\r\n\r\nfeature:\r\nAndroid game play fast and full screen (full screen)\r\nPush your favorite apps from your Android phone to your PC using BlueStacks Cloud Connect\r\nRun the application pre-loaded 10 &quot;outside the box&quot;\r\nInstall up to 26 more of your favorite applications\r\nRun Android applications in full-screen and not only.\r\nThrough the cloud download your application from the phone to Windows.\r\nIn 16 player preinstalled applications and you can play them if there is no number.\r\nAbility to set an unlimited number of applications.\r\nAbility to play 3D games (cache).\r\nYou can set a home screen (Launcher) to replace the standard, etc.\r\nSync with your Android device will allow you to make calls, send SMS, take pictures and more.\r\nHas a lot of settings and system settings Android (Although they are slightly trimmed)\r\nKnows how to install applications from a computer at the touch of them\r\nAbility to obtain Root (full access to the file system, etc.)\r\nYou can set Google Play, simply speaking market.\r\nBlueStacks great friends with ADB is a very big plus, if you really want, you can change the firmware.\r\nAbility to turn in FastBoot and Recovery.\r\nBluesStacks has virtual disk, such as SD Card, Data, and a few others. Which again gives you the opportunity to do a lot of body motions with it and enjoy all its charms.\r\nAbility to obtain Root (full access to the file system)",
  "parsed": {
    "xt": "urn:btih:4e8c29508b5a4ef398ad0c186850f01966414560",
    "dn": "Bluestacks App Player V0.9.15.5208 [moded]",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "4e8c29508b5a4ef398ad0c186850f01966414560",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        78,
        140,
        41,
        80,
        139,
        90,
        78,
        243,
        152,
        173,
        12,
        24,
        104,
        80,
        240,
        25,
        102,
        65,
        69,
        96
      ]
    },
    "name": "Bluestacks App Player V0.9.15.5208 [moded]",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 2,
  "peers": 2,
  "last_updated": "2016-12-26T23:52:43.984Z"
}