{"title":"Dead by Daylight v1.0","uid":14938216,"size":3722226763,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4f0402700bb93e24e98945d833af7da5bc7f0676&amp;dn=Dead+by+Daylight+v1.0&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":45,"leechers":3,"uploader":"dauphong","files":1,"time":1466008690,"description":"About This Game\r\nDeath Is Not an Escape.\r\n\r\nDead by Daylight is an upcoming multiplayer (4vs1) horror game where one player takes on the role of the savage Killer, and the other four players play as Survivors, trying to escape the Killer and avoid being caught, tortured and killed.\r\n\r\nSurvivors play in third-person and have the advantage of better situational awareness. The Killer plays in first-person and is more focused on their prey.\r\n\r\nThe Survivors' goal in each encounter is to escape the Killing Ground without getting caught by the Killer - something that sounds easier than it is, especially when the environment changes every time you play.\r\n\r\nDead by Daylight will be released on June 14th and is available for pre-order from April 22nd - both as a Standard Edition and a Deluxe Edition. A closed BETA will go live on May 31st. Access to the closed BETA can be obtained by pre-ordering the deluxe edition of the game.\r\n\r\nMore information about the game is available at www.deadbydaylight.com\r\nKey Features\r\n• Survive Together… Or Not - Survivors can either cooperate with the others or be selfish. Your chance of survival will vary depending on whether you work together as a team or if you go at it alone. Will you be able to outwit the Killer and escape their Killing Ground?\r\n\r\n• Where Am I? - Each level is procedurally generated, so you’ll never know what to expect. Random spawn points mean you will never feel safe as the world and its danger change every time you play.\r\n\r\n• A Feast for Killers - Dead by Daylight draws from all corners of the horror world. As a Killer you can play as anything from a powerful Slasher to terrifying paranormal entities. Familiarize yourself with your Killing Grounds and master each Killer’s unique power to be able to hunt, catch and sacrifice your victims.\r\n\r\n• Deeper and Deeper - Each Killer and Survivor has their own deep progression system and plenty of unlockables that can be customized to fit your own personal strategy. Experience, skills and understanding of the environment are key to being able to hunt or outwit the Killer.\r\n\r\n• Real People, Real Fear - The procedural levels and real human reactions to pure horror makes each game session an unexpected scenario. You will never be able to tell how it’s going to turn out. Ambience, music, and chilling environments combine into a terrifying experience. With enough time, you might even discover what’s hiding in the fog","torrent":{"xt":"urn:btih:4f0402700bb93e24e98945d833af7da5bc7f0676","amp;dn":"Dead+by+Daylight+v1.0","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f0402700bb93e24e98945d833af7da5bc7f0676","infoHashBuffer":{"type":"Buffer","data":[79,4,2,112,11,185,62,36,233,137,69,216,51,175,125,165,188,127,6,118]},"announce":[],"urlList":[]}}