{
  "title": "Replay Media Catcher v5.0.1.54 + Crack",
  "uid": 11021085,
  "size": 21371804,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:4fa29f037545fff303ebfda68e7a69e7042f9a72&amp;dn=Replay+Media+Catcher+v5.0.1.54+%2B+Crack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 65,
  "leechers": 0,
  "uploader": "Big_dude",
  "files": 1,
  "time": 1410572506,
  "description": "Replay Media Catcher v5.0.1.54\n\n\nWeb Site - http://applian.com/replay-media-catcher/\n\n\n\nInstallation and Crack Instructions:\n\n\nRun the installer\n\n\nUncompress crack 7zip Password is 'password' type in \nlowercase without quotes.\n\n\ncrack may report as a virus but its a false positive\nmake an exception or ignore thru your firewall or\nantivirus software.\n\n\n\nApply the crack given read nfo for instructions.\n\n\nRun the program click menu help then click registration.\n\nRun Help menu click about then click support menu untick\nSend Anonymous Analytics option.\n\n\nEnjoy your licensed Application.\n\n\nDo not update or allow replay media catcher to auto update\nfrom internet.\n\n\n\nSoftware Description:\n\nThe Ultimate Online Video Downloader and Converter Tool\nReplay Media Catcher is the most powerful, convenient online video downloader in the world. And it supports audio/MP3 download or recording too. Here are some of the benefits:\n\nEasy to Use. Just play your song or video, and an exact digital copy is downloaded to your hard disk. That's it!\n\nConvert More Formats. Our streaming video downloader supports more web site media protocols than any other downloading software, and converts to over 130 device and file formats.\n\nPowerful Audio Recorder. For music lovers, you can record and convert audio from ANY web site or source, at high quality. Smart Video/MP3 Naming. Automatically names video files, and identifies and tags recorded MP3 music files. Amazing!\n\nSuper Fast. Advanced downloading technology captures videos and MP3 files at up to \n10x playback speed.\n\nPhone and Tablet Support. Integrates with iTunes, DropBox, Google Drive or SkyDrive for automatically copying files to your Apple or Android phone or tablet.\n\n\nDownload Streaming Video and MP3 FAST! \n\nReplay Media Catcher is the only video downloader software you'll need to capture \nalmost any internet video or audio. Most files can be downloaded at 10x speed, and \nfor music sites that use encrypted formats, you can legally record them with the built-in audio recorder.\n\n\nReplay Media Catcher also contains several Media Guides to help you find and save video and audio from all the popular sites.\n\nScheduled Downloads, Power Converter and MoreGREAT STUFF! \nReplay Media Catcher also has a scheduler, a torrent downloader, a browser history capture, a built-in converter and more. \n\n\n\n\nPlease Support This Torrent, Seed and Enjoy!",
  "parsed": {
    "xt": "urn:btih:4fa29f037545fff303ebfda68e7a69e7042f9a72",
    "dn": "Replay Media Catcher v5.0.1.54   Crack",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "4fa29f037545fff303ebfda68e7a69e7042f9a72",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        79,
        162,
        159,
        3,
        117,
        69,
        255,
        243,
        3,
        235,
        253,
        166,
        142,
        122,
        105,
        231,
        4,
        47,
        154,
        114
      ]
    },
    "name": "Replay Media Catcher v5.0.1.54   Crack",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 65,
  "peers": 10,
  "last_updated": "2016-12-25T00:49:54.400Z"
}