{"title":"Stardock Fences 2.12 Final + Crack","uid":9418021,"size":15660846,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4faf0ec155de8819248db7566c8a5da46bea1bc1&amp;dn=Stardock+Fences+2.12+Final+%2B+Crack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":208,"leechers":1,"uploader":"or1gins","files":6,"time":1388497274,"description":"Fences is a one-of-a-kind program, allowing you to draw labeled shaded areas on your desktop, which become movable &amp; resizable containers for your desktop icons. These groups can help bring organization and consistency to your computer's desktop, solving the &quot;constant mess&quot; problem that has plagued the desktop since its inception. \nFurthermore, this application will help you finally enjoy the desktop background you have hiding behind all those icons. In addition to its organizing features, Fences offers a novel quick-hide feature (in-patenting-process). Double click your desktop, and all your icons will fade out. Double click again, and they'll return.\n\n\nFeatures:\n-Create &quot;fences&quot; on your desktop to organize icons\n-Hide and show your desktop icons with a click\n-Mirror your folders' contents on the desktop\n-Have new desktop icons automatically sorted into an appropriate &quot;fence&quot;\n\n\nWhat's new in Fences 2.12:\nDecember 6th, 2013\n\n-Added allowing users to choose between rounded and 90 degree angle corner edges in the Fences config (defaulted by OS)\n-Added prompt for email at trial activation\nRe-enabled touch features. This includes using two fingers to switch between desktop pages (enabled by default) and the ability to &quot;flick&quot; icons into fences (disabled by default). Both are options in the settings, on the &quot;Desktop Pages&quot; and &quot;Layout and snapping&quot; tabs respectively.\n-Fixed Fences not showing on desktop/exist offscreen, out of res bounds\n-Fixed Fence shifting icons into hidden third column\n-Fixed show my desktop issue reactivated with information\n-Fixed issue with Folder portals and visibility\n-Fixed issue with name based rules and right click\n-Fixed issue with bottomed aligned secondary monitors causes off-set Portal Fences\n-Fixed a crash issue that has been haunting support where a target folder location had been changed\n-Fixed issue with config UI blanking out\n-Fixed issue with Fences not showing on desktop when they existed offscreen, out of the screen resolution\n-Fixed issue with new files defaulting to the second monitor\n-Fixed issue with the show desktop button in Windows when an active modal window was displaying in Fences\n-Fixed issue with being unable to drag desktop pages when the taskbar was on the left or right\n-Fixed issue with excluding icons from quickhide (like .website)\n-Fixed issue when folder portal opacity was set to 0%\n-Fixed where rules weren't sticking if assigned through right-click/...\n-Removed Fences as a Control Panel item (kept causing problems)","torrent":{"xt":"urn:btih:4faf0ec155de8819248db7566c8a5da46bea1bc1","amp;dn":"Stardock+Fences+2.12+Final+%2B+Crack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4faf0ec155de8819248db7566c8a5da46bea1bc1","infoHashBuffer":{"type":"Buffer","data":[79,175,14,193,85,222,136,25,36,141,183,86,108,138,93,164,107,234,27,193]},"announce":[],"urlList":[]}}