{
  "title": "Stephen.King.The.Dark.Tower.All.7.Audio.Books.Unabridged.TeNNRee",
  "uid": 4377917,
  "size": 3846352304,
  "categoryP": "audio",
  "categoryS": "audio_books",
  "magnet": "?xt=urn:btih:502d8dc5320ddf6d4d12508a9f20d4ae1d9c90c9&amp;dn=Stephen.King.The.Dark.Tower.All.7.Audio.Books.Unabridged.TeNNRee&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 44,
  "leechers": 9,
  "uploader": "TeNNReeD",
  "files": 115,
  "time": 1220503114,
  "description": "Stephen King's The Dark Tower Series Unabridged (1982-2004) A Release By: TeNNReeD\n\nInfo Hash: 502d8dc5320ddf6d4d12508a9f20d4ae1d9c90c9\n\nTrackers:\nudp://vip.tracker.thepiratebay.se:80/announce &lt;a href=&quot;\nhttp://tracker.bittorrent.am/announce&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://tracker.bittorrent.am/announce&lt;/a&gt;\n\nFile Info\n\nTitle:The Gunslinger, The Drawing Of The Three, The Wastelands, Wizard &amp; Glass, Wolves Of The Calla, The Song Of Susannah, The Dark Tower.\nYear: 1982-2004\nGenre: Fantasy, Western, Action, Horror.\nLanguage: English\nFiles: 115\nSize: 3.58 GB\n\nAudio Book Info\n\nCountry: USA\nWriter: Stephen King\nRead By: Frank Muller &amp; George Guidall\n\nTagline: The Man In Black Fled Across The Desert And The Gunslinger Followed...\n\nPlot Outline: The Dark Tower is a fantasy fiction, science fantasy, horror, and western themed series of novels by the American writer Stephen King. The series has been described as King's magnum opus - besides the seven novels that comprise the series proper, many of his other books are related to the story, introducing concepts and characters that come into play as the series progresses. The series has been recently adapted for a Marvel miniseries spin-off, written by King and illustrated by Jae Lee.\n\nThe series was inspired by the poem &quot;Childe Roland to the Dark Tower Came&quot; by Robert Browning, The Waste Land by T.S. Eliot and in the preface to the 2003 edition of The Gunslinger, King also identifies The Lord of the Rings and The Good, the Bad, and the Ugly as inspirations, identifying Clint Eastwood's &quot;Man with No Name&quot; character as the genesis of Roland of Gilead.\n\nThe central character, Roland, is the last living member of a knightly order known as gunslingers. The world he lives in is quite different from our own and yet has freakish similarities. Politically organized along the lines of a feudal society, it shares technological and social characteristics with the American Old West, as well as magical powers and relics of a highly advanced, but long vanished, society. Roland's quest, his raison d'ÃƒÆ’Ã‚Âªtre, is to find the Dark Tower, a mythical building said to be the nexus of the universe. Roland's world is said to have &quot;moved on&quot;, and indeed it appears to be coming apart at the seams - mighty nations are being torn apart by war, entire cities and regions vanish from the face of the earth without a trace, and even the Sun sometimes rises in the north and sets in the east. As the series opens, Roland's motives, goals, and even his age are unclear, though events in later instalments shed light on these mysteries.\n\nIn many ways, this series can be viewed as King's statement of the world he portrays in many of his other novels. Terminology such as Ka-tet and the Tower itself appear in other novels (principally Insomnia), Can-toi is mentioned in Desperation, and the theme of a thin world with outside beings seeking to enter and rule it, is an updated version of a similar theme that Lovecraft built his mythos upon. \n\nI hope that there is some interest for this as it took awhile to prep.  I will seed until it is able to stand alone.\n\nHere for you-TeNNReeD",
  "parsed": {
    "xt": "urn:btih:502d8dc5320ddf6d4d12508a9f20d4ae1d9c90c9",
    "dn": "Stephen.King.The.Dark.Tower.All.7.Audio.Books.Unabridged.TeNNRee",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "502d8dc5320ddf6d4d12508a9f20d4ae1d9c90c9",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        80,
        45,
        141,
        197,
        50,
        13,
        223,
        109,
        77,
        18,
        80,
        138,
        159,
        32,
        212,
        174,
        29,
        156,
        144,
        201
      ]
    },
    "name": "Stephen.King.The.Dark.Tower.All.7.Audio.Books.Unabridged.TeNNRee",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 53,
  "peers": 177,
  "last_updated": "2016-12-27T00:03:40.035Z"
}