{"title":"Kalki.Jug-HEVC-WebHD-x265.AAC-1CD-DDR","uid":12463518,"size":733432322,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:50fed6e3bb87086ff9f203a4083667431127175b&amp;dn=Kalki.Jug-HEVC-WebHD-x265.AAC-1CD-DDR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":94,"leechers":43,"uploader":"SaM","files":2,"time":1442833598,"description":"DDR Presents\n\nA DDR EXCLUSIVE - THE FIRST RIPS FROM A 4K INDIAN MOVIE\n\nKalki.Jug (2015)\n(A film by Debarati Gupta)\n\nBangla - 4K WEBHD rip - 848x360p (2.35:1)- 699 MB - x.265.AAC (2 Ch) - 1 Hrs:48 Min\n\nHIGH EFFICIENCY VIDEO ENCODING (HEVC)\n &lt;a href=&quot;\nhttp://extraimago.com/image/lX7&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://extraimago.com/image/lX7&lt;/a&gt;\n &lt;a href=&quot;\nhttp://extraimago.com/image/lXR&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://extraimago.com/image/lXR&lt;/a&gt; &lt;a href=&quot;\nhttp://extraimago.com/image/lXQ&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://extraimago.com/image/lXQ&lt;/a&gt; &lt;a href=&quot;\nhttp://extraimago.com/image/lXy&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://extraimago.com/image/lXy&lt;/a&gt; &lt;a href=&quot;\nhttp://extraimago.com/image/lXq&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://extraimago.com/image/lXq&lt;/a&gt; &lt;a href=&quot;\nhttp://extraimago.com/image/lXS&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://extraimago.com/image/lXS&lt;/a&gt; &lt;a href=&quot;\nhttp://extraimago.com/image/lXO&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://extraimago.com/image/lXO&lt;/a&gt; &lt;a href=&quot;\nhttp://extraimago.com/image/lX1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://extraimago.com/image/lX1&lt;/a&gt; &lt;a href=&quot;\nhttp://extraimago.com/image/lXs&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://extraimago.com/image/lXs&lt;/a&gt;\n\n Tech Specifications: \n &lt;a href=&quot;\nhttp://extraimago.com/image/lXl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://extraimago.com/image/lXl&lt;/a&gt;\n\nSynopsis:\nThe scene: lalbazaar, the Police Hq of Kolkata, India. ACP Dileep Dutta (Bratya Basu), the overworked but brilliant detective is handed over a case that has been dead for two years - An unsolved murder of a marketing professional called Chandan Ghosh. Dutta and his special team consisting of of Sub-Inspectors Vijay Lakshmi (a.k.a Viji - played by Rimjhim Mitra) and Arpan (Sourav Chakraborty), start delving into the case and quickly come up against the well-known artist and author Shankarshan Gupta (Debshanklar Haldar), who has written a book that describes a murder, where the modus operandi is strikingly similar to the Chandan Ghosh Case . Then begins a cat and mouse game between ACP Dutta and Sankarshan Gupta - two brilliant minds locked in a battle of wits. But is that all the story or is there yet something that Dileep Dutta is missing?\n\nComments:\nThe film starts out as an unusual one, a battle of wits between two brilliant and evenly matched minds. Moves follow counter-moves. But after a little while, the plot loses its focus and becomes increasingly obvious, until the end is almost puerile.. A pity, because the start was very promising..\n\nBoth Bratya Basu and Debshankar Haldar carry the film through. Their thrust and parry is a visual as well as aural delight. The two young people, Rimjhim and Sourav too bring a freshness to their role and project a relationship that is attractive. But the rest, including Locket Chatterjee are pedestrian. There are a whole set of scenes that are quite unnecessary and take up a lot of space without adding to the main story. We are for example shown repeated instances of domestic strife between Dileep Dutta and his wife, only to find that it is a case of mental disbalance and that entire sequence really has a momentary connection in one scene to the main theme. Surely a less elaborate method of showing the same could have been found?\n\nOverall, the film could have done with some more incisive editing. Still the Director manages to hold our interest till the very end and she does so without any overt &quot;action&quot; scenes. There are some interesting touches too, like the use of a different colour to show the thought processes of Dilip Dutta. That was a nice touch..\n\nMusic by Raj Narayan Den is an interesting fusion of western music with Indian percission. We are usually served the opposite. Cinematography by Joydeep Bose is excellent. I loved the outdoor scenes of the Ganga, but the indoor scenes are unobstrusive and adds to the scrrenplay.\n\nIts a good whodunit that will entertain you for close to an hour and three quaters.\n\nUploader's Notes:\nThe source is a Web UHD with 2880x1440 resolution and a 1.78 Aspect Ratio. The bit rate of the original web video is poor for its size (The original is just 3.78 GB - even less than a normal DVD!)\n\nI have readjusted the frame size to 848x360 (2.35:1) with some creative cropping and resizing. There is no significant detail lost, even in the panoramic scenes. The larger than usual frame size was, I thought merited. The encoding and the bit-depth of the original is poor as is the overall bit rate. The audio quality is particulalrly poor for a UHD broadcast. I have however, left the audio untouched.\n\nThe ultrafine detail of the original source has been preserved to the extent it is visible on an ordinary LED monitor. The colour has been adjusted to reduce the yellow tint a bit.\n\nThis is a 10-bit HEVC encoding. It seeks to preserve the detail available in the larger frame of the original h.264 video in a smaller frame size. This encoding and its higher compressibility has allowed me to reduce the file size to just 700MB.\n\nA somewhat larger 720p HEVC version will follow..\n\nBe aware that this rip (and all HEVC rips) will not play on any stand-alone device. You can only watch this on a computer. Be sure that you have the latest versions of VLC (2.1.5 or higher) or Media Player Classic (Ver 1.7.9) or SMPlayer (14.9.0). Earlier versions may not work\n\nIMDB Link: &lt;a href=&quot;\nhttp://www.imdb.com/title/tt4829728/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt4829728/&lt;/a&gt;","torrent":{"xt":"urn:btih:50fed6e3bb87086ff9f203a4083667431127175b","amp;dn":"Kalki.Jug-HEVC-WebHD-x265.AAC-1CD-DDR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50fed6e3bb87086ff9f203a4083667431127175b","infoHashBuffer":{"type":"Buffer","data":[80,254,214,227,187,135,8,111,249,242,3,164,8,54,103,67,17,39,23,91]},"announce":[],"urlList":[]}}