{"title":"Vray 1.9 (64 bit) (for C4D R15) (keygen X-Force) [ChingLiu]","uid":10440531,"size":118219271,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5267bbb74b2458cd6ccf5a13838b62621b0c9b3a&amp;dn=Vray+1.9+%2864+bit%29+%28for+C4D+R15%29+%28keygen+X-Force%29+%5BChingLiu%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":41,"leechers":2,"uploader":"Ching_Liu","files":-1,"time":1403883925,"description":"V-Ray is one of highest quality render tools available for production. It is widely used by professional CG artists and visualization firms worldwide. Its proven, beautiful and features super realistic image quality, at an unsurpassed render speed. VRAYforC4D is the Cinema 4D native incarnation of this great engine. It enables you to use V-Ray directly within Cinema 4D using the typical C4D like workflow. V-Ray is the de-facto standard in architecture &amp; design visualization, car rendering, TV commercials, and many more areas. It's good, it's fast, it's stable!\n\nThe feature list of VRAY for C4D 1.9 is as following:\n\nSpeed export optimisation: a new material and uv instancing system on export,which optimizes export,specially on big scenes extremely. this system keeps the &quot;vrscene&quot;(official V-Ray system all new V-Ray versions use) compatibility, but at the same time the speed optimisations many of you wished for big scenes. Example huge CAD scenes that did take in the VRAYforC4D export like over 2min can export now for local rendering in 15sec.\nOn the fly 2d shader baking: the new VRAYforC4D version can now on render time bake any 2d texture shader setup into a V-Ray standalone compatible V-Ray raw bitmap format. This means all 2d based c4d shaders, similar 3rd party texture shaders, the beloved c4d noise shaders in 2d uv mode, etc, and even setups stacked in c4d layer shader and or c4d filter shader can be on the fly rendered, direct with DR /standalone. this is a unique feature on VRAYforC4D, which no other V-Ray version has so far, it extend the possibiity to use internal shaders to a great extend,while being able to use the newest technologies provided by Chaosgroup and the V-Ray sdk (it also prepares for extended shader support the forthcoming V-Ray RT C4D feature implementation). the shader baking can be chosen global ad or per material,the baking size is adjustable per material,and also the bitmap depth (8,16, and 32bit).\nSlider speed and preview opimisation in the interface: many of you wished the sliders to be same interactive as in internal shaders and also the previews to be faster.s o we reverse engineered the system Maxon uses to speed up its interface and previews.the vray shaders and vraybitmap uses now intense bitmap chaching and intelligent down sampling for previews. image corrections can be done near real time, even on big hdri files.\nImage loading speedup of big bitmaps: even many huge hdri images load now very fast into the vray advanced bitmap shader. in our testing even a 140mb hdri loads in short time (same speed as the c4d image loader)\n[Random]SelectionTag to randomize polygon faces, objects and proxies via the vray multishader: we now brought so called &quot;face ids&quot; to c4d, a concept known in 3dmax. they can be used to randomizeor add variation to floor tiles , walls, panels, leaves etc. In addition you can also randomize whole objects and even proxies and instances in a very easy way. the multishader can be used in various combinations for very powerful variation setups.\nC4dbitmap to vray raw bitmap on the fly conversion, including psd layer and alpha support: any c4d bitmap can now be converted on render time to become an vraybitmap internally. this keeps full DR and V-Ray scene compatibility. it canb e set global to convert old scenes in one click dr compatible. It is also useful for use of 3rd party library content. in addition to that,you can even select psd layers in the used c4d fashion and theVRAYfor4D bridge will extract the channel and only export the selected element as vraybitmap.in the same way alphas are supported or animated c4d bitmap sequences.\nNew vraybitmap behavior: if you have a c4d bitmap and want to convert to a vray bitmap, simpel choose the &quot;vray shader&quot; and vray will automatically choose the vraybitmap shader and put the image that was loaded via c4d bitmap into the vray bitmap.this makes conversion a breeze.\nNew layer shader behavior: if you have a vray shader or bitmap loaded and choose the vray layered shader or mix shader(or any similar),the shader that was there before will automatically become a sub shader. this streamlines use a lot and eliminates the need of copy paste shaders around.\nNew V-Ray Distance shader: the high end distance shader that was yet a missing part from the powerful vray shader tools users know from maya or max is no also in c4d available. it enables shading in relation to other elements in the scene, like displacement, shading, masking, and even rendertime bools.\nNew Softbox shader: the V-Ray softbox shader was added. it is a very nice tool to texture arealights and light panels, to make high level professional studio setups. the variation in lighting and shading onthe light surface(in 32bit),brings an extra level of realism for the light and reflection of your models.\nDR support for grad ramp shader: the grad ramp shader is a gradient and falloff max shader ported to vray which is very powerful. it is now full DR compatible and also has a special mode called &quot;normal&quot; which is in use and control similar to the c4d fresnel shader. in additon to the c4d shader you can out shaders and textures in each knot of the fresnel or gradient(!),which makes it even more pwerful.\nChange of gradient shader behavior: gardient shader behave now more like we are used in c4d. in addition you can texture the color knots of each gradient,which allows yet unknown control.\nRGB curves control in each Vray shader: many of you might know the RGB curves that 3d max offers in 3-4 max shaders (like in falloff) from popular tutorials on the web like from Grant Warwck. We recoded that feature into c4d,and we have the RGB curves direct in any of the vray shaders (!).this was a popular demand and that feature is now fully available within C4d. the new RGB curves allow powerful color mapping of bitmap, shaders etc, but also allow you to use in combination with the vray falloff shader to create complex IOR curves, like for high end metals. one can recreate the material falloff curves for the rgb spectrum found on webpages like http://refractiveindex.info.\nOther tunings of the vray shader: many of the shaders have been tuned and optimised. in special also the multi shader, gradients and the layered shaders.there is a tool added to update old vray layer shader setups to the newer layered shader format.\nCustomisable Multipass manager presets: you can now save and load as many custom presets in the mp manager as you like, so any of your favorite setupscanbe available at one click.\nAdded support for velocity pass in mp: if you turn on mb and velocity pas, you can render out the mp via the velocity pass instead of baked into the final render, for post processing the mb.\nTool to add as many ID channels at once in one click: this woeks with object ids, multimatte or mat ids italos automatically assigns useful id numbers.\nNew Option to include refraction and reflection within ID channels: multimatte or mat id p.e. can now include the reflected or refracted parts of the selected element too.a powerful addition for id masking of the new V-ray core 2.55. (option affect all channel in spec and refraction channels)\nspecial mat id version (special user wish): the old type mat idf where one single mat id channel with many colors is created.while not as correct as the real mat id this is very powerful to use in editing in psd for many.while not in the new vray sdk, our developers custom coded that with some tricks, to bring you thit feature back.\nV-Ray light lister: a light lister tool for vray has been created,it list all lights in a scene and let you adjust ,select and tune in an easy streamlined way. very good for big and complex setups. (only available in c4d v14 or newer)\nV-Ray camera lister: a tool yet no other V-Ray has. similar to the light lister all cameras with vray tag are listed,y ou can edit direct the most important parts or select the cameras and edit all settings via AM, or also select he camera active for rendering. (only available in c4d v14 or newer)\nV-Ray domelight and BG environment Preview tool: a long wish was to be able to direct preview the dome light and BG in the c4d editor,this is now possible with the new V-Ray dome light preview tool. it can use c4d bitmaps and vray bitmaps. has custom exposure settings (good for hdris which are often show to bright otherwise) and custom resolution control. one can live rotate it in the editor or via coordinates. (only available in c4d v14 or newer)\nNew greatly cleaned up and more physical specular reflection channels: if things can go easier ,and at the same time more correct, we think this is the best combination. this was the target of the new specular channel redesign. the V-Ray reflection is now in new 5 specular channels, with one simple glossiness slider and texture slot. spec and reflection are now together as it it in reality (can be unlocked if needed). this allows the easy creation a lot more physical brdf materials,while keeping all control. the old obsolete &quot;reflection&quot; channel was finally removed (it will be there for old mats to keep compatibility)\nEasy global reflection depth control: all reflection depth settings are defaut now at &quot;-1&quot;which means it takes the global override value set in vray options.this allows the easy control via one single slider for the whole scene. like for fast previews or finals etc.it canbe overwritten permaterialif set inside the reflectin to another value.\nsupport for special c4d tiling shaders like c4d brick shader: shaders like the brick shader will render seamless over the border of the UV,even though the mapping is sampled by vray not c4d.\nvrscene output translate tab: detailed control like in V-ray maya for custom output of vrscene files\nmany times enhenced export for high polygon proxies: the sometimes in past lon &quot;vray compile&quot; time has been speed up by more than 1000% in the new vray core. ths makes the proxy 2 use even faster, even with very high count of very high polygon instances/proxies. (in some test from 25min to 7sec until render starts). originals of instances and proxies can now also be hidden without any drawbacks.\nnew bump material: the V-ray bump material allows you to add extra bump or normal mapping to brdf and sss2 materials.\nsupport of mesh lights in mb: previous it was not possible to include mesh light sin the mb calculations, this has been added.\nMAXON hair on particle traces supported: you can now use maxon hair with vray on traced particles for cool and ram efficient render effects via vray hair proceduals\nMAXON grass full color support: c4d grass now can use the color in all object types for most easiest use. it uses vray hair primitives to render fast and ram efficient. the color of the grass (root tip, etc) can al be samples via the vray hair brdf\nimproved support for camera path and LC flythrough modes: camera path of robject animation and LC flythrough(for some specal uses) are working more correct now\nambient light with dirt shader improvements: the popular setup of the vray ambient light and dirt shader to generate flicker free gi like setups has been improved. light intensity values are now directly taken, without the need to change the texture input\nDR support for brute force materials: vray can render selected material in brute force.this allows you to animate certain pars of the scene over an camera animation mode, or use lower gi settings global and render fine elements with highend pathtracing this method works now full as expected also over DR.\nNew ASCii IP list format (user wish): the IPL files for DR pool groups saving can now be edited directly y in txt editor ,to allow on the fly scripting for bigger studios\nNewest V-Ray core 2.55: we now use the same core as the latest maya service pack from may2014, beside many internal enhancements, this solved sometime visible SSS2 buckets,and pixel offsets in x,y camera offset feature. Chaosgroup also special added utf8 support for us c4d users.\nSupport for c4d content browser textures within .lib files: you can now use textures hidden in .lib files.note that using texture sin .lib files might cost soem extra time to extract them from,lib files( so always more efficient to use bitmaps direct from the disk)\nSupport for sub folders in search paths: nested folder structures are now supported. note that c4d searches textures with only one core, so using many search paths and or nestrd search paths can severely slow down render and interface (!), not only in V-Ray but overall c4d work.\nadded suport for some c4dcomp tag features, as result the unwanted small poly triangle in native MAXON hair render is not visible anymore\nVRay fur can now use shader and texture input as expected also on DR\n\nSystem Requirements\n\n-A computer (PC) with a licensed Maxon Cinema4d v11.5 - v15 installation. The VRAYforC4D license will be locked to the Maxon license it is bought for, like with most other Cinema4d plugins (please read the EULA in Manual for license details). At major Cinema4d updates like from v14 to v15, new license keys will be given out at no additional cost.\n\n-Supported OS: MicrosoftÂ® Windows 8, MicrosoftÂ® Windows 7 &amp; VistaÂ® Business (SP1 or higher), MicrosoftÂ® WindowsÂ® XP Professional (SP2 or higher), 32-bit or 64-bit versions (6+GB RAM and 64-bit is recommended) Intel Pentium III or compatible processor at 400 MHz minimum and SSE (intel core duo/ AMD Opteron or better recommended); for best performance at least 4 CPU cores and 2GB RAM per CPU core (at least 4GB minimum).\n\nLanguage : English\n\nHomepage :  &lt;a href=&quot;\nhttp://www.vray.com/vray_for_cinema_4d/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.vray.com/vray_for_cinema_4d/&lt;/a&gt;","torrent":{"xt":"urn:btih:5267bbb74b2458cd6ccf5a13838b62621b0c9b3a","amp;dn":"Vray+1.9+%2864+bit%29+%28for+C4D+R15%29+%28keygen+X-Force%29+%5BChingLiu%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5267bbb74b2458cd6ccf5a13838b62621b0c9b3a","infoHashBuffer":{"type":"Buffer","data":[82,103,187,183,75,36,88,205,108,207,90,19,131,139,98,98,27,12,155,58]},"announce":[],"urlList":[]}}