{
  "title": "Mathematics of the Financial Markets (2013) by Alain Ruttiens",
  "uid": 15870645,
  "size": 17082393,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:5278be81e88ed08397fae22c789da394595f10e2&amp;dn=Mathematics+of+the+Financial+Markets+%282013%29+by+Alain+Ruttiens&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 81,
  "leechers": 8,
  "uploader": "Dr.Soc",
  "files": 2,
  "time": 1474421366,
  "description": "Alain Ruttiens, &quot;Mathematics of the Financial Markets: Financial Instruments and Derivatives Modelling, Valuation and Risk Issues&quot;\r\n2013 | ISBN: 1118513452 | 350 pages | True PDF, EPUB | 16 MB\r\n\r\nThe book aims to prioritise what needs mastering and presents the content in the most understandable, concise and pedagogical way illustrated by real market examples. Given the variety and the complexity of the materials the book covers, the author sorts through a vast array of topics in a subjective way, relying upon more than twenty years of experience as a market practitioner. The book only requires the reader to be knowledgeable in the basics of algebra and statistics.\r\n\r\nThe Mathematical formulae are only fully proven when the proof brings some useful insight. These formulae are translated from algebra into plain English to aid understanding as the vast majority of practitioners involved in the financial markets are not required to compute or calculate prices or sensitivities themselves as they have access to data providers. Thus, the intention of this book is for the practitioner to gain a deeper understanding of these calculations, both for a safety reason – it is better to understand what is behind the data we manipulate – and secondly being able to appreciate the magnitude of the prices we are confronted with and being able to draft a rough calculation, aside of the market data.\r\n\r\nThe author has avoided excessive formalism where possible. Formalism is securing the outputs of research, but may, in other circumstances, burden the understanding by non-mathematicians; an example of this case is in the chapter dedicated to the basis of stochastic calculus.\r\n\r\nThe book is divided into two parts:\r\n\r\n- First, the deterministic world, starting from the yield curve building and related calculations (spot rates, forward rates, discrete versus continuous compounding, etc.), and continuing with spot instruments valuation (short term rates, bonds, currencies and stocks) and forward instruments valuation (forward forex, FRAs and variants, swaps &amp; futures);\r\n\r\n- Second, the probabilistic world, starting with the basis of stochastic calculus and the alternative approach of ARMA to GARCH, and continuing with derivative pricing: options, second generation options, volatility, credit derivatives;\r\n\r\n- This second part is completed by a chapter dedicated to market performance &amp; risk measures, and a chapter widening the scope of quantitative models beyond the Gaussian hypothesis and evidencing the potential troubles linked to derivative pricing models",
  "parsed": {
    "xt": "urn:btih:5278be81e88ed08397fae22c789da394595f10e2",
    "dn": "Mathematics of the Financial Markets (2013) by Alain Ruttiens",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "5278be81e88ed08397fae22c789da394595f10e2",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        82,
        120,
        190,
        129,
        232,
        142,
        208,
        131,
        151,
        250,
        226,
        44,
        120,
        157,
        163,
        148,
        89,
        95,
        16,
        226
      ]
    },
    "name": "Mathematics of the Financial Markets (2013) by Alain Ruttiens",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 49,
  "peers": 59,
  "last_updated": "2016-12-27T00:18:32.918Z"
}