{
  "title": "GTA Grand Theft Auto V (PC)",
  "uid": 14482869,
  "size": 63383863296,
  "categoryP": "games",
  "categoryS": "pc",
  "magnet": "?xt=urn:btih:52afb643744cd57030763420d7d2b45bf4d8d2d3&amp;dn=GTA+Grand+Theft+Auto+V+%28PC%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 205,
  "leechers": 318,
  "uploader": "annuaireweb",
  "files": 1,
  "time": 1462036989,
  "description": "Plateforme : PC\r\nFormat : ISO\r\nLangue : Multilanguage\r\n\r\nGTA 5 est le nouvel épisode de la célèbre série de Rockstar Games. L'histoire du jeu se déroulera à Los Santos, une ville inspirée de Los Angeles et l'on pourra visiblement incarner plusieurs personnages. La particularité de GTA V, c'est de proposer 3 personnages avec lesquels il sera possible de jouer. Michael, Franklin et Trevor sont donc les héros du jeu et le joueur pourra switcher d'un personne à un autre sans le moindre souci.\r\nMichael, celui que l’on voit de profil dans le premier trailer et qui surplombe la ville d’un regard assuré. La petite cinquantaine, marié avec deux enfants avec lesquels il a dû mal à se faire respecter, il possède l’une des plus belles villas des quartiers huppés de Los Santos. Piscine, jacuzzi, salle de sport, terrain de tennis et voitures de luxe, il a su placer intelligemment l’argent des braquages qu’il a réalisé lorsqu’il était plus jeune. S’il est aujourd’hui un ancien voyou rangé, il est devenu un père de famille lambda avec ses problèmes du quotidien. Lors de la démo du jeu, on a pu le voir prendre un bain de soleil au bord de sa piscine, habillé de sa chemise bleue et de son bermuda beige, avant de se lever et nous faire découvrir, claquettes aux pieds (et bruitages qui vont avec), les différentes pièces de sa prestigieuse demeure pour ensuite se diriger vers son garage, enfourcher le BMX de son fils et partir sillonner les quartiers de Los Santos. Une belle façon d’introduire un bout de la ville, avant de switcher vers Franklin, le deuxième personnage de la bande.\r\n\r\nInstructions pour installer le jeu:\r\n\r\n1. Télécharger le jeu.\r\n2. Graver ou monter l'image (Vous pouvez utiliser cet utilitaire de Slysoft).\r\n3. Installer le jeu\r\n4. Copier le contenu du dossier &quot;Crack&quot; dans le répertoire du jeu.\r\n5. Télécharger l'update 1 reloaded, décompressez l'archive puis installez le patch dans le dossier du jeu et Copier/Coller/remplacer dans le répertoire du jeu les fichiers du dossier crack.\r\n6. Vérifier que vous aviez les derniers pilotes pour la carte graphique.\r\n7. Jouer",
  "parsed": {
    "xt": "urn:btih:52afb643744cd57030763420d7d2b45bf4d8d2d3",
    "dn": "GTA Grand Theft Auto V (PC)",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "52afb643744cd57030763420d7d2b45bf4d8d2d3",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        82,
        175,
        182,
        67,
        116,
        76,
        213,
        112,
        48,
        118,
        52,
        32,
        215,
        210,
        180,
        91,
        244,
        216,
        210,
        211
      ]
    },
    "name": "GTA Grand Theft Auto V (PC)",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 523,
  "peers": 100,
  "last_updated": "2016-12-25T01:10:10.009Z"
}