{"title":"The Sultan and the Queen: Untold Story of Elizabeth and Islam","uid":15896956,"size":26400518,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5474aa2a096c2bb01ba20efe347be1fcabf5d103&amp;dn=The+Sultan+and+the+Queen%3A+Untold+Story+of+Elizabeth+and+Islam&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":57,"leechers":7,"uploader":"marty14","files":1,"time":1474819716,"description":"The Sultan and the Queen: The Untold Story of Elizabeth and Islam - Jerry Brotton [epub]\r\n\r\nLong before Thomas Jefferson confronted the Barbary Pirates, Queen Elizabeth sent a secret message to the Ottoman Sultan Murad II, inviting him to open his markets to her merchants and to embark on a pathbreaking new alliance. Islam and the West crossed paths much earlier than we think—and originally the Muslims had the upper hand.\r\n\r\nWhen Elizabeth was excommunicated by the pope in 1570, she found herself in an awkward predicament. England had always depended on trade. Now its key markets were suddenly closed to her Protestant merchants, while the staunchly Catholic king of Spain vowed to take her throne. In a bold decision with far-reaching consequences, she set her sights on the East. She sent an emissary to the shah of Iran, wooed the king of Morocco, and entered into an unprecedented alliance with the powerful Ottoman Sultan Murad III. \r\n\r\nThis marked the beginning of an extraordinary alignment with Muslim powers and of economic and political exchanges with the Islamic world of a depth not again experienced until the modern age. By the late 1580s, thousands of English merchants, diplomats, sailors, and privateers were plying their trade from Morocco to Persia. To finance these expeditions, they created the first ever joint stock company, a revolutionary new business model that balanced risk and reward.\r\n\r\nLondoners were gripped with a passion for the Orient. Elizabeth became hooked on sugar as new words like candy, turquoise, and tulip entered the English language. Marlowe offered up Tamburlaine and Shakespeare wrote Othello six months after the first Moroccan ambassador’s visit. Jerry Brotton reveals that Elizabethan England’s relationship with the Muslim world was far more amicable—and far more extensive—than we have ever appreciated as he tells the riveting story of the traders and adventurers who first went East to seek their fortunes","torrent":{"xt":"urn:btih:5474aa2a096c2bb01ba20efe347be1fcabf5d103","amp;dn":"The+Sultan+and+the+Queen%3A+Untold+Story+of+Elizabeth+and+Islam","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5474aa2a096c2bb01ba20efe347be1fcabf5d103","infoHashBuffer":{"type":"Buffer","data":[84,116,170,42,9,108,43,176,27,162,14,254,52,123,225,252,171,245,209,3]},"announce":[],"urlList":[]}}