{
  "title": "Star Wars Empire at War Gold Pack",
  "uid": 4230052,
  "size": 3070140882,
  "categoryP": "games",
  "categoryS": "pc",
  "magnet": "?xt=urn:btih:548553d8e56469826c763a02ac932b652dd9e07d&amp;dn=Star+Wars+Empire+at+War+Gold+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 100,
  "leechers": 8,
  "uploader": "Tarnowsky",
  "files": 1,
  "time": 1213007006,
  "description": "**CAUTION**\nDo not use z321z's crack. I believe it's a fake. The one I have is a virus-free working crack. (The link is below)\n\n\nREAD THE INSTRUCTIONS CAREFULLY!\n\n\n\n\n\n**Star Wars Empire at War Gold Pack**\nIncludes both Star Wars Empire at war &amp; Forces of Corruption.\n\n\n*|Instructions|*\n\n- Extract archive\n\n- Burn EAWGold (Size 2.85GB) or mount using DAEMON Tools (Daemon Tools installer is included)\n\n- Use the serial cd44-a63-ddb-9ac7-na20 for Empire at War\n  and cd44-a68-7fa-defc-na20 for Forces of Corruption.\n\n- Have fun!\n\n- Download the crack to be able to play the game at &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/4259827/Star_Wars_Empire_at_War_Gold_Edition_CRACK&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/4259827/Star_Wars_Empire_at_War_Gold_Edition_CRACK&lt;/a&gt;\n\nThis crack should fix the &quot;Original disc could not be found or authenticated&quot; error and let you play the game.\n\n- UPDATE : If you have Windows Vista or Windows 7 and Forces of Corruption doesn't start up, but Empire at War does. You'll need a patch to allow you to play. &lt;a href=&quot;\nhttp://www.filefront.com/12955025/FoC-Vista-Patch-Unofficial/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.filefront.com/12955025/FoC-Vista-Patch-Unofficial/&lt;/a&gt; Use this patch. Although it says Vista, it'll work with Windows 7 (I had to do it in order for it to work)\n\n\n**INFO**\n\nStar Wars: Empire at War puts the power to command an entire war for the Star Wars galaxy in the hands of players, giving them the freedom to determine how they play the game within the completely scalable and accessible gameplay. Set a few years before the events of Episode IV A New Hope, LucasArts new PC game lets players wage war on ground and in space, as well as experience the creation of the Rebel Alliance, the strengthening of the Empire and the beginnings of the Galactic Civil War.\n\nUsing an entirely new game engine created by the Las Vegas-based developer Petroglyph, Empire at War features beautifully rendered land and space battles set on memorable planets such as Yavin IV, Tatooine and Dagobah, as well as never-before-seen environments taken directly from the Star Wars films and expanded universe novels. In the game, players choose to join either the Rebel Alliance or the Galactic Empire, building and setting up tactical forces to unleash upon the enemy in real-time 3D. Memorable Star Wars hero characters can be brought into the action to help turn the tide of the battle as players build, manage and upgrade their space and ground-based units, vehicles, troops and base structures. \n\nWage war on ground and in space battle it out in space and then send down your remaining forces to invade the planet.\n \nAll action is persistent every decision affects the next battle and, ultimately, the fate of the galaxy. Play out your own personal version of Episode IV: A New Hope.\n \nReal-time strategy (RTS) 3D gameplay set in more than 40 ground and space locations including Yavin IV, Tatooine and Dagobah - each has its own specific advantage and/or resource.\n \nConstruct ground and space structures, including space stations, factories and ion cannons.\n\nDeploy ground and space vehicles from giant Star Destroyers and AT-ATs to swift speeder bikes and X-wings.\n \nAccess a variety of ground troops including stormtroopers and Rebel soldiers. Hero characters like Obi-Wan Kenobi and Darth Vader can be brought into key battles.\n \nUnique mission objectives such as rescues, sabotage, blockades and destruction.\n \nBegins several years before the events of Episode IV: A New Hope, including vehicles and locations from both the classic timeframe and Episode III.\n \nPlay as the Rebels as they amass their forces and work to thwart the plans of the Empire, or serve the Empire and crush the Rebellion at its roots.\n \nDestroy the Death Star or use it as the ultimate power in the universe.\n \nInnovative multiplayer campaign mode lets two players battle for the galaxy and save games in progress. Up to eight players can compete in online skirmish modes.\n \nAll-new game engine created by Las Vegas-based developer Petroglyph, composed of industry veterans responsible for classic RTS titles, including the Command &amp; Conquer series. \n\n\n**RATING**\n\nOverall \nArtificial Intelligence (AI)-(7.0) \nChallenge--------------------(10.0) \nGraphics/Animation-----------(9.0) \nInterface--------------------(9.0) \nSound------------------------(9.0) \nStoryline--------------------(10.0) \nOVERALL (10.0)\n\nRating and INFO from\n &lt;a href=&quot;\nhttp://www.gamestop.com/Catalog/ProductDetails.aspx?product_id=66224&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.gamestop.com/Catalog/ProductDetails.aspx?product_id=66224&lt;/a&gt;\n\nTHIS IS A MUST FOR ALL STAR WARS FANS!",
  "parsed": {
    "xt": "urn:btih:548553d8e56469826c763a02ac932b652dd9e07d",
    "dn": "Star Wars Empire at War Gold Pack",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "548553d8e56469826c763a02ac932b652dd9e07d",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        84,
        133,
        83,
        216,
        229,
        100,
        105,
        130,
        108,
        118,
        58,
        2,
        172,
        147,
        43,
        101,
        45,
        217,
        224,
        125
      ]
    },
    "name": "Star Wars Empire at War Gold Pack",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 57,
  "peers": 92,
  "last_updated": "2016-12-27T00:31:31.342Z"
}