{
  "title": "The Sleep Revolution Transforming Your Life, One Night at a Time",
  "uid": 15719679,
  "size": 1459694,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:54e445ef7a9922550094dbd94e464b37d48cf9d0&amp;dn=The+Sleep+Revolution+Transforming+Your+Life%2C+One+Night+at+a+Time&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 40,
  "leechers": 0,
  "uploader": "shtihl22",
  "files": 1,
  "time": 1472664887,
  "description": "**********Description***********\r\n\r\n\r\nThe Sleep Revolution: Transforming Your Life, One Night at a Time by Arianna Huffington\r\nEnglish | 2016 | Non-Fiction, Self Help | 1.4 MB\r\n\r\n\r\nWe are in the midst of a sleep deprivation crisis, writes Arianna Huffington, the co-founder and editor in chief of The Huffington Post. And this has profound consequences – on our health, our job performance, our relationships and our happiness. What is needed, she boldly asserts, is nothing short of a sleep revolution. Only by renewing our relationship with sleep can we take back control of our lives.\r\nIn her bestseller Thrive, Arianna wrote about our need to redefine success through well-being, wisdom, wonder, and giving. Her discussion of the importance of sleep as a gateway to this more fulfilling way of living struck such a powerful chord that she realized the mystery and transformative power of sleep called for a fuller investigation.\r\nThe result is a sweeping, scientifically rigorous, and deeply personal exploration of sleep from all angles, from the history of sleep, to the role of dreams in our lives, to the consequences of sleep deprivation, and the new golden age of sleep science that is revealing the vital role sleep plays in our every waking moment and every aspect of our health – from weight gain, diabetes, and heart disease to cancer and Alzheimerâ™s.\r\nIn The Sleep Revolution, Arianna shows how our cultural dismissal of sleep as time wasted compromises our health and our decision-making and undermines our work lives, our personal lives — and even our sex lives. She explores all the latest science on what exactly is going on while we sleep and dream. She takes on the dangerous sleeping pill industry, and all the ways our addiction to technology disrupts our sleep. She also offers a range of recommendations and tips from leading scientists on how we can get better and more restorative sleep, and harness its incredible power.\r\nIn todayâ™s fast-paced, always-connected, perpetually-harried and sleep-deprived world, our need for a good nightâ™s sleep is more important – and elusive — than ever. The Sleep Revolution both sounds the alarm on our worldwide sleep crisis and provides a detailed road map to the great sleep awakening that can help transform our lives, our communities, and our world.\r\n\r\n=======================================\r\n \nhttps://thepiratebay.org/user/shtihl22\r\n\r\n=======================================",
  "parsed": {
    "xt": "urn:btih:54e445ef7a9922550094dbd94e464b37d48cf9d0",
    "dn": "The Sleep Revolution Transforming Your Life, One Night at a Time",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "54e445ef7a9922550094dbd94e464b37d48cf9d0",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        84,
        228,
        69,
        239,
        122,
        153,
        34,
        85,
        0,
        148,
        219,
        217,
        78,
        70,
        75,
        55,
        212,
        140,
        249,
        208
      ]
    },
    "name": "The Sleep Revolution Transforming Your Life, One Night at a Time",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 30,
  "peers": 16,
  "last_updated": "2016-12-27T00:34:01.870Z"
}