{"title":"Defiance season 1 complete","uid":8664621,"size":5010502342,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:55b369f2b56edb54c772599cbd914340e3462a0d&amp;dn=Defiance+season+1+complete&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":223,"leechers":119,"uploader":"Mishuiancu","files":12,"time":1373387517,"description":"The series is set in the near future, where aliens known collectively as Votans have come to Earth seeking a new home after their solar system was destroyed. However, when they reached Earth, they discovered despite a prolonged negotiation with the government on Earth, they were not welcome. Rather than turn away, they began a war with the humans as they are determined to make Earth their new home. During the war, the Votans dropped terraformers on the planet and transformed the surface; scorching the earth, opening chasms in the ground and covering the surface of the planet in dust and debris. After decades of war, a ceasefire is declared when both sides realise they must focus on survival on this new almost alien planet. The series largely revolves around the character of Jeb Nolan. Jeb was only ten years old when the Votans arrived and he served in the military during the war. With the war now over, he returns to his hometown of St Louis to find it's is no longer the city he left; it is little more than refugee camp. Deciding his services are needed, Jeb takes up a position as the Chief Lawkeeper in Defiance, so he can protect the town from dangerous clashes between humans, aliens, military scavengers and other dangerous visitors who occasionally enter the town ","torrent":{"xt":"urn:btih:55b369f2b56edb54c772599cbd914340e3462a0d","amp;dn":"Defiance+season+1+complete","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55b369f2b56edb54c772599cbd914340e3462a0d","infoHashBuffer":{"type":"Buffer","data":[85,179,105,242,181,110,219,84,199,114,89,156,189,145,67,64,227,70,42,13]},"announce":[],"urlList":[]}}