{
  "title": "Papers, Please (+ v1.0.37 Update &amp; Extras)-GOG",
  "uid": 8824859,
  "size": 42212243,
  "categoryP": "games",
  "categoryS": "pc",
  "magnet": "?xt=urn:btih:569144204ae709fea5287efe206178519c75fc9f&amp;dn=Papers%2C+Please+%28%2B+v1.0.37+Update+%26amp%3B+Extras%29-GOG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 52,
  "leechers": 0,
  "uploader": "AN0NYMOUS142857",
  "files": -1,
  "time": 1376820055,
  "description": "Papers, Please, is an indie puzzle video game by Lucas Pope, focusing on the emotional toll of working as an immigration officer, deciding whom to let in and whom to exclude from entering the fictional communist country of Arstotzka. The game was released on August 8, 2013 for Windows and OS X.\n\nThe gameplay of Papers, Please focuses on the work life of an immigration inspector at a border checkpoint for the fictitious Eastern Bloc country of Arstotzka. The player inspects would-be immigrants' documents and uses a sparse array of tools to determine whether the papers are in order for the purpose of keeping spies, smugglers and other unwanted individuals out of the country. At the end of each in-game day, the player earns money based on how many immigrants they processed less any penalties for mistakes, and then must decide on a simple budget to spend that money on rent, food, heat, and other necessities in low-class housing for themselves and their family. As relations between Arstotzka and nearby countries deteriorate due to multiple terrorist attacks, each day introduces a new set of rules for immigration based on the game's story, such as denying citizens of specific countries or demanding more exacting identification from citizens. The player may be challenged with moral dilemmas as the game progresses, such as allowing the spouse of one immigrant through despite them lacking complete papers. The game has a scripted story mode with multiple possible endings, as well as an unlockable, randomized endless-play mode.\n\nThis includes the v1.0.37 update (v2.0.2.6 in GOG's system), and relevant Extras.\n",
  "parsed": {
    "xt": "urn:btih:569144204ae709fea5287efe206178519c75fc9f",
    "dn": "Papers, Please (  v1.0.37 Update &amp; Extras)-GOG",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "569144204ae709fea5287efe206178519c75fc9f",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        86,
        145,
        68,
        32,
        74,
        231,
        9,
        254,
        165,
        40,
        126,
        254,
        32,
        97,
        120,
        81,
        156,
        117,
        252,
        159
      ]
    },
    "name": "Papers, Please (  v1.0.37 Update &amp; Extras)-GOG",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 52,
  "peers": 7,
  "last_updated": "2016-12-25T01:35:06.676Z"
}