{
  "title": "Manu Chao - Clandestino + Proxima Estacion...Esperanza@320",
  "uid": 4251688,
  "size": 355109158,
  "categoryP": "audio",
  "categoryS": "music",
  "magnet": "?xt=urn:btih:571bff184f63ab625fbc2e679f8c47629b1ff0b7&amp;dn=Manu+Chao+-+Clandestino+%2B+Proxima+Estacion...Esperanza%40320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 95,
  "leechers": 9,
  "uploader": "alekow1",
  "files": 60,
  "time": 1214046635,
  "description": "1. Manu Chao - Clandestino\n\nAs one of the driving forces in the French-Spanish ethno-punk band Mano Negra, songwriter-guitarist Chao delivers a surprising solo endeavor. Centered around a simple editorial writing style and an acoustic guitar, this album chronicles his political and personal travels around the world, studying the foibles of life in Latin America and the Caribbean, through Africa and back to Europe. He quotes but never actually plays salsa, son, reggae, Latin pop, and African folk music, all to the service of his songs (written and sung in English, French, and Spanish). The backing is a deceptive hodgepodge of guest artists and collected sounds he has pasted together to service the simple songs he sings. There is a circuslike feel to the whole project, a childlike sense of wonder coupled with a cynical and sometimes sly glance at the \\&quot;real world.\\&quot; This is a single piece of work, each song bleeding into the next without stopping, a train ride that slows at each station along the way but never stops. It has charm, wit, and depth--a rare and potent combination of virtues for a pop musician. --Louis Gibson (Amazon).\n\n\n\n01. Clandestino                                                  \n02. Desaparecido                                                \n03. Bongo Bong                                                  \n04. Je Ne T\\&amp;#039;aime Plus                                            \n05. Mentira                                                      \n06. Lagrimas De Oro                                              \n07. Mama Call                                                    \n08. Luna Y Sol                                                  \n09. Por El Suelo                                                \n10. Welcome To Tijuana                                          \n11. Dia Luna... Dia Pena                                        \n12. Malegria                                                    \n13. La Vie A 2                                                  \n14. Minha Galera                                                \n15. La Despedida                                                \n16. El Viento\n\n\n\nLabel: Virgin France S.A.\nReleased: 1998\n\n\n\n\n\n2. Manu Chao - Proxima Estacion...Esperanza\n\nProxima Estacion: Esperanza translates as Next Stop: Hope, with Chao articulating his feelings of rootless travelling\\&amp;#039;s attendant potential for ups and downs. He should know, after having only recently put down cautious roots in Barcelona. Before that, after disbanding Mano Negra in 1995, he\\&amp;#039;d been almost constantly road-bound. 1998s Clandestino solo debut was one of the absolute cross-genre classics of the last decade, its blur of short songs prompted by Chao\\&amp;#039;s persistent globe-trawling, coming across like a postcard collage of melodies, modes, found sounds and even languages. Chao continues the cultural kaleidoscope approach towards songwriting, even directly quoting from Clandestino at several key points. His vocals jump from Spanish to English, French to Arabic, then into a Portunol (Portuguese/Spanish) jumble, sometimes lurching lingos in the space of a single verse. Chao\\&amp;#039;s guitaring mixes reggae choppiness with Hawaiian-slide purity, his natural knack for phonetic rhythms also highly impressive, particularly when he\\&amp;#039;s jogging and skipping out his ska-inspired verses. All the while, he\\&amp;#039;s dropping in crackled bursts of globalised sound effects, sneaking these beside his ramshackle backing chorus chaos, or maybe disrupting a bullying street brass arrangement, or tweaking one of his gut-infiltrating basslines. Listen to the cascading vocals of \\&quot;Eldorado 1997\\&quot;, the accelerated cartoon ska of \\&quot;Promiscuity\\&quot;, the lunatic swing of \\&quot;Trapped By Love\\&quot; or the perverted cabaret oompah of \\&quot;Papito\\&quot;, each song weaving into the next, the mulching getting ever more manic as this album races towards its climax. --Martin Longley (Amazon).\n\n\n\n\n01. Merry Blues                                                  \n02. Bixo                                                        \n03. Eldorado 1997                                                \n04. Promiscuity                                                  \n05. La Primavera                                                \n06. Me Gustas Tu                                                \n07. Denia                                                        \n08. Mi Vida                                                      \n09. Trapped By Love                                              \n10. Le Rendez-Vous                                              \n11. Mr Bobby                                                    \n12. Papito                                                      \n13. La Chinita                                                  \n14. La Marea                                                    \n15. Homens                                                      \n16. La Vacaloca                                                  \n17. Infinita Tristeza  \n\n\n\nLabel: Virgin France S.A.\nReleased: 2001\n\n\n\nBITRATE: 320\n\nMy cd-rip (EAC and Lame)\nCovers Included\n\n\nEnjoy,Seed and Share ",
  "parsed": {
    "xt": "urn:btih:571bff184f63ab625fbc2e679f8c47629b1ff0b7",
    "dn": "Manu Chao - Clandestino   Proxima Estacion...Esperanza@320",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "571bff184f63ab625fbc2e679f8c47629b1ff0b7",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        87,
        27,
        255,
        24,
        79,
        99,
        171,
        98,
        95,
        188,
        46,
        103,
        159,
        140,
        71,
        98,
        155,
        31,
        240,
        183
      ]
    },
    "name": "Manu Chao - Clandestino   Proxima Estacion...Esperanza@320",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 104,
  "peers": 38,
  "last_updated": "2016-12-25T01:38:09.214Z"
}