{"title":"Assassins.Creed.III.Proper-RELOADED","uid":15964261,"size":413446233,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:575ababa2c39d4149d74be83b48545332b5490d9&amp;dn=Assassins.Creed.III.Proper-RELOADED&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":437,"leechers":55,"uploader":"4phishindavel1","files":1,"time":1475707273,"description":"\n\r\n\r\nnERv\r\n\r\nAssassins Creed III (c) Ubisoft\r\n\r\n11/2012 :..... RELEASE.DATE .. PROTECTION .......: Ubisoft DRM\r\n1 :.......... DISC(S) .. GAME.TYPE ........: Action\r\n\r\nNOTE:\r\n- Skidrow's release doesn't work with the most recent version of Uplay\r\n- Uplay is not required for this release\r\n- Limited multiplayer features are included(training, wolfpack mode)\r\n\r\nThe American Colonies, 1775. A brave young warrior fights to save his\r\nhomeland. But what begins as a struggle over territory turns into an\r\nextraordinary journey that will transform him into a Master Assassin\r\none that will forever change the destiny of a newborn nation.\r\n\r\nYou are Connor, warrior son of a Native American mother and British\r\nfather. As the colonies draw closer to revolution, you will dedicate\r\nyour life to the freedom of your clan, becoming the spark that ignites\r\nthe revolution into a full blaze. Your crusade will lead you through\r\nblood-soaked battlefields and through crowded city streets, to the\r\nperilous wilderness and beyond. You will not only witness historyyou\r\nwill make it.\r\n\r\nExperience the hidden truth behind one of historys most influential\r\nwars: the American Revolution. Unleash lethal new skills and weapons,\r\nand experience a stunningly realistic world created by Anvil Next, a new\r\nengine that redefines gaming. Welcome to an entirely new chapter in the\r\nAssassins unforgettable saga\r\n\r\nKey Features\r\n\r\nA NEW MASTER ASSASSIN  As Connor, a Native American Assassin, unleash\r\nyour predatory instincts to stalk your enemies and devastate them with\r\nnew weapons including tomahawks, rope darts, firearms and more.\r\n\r\nIGNITE THE FIRES OF REVOLUTION  Fighting from Lexington to Bunker Hill,\r\nyou are Americas first highly trained Master Assassin. Incite the\r\nrevolution by working behind the scenes along with historical icons like\r\nGeorge Washington, Benjamin Franklin and more.\r\n\r\nEXPLORE A BRAVE NEW WORLD  Pursue your enemies through massive\r\nenvironments, from bustling city streets to blood-soaked battlefields,\r\nand into the far reaches of the American frontier.\r\n\r\nSTUNNING NEW ENGINE  Experience the power of Anvil Next, Ubisofts new\r\nengine designed for Assassins Creed III. Revolutionary physics,\r\nanimation and weather systems deliver unprecedented realism, while a\r\nwhole-new combat system delivers more intense, gut-wrenching battles\r\nthan ever before.\r\n\r\nINTENSE MULTIPLAYER  The acclaimed multiplayer system returns with a\r\nhost of refinements, including all-new characters, maps and modes to\r\ndeliver the most compelling online experience yet.\r\n\r\nURL: http://store.steampowered.com/app/208480/\r\n\r\n1. Unrar.\r\n2. Burn or mount the image.\r\n3. Install the game.\r\n4. Copy the content from /Crack directory on the DVD to the install\r\ndirectory of the game, overwriting existing files.\r\n5. Before you start the game, use your firewall to block all exe files\r\nin the games install directory from going online.\r\n6. Play the game.\r\n7. Support the software developers. If you like this game, BUY IT","torrent":{"xt":"urn:btih:575ababa2c39d4149d74be83b48545332b5490d9","amp;dn":"Assassins.Creed.III.Proper-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"575ababa2c39d4149d74be83b48545332b5490d9","infoHashBuffer":{"type":"Buffer","data":[87,90,186,186,44,57,212,20,157,116,190,131,180,133,69,51,43,84,144,217]},"announce":[],"urlList":[]}}