{
  "title": "The Basics of Hacking and Penetration Testing 2E, 2013 [Epub]",
  "uid": 8922514,
  "size": 3786181,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:589188bf0ac288e1ee5381a19cc0ecc4875e03d4&amp;dn=The+Basics+of+Hacking+and+Penetration+Testing+2E%2C+2013+%5BEpub%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 54,
  "leechers": 1,
  "uploader": "F1restorm",
  "files": -1,
  "time": 1379287783,
  "description": "The Basics of Hacking and Penetration Testing: Ethical Hacking and Penetration Testing Made Easy\nSecond Edition\nAuthor: Patrick Engebretson\nPublished: August 15, 2013\nPublisher: Syngress\nISBN: 9780124116443 \nFormat: Retail Epub\nReaders: Adobe Digital Editions, Calibre, MoonReader for Android etc\nTested on laptop and Android tablet with no issues.\n_______________________________________________________________________________\nThe Basics of Hacking and Penetration Testing, 2nd Ed. serves as an introduction to the steps required to complete a penetration test or perform an ethical hack from beginning to end. No prior hacking experience is needed. You will learn how to properly utilize and interpret the results of modern day hacking tools, which are required to complete a penetration test. Tool coverage includes Backtrack and Kali Linux, Google reconnaissance, MetaGooFil, DNS interrogation, Nmap, Nessus, Metasploit, the Social Engineer Toolkit (SET) , w3af, Netcat, post exploitation tactics, the Hacker Defender rootkit, and more. The book provides a simple and clean explanation of how to effectively utilize the tools and introduces a four-step methodology for conducting a penetration test or hack. You will be provided with the know-how required to jump start your career or gain a better understanding of offensive security. The book walks through each of the steps and tools in a structured, orderly manner, allowing readers to understand how the output from each tool can be fully utilized in the subsequent phases of the penetration test. This process allows readers to clearly see how the tools and phases function and relate.\n\nThe second edition includes updated information covering Kali Linux as well as focusing on the seminal tools required to complete a penetration test \nNew tools added including the Social Engineer Toolkit, Meterpreter, w3af and more!\nEach chapter contains hands-on examples and exercises that are designed to teach you how to interpret the results and utilize those results in later phases\nWritten by an author who works in the field as a Penetration Tester and who teaches Offensive Security, Penetration Testing, and Ethical Hacking, and Exploitation classes at Dakota State University.\n",
  "parsed": {
    "xt": "urn:btih:589188bf0ac288e1ee5381a19cc0ecc4875e03d4",
    "dn": "The Basics of Hacking and Penetration Testing 2E, 2013 [Epub]",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "589188bf0ac288e1ee5381a19cc0ecc4875e03d4",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        88,
        145,
        136,
        191,
        10,
        194,
        136,
        225,
        238,
        83,
        129,
        161,
        156,
        192,
        236,
        196,
        135,
        94,
        3,
        212
      ]
    },
    "name": "The Basics of Hacking and Penetration Testing 2E, 2013 [Epub]",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 84,
  "peers": 26,
  "last_updated": "2016-12-27T00:57:14.090Z"
}