{
  "title": "PC Cleaner Pro 2016 14.0.16.1.11 + Keys [4realtorrentz]",
  "uid": 13284751,
  "size": 5172929,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:5968a3e127127d37316610350bf13b32fcf8bd3f&amp;dn=PC+Cleaner+Pro+2016+14.0.16.1.11+%2B+Keys+%5B4realtorrentz%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 42,
  "leechers": 1,
  "uploader": "menin1",
  "files": 1,
  "time": 1453526607,
  "description": "We believe computers are meant to speed things up, not slow things down, so you can work smarter and faster. That’s why we engineered PC Cleaner to provide outstanding antivirus and antispyware protection, and PC optimization tools that works quietly and efficiently, without slowing your PC down like other bloated security products.\r\n\r\nKey Features:\r\n\r\n- Registry Cleaner\r\nPC Cleaner will remove unused and old entries, including File Extensions, ActiveX Controls, ClassIDs, ProgIDs, Uninstallers, Shared DLLs, Fonts, Help Files, Application Paths, Icons, Invalid Shortcuts and more.\r\n- Increase Your PC’s Performance\r\nPC optimization is the quickest way to adjust your system settings at once. PC Cleaner will analyze your system &amp; adjust your PC to function at its maximum potential performance.\r\n- Boost Your PC’s Speed\r\nPC Cleaner will tweak your complete system to help boost your PC speed and overall system performance. You could have faster downloads, uploads, web surfing and more.\r\n- Certified Virus + Spyware Protection\r\nCertified Antivirus Pro will scan your complete system for malicious threats including: viruses, spyware,. rogue programs, trojans, adware, rootkit, dialers, worms, parasites and other potentially harmful programs that may be installed on your computer.\r\n- Security Defense\r\nPC Cleaner will scan and check for windows vulnerablities within Windows system. Windows Update is a service provided by Microsoft. Security updates or critical updates protect against vulnerabilities to malware and security exploits.\r\n- Clean Your System\r\nIn using a computer from day to day you’re going to accumulate system clutter. You can significantly increase your PC performance &amp; stability by removing these files.\r\n- Privacy Protection\r\nPC Cleaner is designed to protect you by cleaning up all the unwanted history data on your computer which could also put you at risk of identity theft.\r\n- Internet Optimizer\r\nPC Cleaner will automatically adjust your internet connections to increase super fast web surfing, faster downloads including: music , movies games and video downloads.\r\n- System Optimizer\r\nPC System Optimizer is the fastest way to adjust all your system settings at once. The PC Optimizer works by determining what type of PC you have and what programs you have installed. Then it will adjust system settings so that your machine will function at its maximum capacity.\r\n- Memory Optimizer\r\nPC Cleaner will optimize your memory and recover wasted memory (RAM), space and improve system performance.\r\n- Startup Manager\r\nStartup Manger allows you control of what programs are launched when you start your computer. You can disable unnecessary programs that are slowing you down.\r\n- Uninstall Manager\r\nThis feature lets you easily uninstall applications that you don’t want you your computer.\r\n\r\nInstructions:\r\n\r\n1. Disconnect from internet\r\n2. Unpack and install\r\n3. Use a given key to register\r\n4. Block all out going connections with firewall or add the following entry into hosts file:\r\n5. 127.0.0.1 pc-cleaners.com\r\n6. Done",
  "parsed": {
    "xt": "urn:btih:5968a3e127127d37316610350bf13b32fcf8bd3f",
    "dn": "PC Cleaner Pro 2016 14.0.16.1.11   Keys [4realtorrentz]",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "5968a3e127127d37316610350bf13b32fcf8bd3f",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        89,
        104,
        163,
        225,
        39,
        18,
        125,
        55,
        49,
        102,
        16,
        53,
        11,
        241,
        59,
        50,
        252,
        248,
        189,
        63
      ]
    },
    "name": "PC Cleaner Pro 2016 14.0.16.1.11   Keys [4realtorrentz]",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 100,
  "peers": 91,
  "last_updated": "2016-12-27T01:03:03.278Z"
}