{"title":"Dayz Standalone multiplayer PC game ^^nosTEAM^^","uid":11890035,"size":10332561566,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:59cb6370e373586d7c114cd9bc291a3dad1dd70e&amp;dn=Dayz+Standalone+multiplayer+PC+game+%5E%5EnosTEAM%5E%5E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":171,"leechers":49,"uploader":"nosTEAM","files":6,"time":1430961767,"description":"About the game:\n\nDayZ is a MMO open world survival horror video game in development by Bohemia Interactive and the stand-alone version of the award-winning mod of the same name.\nThe goal of DayZ is to stay alive and healthy during the conditions of the zombie apocalypse that have befallen the in-game world.\nThe player begins equipped with only simple clothes and a flashlight, and must begin exploring the large 225km2 landscape of fictional former Soviet Republic Chernarus\nto investigate locations such as houses, barns, and apartments to scavenge supplies.\nThese supplies include food and water, which are basic keys to prolonging the player's life.\nBeyond the bare bones of survival, players can find various forms of clothing, which not only allow the player to customize their character,\nbut can bring the benefit of extra storage space for supplies and warmth.\nAlso scattered around the map are a variety of weapons, allowing players to protect themselves from zombies or other players if necessary......\n\n\nPC System Requirements\nMinimum:\nOS: Windows Vista SP2 / Windows 7 SP1 / 8 / 8.1\nProcessor: Intel Dual-Core 2.4 GHz or AMD Dual-Core Athlon 2.5 GHz\nMemory: 2 GB RAM\nGraphics: NVIDIA GeForce GT 440 or AMD Radeon HD 5850 or Intel HD Graphics 4000 with 512 MB VRAM\nDirectX: Version 11\nHard Drive: 12 GB available space\n\n\n\nNotes:\nThis version of game is already cracked - just install and play.\nYou can change PlayerName in file LumaEmu.ini from game folder after install is done.\nTo play online: open game from desktop shortcut and hit &quot;Play&quot; button\nIf you want to play on other servers: click &quot;Change Server&quot; button . click &quot;Remote&quot; button and fill input data with a new server IP and port then click OK.\n\nHow to install:\nAfter download is done:\n- open part1 (executable file) ,\n- choose location ,\n- click install ,\n- wait until is done\n- play game from desktop shortcut.\n\nIf you like this game torrent seed it to others.\nEnjoy","torrent":{"xt":"urn:btih:59cb6370e373586d7c114cd9bc291a3dad1dd70e","amp;dn":"Dayz+Standalone+multiplayer+PC+game+%5E%5EnosTEAM%5E%5E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59cb6370e373586d7c114cd9bc291a3dad1dd70e","infoHashBuffer":{"type":"Buffer","data":[89,203,99,112,227,115,88,109,124,17,76,217,188,41,26,61,173,29,215,14]},"announce":[],"urlList":[]}}