{
  "title": "How to Catch a Russian Spy (2015) Naveed Jamali, Ellis Henican",
  "uid": 15877150,
  "size": 1371167,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:5a62d8751a46b62fb1911f5780bf34a13d2d110d&amp;dn=How+to+Catch+a+Russian+Spy+%282015%29+Naveed+Jamali%2C+Ellis+Henican&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 39,
  "leechers": 3,
  "uploader": "Dr.Soc",
  "files": 1,
  "time": 1474535574,
  "description": "How to Catch a Russian Spy: The True Story of an American Civilian Turned Double Agent by Naveed Jamali, Ellis Henican\r\n2015 | ISBN: 1476788820 | English | 304 pages | EPUB | 1 MB\r\n\r\nThe fascinating story of a young American amateur who helped the FBI bust a Russian spy in New York—sold in ten countries and in a major deal to 20th Century Fox.\r\n\r\nFor three nerve-wracking years, Naveed Jamali spied on America for the Russians, trading thumb drives of sensitive technical data for envelopes of cash, selling out his own beloved country across noisy restaurant tables and in quiet parking lots. Or so the Russians believed. In fact, this young American civilian was a covert double agent working with the FBI. The Cold War wasn’t really over. It had just gone high-tech.\r\n\r\nHow to Catch a Russian Spy is the one-of-a-kind story of how one young man’s post-college adventure became a real-life US counter-intelligence coup. He had no previous counter-espionage experience. Everything he knew about undercover work, he’d learned from Miami Vice and Magnum P.I. reruns and movies like Ronin, Spy Game, and anything with Bond or Bourne in the title. And yet, hoping to gain experience to become a Navy intelligence officer, he convinced the FBI and the Russians they could trust him. With charm, cunning, and a big load of naiveté, he matched wits with a veteran Russian military-intelligence officer who was recruiting spies on American soil, out-maneuvering the Russian spy and his secret-hungry superiors. Along the way, Jamali and his FBI handlers cast a rare light on espionage activities at the Russian Mission to the United Nations in New York and earned a solid US win in the escalating hostilities between Moscow and Washington.\r\n\r\nNow, Jamali reveals the whole engaging story behind his double-agent adventure—from coded signals on Craigslist to the Russian spy’s propensity for Hooters’ Buffalo wings. Cinematic, news-breaking, and wildly entertaining, How to Catch a Russian Spy is an armchair spy fantasy brought to life. Film rights sold to 20th Century Fox for director Marc Webb (The Amazing Spider-Man, 500 Days of Summer)",
  "parsed": {
    "xt": "urn:btih:5a62d8751a46b62fb1911f5780bf34a13d2d110d",
    "dn": "How to Catch a Russian Spy (2015) Naveed Jamali, Ellis Henican",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "5a62d8751a46b62fb1911f5780bf34a13d2d110d",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        90,
        98,
        216,
        117,
        26,
        70,
        182,
        47,
        177,
        145,
        31,
        87,
        128,
        191,
        52,
        161,
        61,
        45,
        17,
        13
      ]
    },
    "name": "How to Catch a Russian Spy (2015) Naveed Jamali, Ellis Henican",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 42,
  "peers": 18,
  "last_updated": "2016-12-25T01:59:59.287Z"
}