{
  "title": "How to Make a Spaceship (2016) (Epub) Gooner",
  "uid": 15884552,
  "size": 23367733,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:5a623d8ae122fc74c0f6237546b8f69d039e0ef6&amp;dn=How+to+Make+a+Spaceship+%282016%29+%28Epub%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 86,
  "leechers": 9,
  "uploader": "GoonerTPB",
  "files": 2,
  "time": 1474637847,
  "description": "How to Make a Spaceship - A Band of Renegades, an Epic Race and the Birth of Private Space Flight (2016) (Epub) Gooner\r\n\r\nPublisher: Bantam Press (22 Sept. 2016)\r\nLanguage: English\r\nISBN-10: 0593078284\r\nISBN-13: 978-0593078280\r\n\r\nAfterword by Professor Stephen Hawking\r\n\r\n&quot;Reads like a thriller - and reveals many secrets... one of the great entrepreneurial stories of our time&quot; (Washington Post)\r\n\r\nAlone in a spartan black cockpit, test pilot Mike Melvill rocketed toward space. He had eighty seconds to exceed the speed of sound and begin the climb to a target no civilian pilot had ever reached. He might not make it back alive. If he did, he would make history as the world's first commercial astronaut.\r\n\r\nThe spectacle defied reason, the result of a competition dreamed up by entrepreneur Peter Diamandis, whose vision for a new race to space required small teams to do what only the world's largest governments had done before. \r\n\r\nFrom the age of eight, when he watched Apollo 11 land on the Moon, Diamandis's singular goal was to get to space. When he realized NASA was winding down manned space flight, he set out on one of the great entrepreneurial adventure stories of our time. If the government wouldn't send him to space, he would create a private space flight industry himself. \r\n\r\nIn the 1990s, this idea was the stuff of science fiction. Undaunted, Diamandis found inspiration in the golden age of aviation. He discovered that Charles Lindbergh made his transatlantic flight to win a $25,000 prize. The flight made Lindbergh the most famous man on earth and galvanized the airline industry. Why, Diamandis thought, couldn't the same be done for space flight? \r\n\r\nThe story of the bullet-shaped SpaceShipOne, and the other teams in the hunt for a $10 million prize is an extraordinary tale of making the impossible possible. In the end, as Diamandis dreamed, the result wasn't just a victory for one team; it was the foundation for a new industry",
  "parsed": {
    "xt": "urn:btih:5a623d8ae122fc74c0f6237546b8f69d039e0ef6",
    "dn": "How to Make a Spaceship (2016) (Epub) Gooner",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "5a623d8ae122fc74c0f6237546b8f69d039e0ef6",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        90,
        98,
        61,
        138,
        225,
        34,
        252,
        116,
        192,
        246,
        35,
        117,
        70,
        184,
        246,
        157,
        3,
        158,
        14,
        246
      ]
    },
    "name": "How to Make a Spaceship (2016) (Epub) Gooner",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 95,
  "peers": 46,
  "last_updated": "2016-12-25T01:59:57.275Z"
}