{"title":"Hip Hop Abs - x264 - MP4 - DVDrip","uid":9684675,"size":1487446026,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:5af165f9bd17ccda3b6ef263b451c8a37be5e20b&amp;dn=Hip+Hop+Abs+-+x264+-+MP4+-+DVDrip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":99,"leechers":33,"uploader":"MrTVGuy","files":-1,"time":1393739345,"description":"BEACHBODY'S HIP HOP ABS\n\nAs always, encoded for maximum compatibility, small file size and good quality. Softmodded Wii compatible.\n\nGet flat sexy abs without ever doing a crunch or situp!\n\nHey, I'm Shaun T. You might not know it now, but I used to be 50 pounds heavier.\nI lost the weight just by dancing and having fun with my Hip Hop Abs program. That's right, I got these flat, amazing abs without getting on the floor.\n\nI can't wait to share my fitness and diet secrets with you. I'll show you my &quot;Tilt, Tuck &amp; Tighten&quot; technique for six-pack abs and burning the fat off your entire body! And don't worry if you can't dance, I'll teach you my moves, step by step, and you'll be ready to hit the clubs in your hot, new body in no time!\n\nABOUT THE WORKOUTS\n\nSecrets to Flat Abs\n\nShaun shares his exclusive training techniques that target your upper abs, lower abs, and obliques while you burn fat. Just Tilt, Tuck &amp; Tighten and you're on your way to a flat, sexy midsection. (13 minutes)\n\nFat Burning Cardio\n\nThis is not your mama's aerobic video. Burn calories and shed fat with fun, hip dance moves and hot music you hear on the radio. (30 minutes)\n\nAb Sculpt\n\nShaun shares more signature ab moves to get you the six-pack you've always wanted without a single sit-up or crunch.\n(25 minutes)\n\nTotal Body Burn\n\nA head-to-toe workout that combines cardio and total body sculpting with even more ab-defining moves. Have fun while you burn fat, revealing a leaner, tighter body. (45 minutes)","torrent":{"xt":"urn:btih:5af165f9bd17ccda3b6ef263b451c8a37be5e20b","amp;dn":"Hip+Hop+Abs+-+x264+-+MP4+-+DVDrip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5af165f9bd17ccda3b6ef263b451c8a37be5e20b","infoHashBuffer":{"type":"Buffer","data":[90,241,101,249,189,23,204,218,59,110,242,99,180,81,200,163,123,229,226,11]},"announce":[],"urlList":[]}}