{
  "title": "The Well-Educated Mind - A Guide to the Classical Education You",
  "uid": 15520591,
  "size": 777136,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:5b8b928c12acfdaa13d40efd97c0028d92a0d2ac&amp;dn=The+Well-Educated+Mind+-+A+Guide+to+the+Classical+Education+You+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 41,
  "leechers": 0,
  "uploader": "shtihl22",
  "files": 1,
  "time": 1470746405,
  "description": "**********Description***********\r\n\r\n\r\nThe enduring and engaging guide to educating yourself in the classical tradition.\r\n\r\nHave you lost the art of reading for pleasure? Are there books you know you should read but haven't because they seem too daunting? In The Well-Educated Mind, Susan Wise Bauer provides a welcome and encouraging antidote to the distractions of our age, electronic and otherwise.\r\n\r\nNewly expanded and updated to include standout works from the twenty-first century as well as essential readings in science (from the earliest works of Hippocrates to the discovery of the asteroid that killed the dinosaurs), The Well-Educated Mind offers brief, entertaining histories of six literary genres-fiction, autobiography, history, drama, poetry, and science-accompanied by detailed instructions on how to read each type. The annotated lists at the end of each chapter-ranging from Cervantes to Cormac McCarthy, Herodotus to Laurel Thatcher Ulrich, Aristotle to Stephen Hawking-preview recommended reading and encourage readers to make vital connections between ancient traditions and contemporary writing.\r\n\r\nThe Well-Educated Mind reassures those readers who worry that they read too slowly or with below-average comprehension. If you can understand a daily newspaper, there's no reason you can't read and enjoy Shakespeare's sonnets or Jane Eyre. But no one should attempt to read the &quot;Great Books&quot; without a guide and a plan. Bauer will show you how to allocate time to reading on a regular basis; how to master difficult arguments; how to make personal and literary judgments about what you read; how to appreciate the resonant links among texts within a genre-what does Anna Karenina owe to Madame Bovary?-and also between genres.\r\n\r\nIn her best-selling work on home education, The Well-Trained Mind, the author provided a road map of classical education for parents wishing to home-school their children; that book is now the premier resource for home-schoolers. In The Well-Educated Mind, Bauer takes the same elements and techniques and adapts them to the use of adult readers who want both enjoyment and self-improvement from the time they spend reading. Followed carefully, her advice will restore and expand the pleasure of the written word.\r\n\r\n=======================================\r\n \nhttps://thepiratebay.org/user/shtihl22\r\n\r\n=======================================",
  "parsed": {
    "xt": "urn:btih:5b8b928c12acfdaa13d40efd97c0028d92a0d2ac",
    "dn": "The Well-Educated Mind - A Guide to the Classical Education You ",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "5b8b928c12acfdaa13d40efd97c0028d92a0d2ac",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        91,
        139,
        146,
        140,
        18,
        172,
        253,
        170,
        19,
        212,
        14,
        253,
        151,
        192,
        2,
        141,
        146,
        160,
        210,
        172
      ]
    },
    "name": "The Well-Educated Mind - A Guide to the Classical Education You ",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 41,
  "peers": 68,
  "last_updated": "2016-12-25T02:07:58.796Z"
}