{
  "title": "AVG Internet Security 2015 15.0.5576 + Serial [TechTools]",
  "uid": 11562793,
  "size": 343665774,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:5b97d684ad43077d4cae3bc7f6d82e8857c74bf4&amp;dn=AVG+Internet+Security+2015+15.0.5576+%2B+Serial+%5BTechTools%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 1587,
  "leechers": 99,
  "uploader": "ThumperTM",
  "files": -1,
  "time": 1416910855,
  "description": "===================================================================\nVisit us at: &lt;a href=&quot; http://techtools.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://techtools.net/&lt;/a&gt;\n===================================================================\n                                    &lt;a href=&quot;\nhttp://virtualupload.net/viewer.php?file=74418643973973898180.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://virtualupload.net/viewer.php?file=74418643973973898180.jpg&lt;/a&gt;\n\nAVG Internet Security 2015 15.0.5576 + Serial [TechTools]\nAVG Internet Security 2015 - comprehensive antivirus with improved detection of threats, thanks to the &gt;cloud&gt; service File Reputation, easy to manage and optimize firewall with AVG Scan Turbo technology to quickly scan your computer.\nMain components:\nAntivirus and antispyware\nAnti-Rootkit\nWeb protection Surf-Shield\nWeb Scanner Online Shield\nProtection of personal data\nIdentity Alert\nScanner email\nAnti-spam\npersonal firewall\nPC Analyzer\ndata Warehouse\nadditional components\n\nKey features:\nProtect your computer from malware\n\nComponent AVG Internet Security &gt;Computer Protection&gt; provides full protection for your computer against internal threats, which is useful if you are currently not connected to the network. It detects all known types of viruses and spyware, including dormant threats (which entered into the system, but still inactive), and rootkits.\n\nAntivirus and antispyware\nAnti-Virus component ensures continuous protection for your computer in real time. It scans every file when you open, save, or copy and protects the system areas of your computer.\n\nProtection against rootkits\nComponent Anti-Rootkit - a special tool designed to detect and remove rootkits. To scan your computer for rootkits, click Scan for rootkits. Rootkit scan is also performed by default when using the Scan whole computer and preset settings Scheduled scan.\n\nStorage of data\nAVG Data Warehouse component allows you to create secure virtual storage for valuable and confidential data. Content Repository data is encrypted and protected by the specified password, thus preventing unauthorized access.\n\nWeb protection on the Internet\n\nComponent AVG Internet Security &gt;Protection while browsing the site&gt; provides full protection for your computer on the Internet. It detects all known types of viruses and spyware, as well as such complex threats such as exploits and malicious websites.\n\nSurf-Shield\nModule Surf-Shield component LinkScanner protects you when using the Internet. It detects sophisticated Internet threats, which include:\n- Websites with exploits that use malicious code;\n- Phishing websites created for illicitly obtaining personal information of users;\n- Compromised sites, t. E. Initially serious and legitimate sites that have become dangerous and unpredictable as a result of a malicious attack.\n\nOnline Shield\nComponent Online Shield protects you when using the Internet. It detects common types of viruses and spyware and protects you with one of the following methods.\n- Scan the contents of Web pages that you open before they begin to appear in the web browser. If the page contains hazardous objects javascript, Online Shield component stops the opening page.\nScanning of files that you are trying to download. If the file is infected, Online Shield immediately stops booting to the threat has not penetrated into the computer.\n\nProtection of personal data\n\nComponent AVG Internet Security &gt;Personal data&gt; protects your computer by monitoring running applications and processes and tracking all potentially dangerous activity. He also regularly checks that your personal data will not become the object of misuse of the Internet.\n\nIdentity Protection\nComponent Identity Protection protects your computer in real time against new and unknown threats. It keeps track of all the processes (including hidden) and more than 285 models of behavior, trying to determine the possible risk to the system. For this reason, possible to detect threats, even not specifically described in the virus database.\n\nIdentity Alert\nIdentity Alert component provides access to Web services for discrete monitoring of personal information over the Internet. This information includes the following information:\n- Credit card number;\n- E-mail address;\n- Telephone number (mobile).\n\nNetwork Threat Protection\n\nPersonal firewall\n\nComponent AVG Firewall (Firewall) in AVG Internet Security controls all network traffic on your computer. Depending on the settings it allows or blocks attempts to connect to the network, as well as send and receive any kind of data at any scale, from a small LAN to the entire Internet. A properly configured AVG Firewall component will provide excellent protection from hacker attacks from the Internet.\n\nE-mail protection\n\nComponent AVG Internet Security &gt;email protection&gt; provides full protection from e-mail viruses, spyware and spam.\n\nScanning of e-mail\n\nEmail Scanner component is designed to scan all incoming and outgoing e-mail messages; when it detects a virus in an email message, he immediately moved to the Virus Vault. This component can also filter specific types of email attachments, and add text to safe certification messages.\n\nAnti-spam: spam protection\n\nComponent Anti-Spam checks all incoming and outgoing further emails, and unwanted messages as spam. With this feature, most email clients unable to filter spam and keep it in a special mailbox for spam. For best results, the component includes several assay methods for processing email messages.\n\nNew in version 15.0.5576:\nMinor fixes and improvements.\n\nLanguage: Russian, English, and other\n\nSupported operating systems:\nWindows XP Home Edition with Service Pack SP2\nWindows XP Professional with Service Pack SP2\nWindows XP Professional x64 Edition with SP1\nWindows Vista (x86 and x64, all versions)\nWindows 7 (x86 and x64, all versions)\n\nMinimum system requirements:\nProcessor Intel Pentium 1.5 GHz or higher\nMemory 512 MB RAM (Windows XP) and 1024 MB (Windows Vista / 7/8)\n1.3 GB of free disk space (for installation)\nRecommended system requirements\nProcessor Intel Pentium 1.8 GHz or higher\nMemory 1024 MB\n1.6 GB of free disk space (for installation)\n\n\n+-------------------+\n| Instructions      |\n+-------------------+\n1) Stop the application if started\n2) Install application using provided installer and do not reboot\n3) Open Serial.txt and use one of serial provided \n\n\n\nSupport topic: &lt;a href=&quot; http://techtools.net/forum/viewforum.php?f=12&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://techtools.net/forum/viewforum.php?f=12&lt;/a&gt;\n\n   \nAny comments on quality appreciated\n\nThumperDC / TechTools\n\n\n====================================================================================\nIf you need help please post in our forum, Thanks &lt;a href=&quot; http://techtools.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://techtools.net/&lt;/a&gt;\t\n====================================================================================",
  "parsed": {
    "xt": "urn:btih:5b97d684ad43077d4cae3bc7f6d82e8857c74bf4",
    "dn": "AVG Internet Security 2015 15.0.5576   Serial [TechTools]",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "5b97d684ad43077d4cae3bc7f6d82e8857c74bf4",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        91,
        151,
        214,
        132,
        173,
        67,
        7,
        125,
        76,
        174,
        59,
        199,
        246,
        216,
        46,
        136,
        87,
        199,
        75,
        244
      ]
    },
    "name": "AVG Internet Security 2015 15.0.5576   Serial [TechTools]",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 1686,
  "peers": 155,
  "last_updated": "2016-12-25T02:08:12.840Z"
}