{"title":"Microsoft Office 2016 C2R/365 Multi-Language Accessory Packs","uid":13930362,"size":770873344,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5c9bbbdf8f62602fb26de4fcddb6e4abe682b726&amp;dn=Microsoft+Office+2016+C2R%2F365+Multi-Language+Accessory+Packs&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":81,"leechers":4,"uploader":"jovo_bih","files":1,"time":1458416394,"description":"Microsoft Office 2016 C2R/365 Multi-Language Accessory Packs (x86/x64)\r\n\r\nAbout this release\r\n\r\nRelease: own compilation\r\nRequirements: Office 2016 Click-to-Run / Office 365\r\nIncludes: 102 Language Accessory Packs sorted by language (32-bit / 64-bit)\r\nCompatibility: These packs are NOT compatible with Office 2016 Volume License editions\r\nNote: If you use Office 2016 Volume License, use Office 2016 VL Multi-Language Interface Pack instead\r\n\r\nAbout Language Accessory Packs\r\n\r\nYou can install language accessory packs after installing Microsoft Office 2016 Click-to-Run/Office 365.\r\n\r\nFeatures of Language Accessory Packs (LAPs)\r\n\r\n- Changes the Office User Interface (ribbon, menu items and commands) for some or all of the Office applications to the display language you select in Microsoft Office 2016 Language Preferences.\r\n- Changes the Office Help language to the help language you select in Microsoft Office 2016 Language Preferences.\r\n- Includes spelling checker, grammar checker and thesaurus.\r\n\r\nWhy this compilation ?\r\n\r\nLanguage Accessory Pack for Office 2016 are offered as free downloads from MS.\r\nHowever, download links provided on this page are for 32-bit Office versions only. Links to 64-bit LAP's are not available.\r\nThat's why I created this compilation, which includes all available Language Accessory Packs - sorted by language and architecture.\r\n\r\nThe compilation includes\r\n\r\nFull Packs (40): display in selected language + Help in selected language + Proofing tools for selected language\r\n\r\nArabic, Bulgarian, Chinese (Simplified), Chinese (Traditional), Croatian, Czech, Danish, Dutch, English (US), Estonian, Finnish, French, German, Greek, Hebrew, Hindi, Hungarian, Indonesian, Italian, Japanese, Kazakh, Korean, Latvian, Lithuanian, Malay (Latin), Norwegian Bokmål, Polish, Portuguese (Portugal), Portuguese (Brazil), Romanian, Russian, Serbian (Latin, Serbia), Slovak, Slovenian, Spanish, Swedish, Thai, Turkish, Ukrainian, Vietnamese\r\n\r\nPartial Packs (62): display in selected language for some Office applications + Proofing tools for selected language\r\n\r\nAfrikaans, Albanian, Amharic, Armenian, Assamese, Azerbaijani (Latin), Basque (Basque), Belarusian, Bangla (Bangladesh), Bangla (Bengali India), Bosnian (Latin), Catalan, Dari, Filipino, Galician, Georgian, Gujarati, Hausa, Icelandic, Igbo, Irish, isiXhosa, isiZulu, Kannada, Khmer, Kinyarwanda, KiSwahili, Konkani, Kyrgyz, Luxembourgish, Macedonian (FYRO Macedonia), Malayalam, Maltese, Maori, Marathi, Mongolian (Cyrillic), Nepali, Norwedian Nynorsk, Odia, Pashto, Persian (Farsi), Punjabi (Gurmukhi), Quechua, Romansh, Scottish Gaelic, Serbian (Cyrillic, Serbia), Serbian (Cyrillic, Bosnia &amp; Herzegovina), Sesotho sa Leboa, Setswana, Sindhi (Arabic), Sinhala, Tamil, Tatar (Cyrillic), Telugu, Turkmen (Latin), Urdu, Uyghur, Uzbek (Latin), Valencian, Welsh, Wolof, Yoruba\r\n\r\nInstallation\r\n\r\nMount / burn / extract ISO and install the desired Language Pack(s)\r\n\r\nConfigure Office language\r\n\r\nAfter you install the language accessory pack, you must configure Office for your new language preferences.\r\n\r\n- Open any Office program and then click File &gt; Options &gt; Language.\r\n- Under Choose Editing Languages, make sure that the language you want to use is added to this list.\r\n- If the language accessory pack includes proofing tools for that language, the Proofing column shows Installed.\r\n- Under Choose Display and Help languages, you can change the default display and help languages for all your Office applications.\r\n- Restart all Office programs for your changes to take effect.\r\n- You can change the default language for all your Office applications in the Set the Office Language Preferences dialog.\r\n\r\nPlease SEED for a while!","torrent":{"xt":"urn:btih:5c9bbbdf8f62602fb26de4fcddb6e4abe682b726","amp;dn":"Microsoft+Office+2016+C2R%2F365+Multi-Language+Accessory+Packs","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c9bbbdf8f62602fb26de4fcddb6e4abe682b726","infoHashBuffer":{"type":"Buffer","data":[92,155,187,223,143,98,96,47,178,109,228,252,221,182,228,171,230,130,183,38]},"announce":[],"urlList":[]}}