{"title":"Tomb.Raider-Black.Box","uid":8222824,"size":6762931238,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5da737494adbfd2b4ae02de0803a62d59d531456&amp;dn=Tomb.Raider-Black.Box&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":49,"leechers":1,"uploader":"Gh0stNet","files":3,"time":1362514058,"description":"Info;-\n\n\nA SURVIVOR IS BORN\n\nArmed with only the raw instincts and physical ability to push beyond the limits of human endurance, TOMB RAIDER delivers an intense and gritty story into the origins of Lara Croft and her ascent from a frightened young woman to a hardened survivor.\n\nWhen the first ever TOMB RAIDER game launced in 1996 it was a revolution. Oustanding in terms of graphics, gameplay, and storyline , it changed the way that video games were played and developed forever. Fronting the games assault on the world was the central character, Lara Croft. Lara was also to have an incredible impact, quickly becoming the most recognized and celebrated female action heroine and an icon for the video games industry. Today over 30 million TOMB RAIDER games have been sold, making it one of the most lucrative video games franchises while also generating movies, advertising, magazines, books and merchandise.\n\nA famous explorer once said, that the extraordinary is in what we do, not who we are. I'd finally set out to make my mark, to find adventure. But instead adventure found me. In our darkest moments, when life flashes before us, we find something. Something that keeps us going. Something that pushes us. When all seemed lost, I found a truth. And I knew what I must become. \n\n\n\nFULL REPACK\nLANGUAGE: ENGLISH\n\n1.Unrar.\n2.Mount or Burn.\n3.Run 'Setup.exe'.\n4.Start the game from Desktop.\n5.Support game developers like we do. ","torrent":{"xt":"urn:btih:5da737494adbfd2b4ae02de0803a62d59d531456","amp;dn":"Tomb.Raider-Black.Box","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5da737494adbfd2b4ae02de0803a62d59d531456","infoHashBuffer":{"type":"Buffer","data":[93,167,55,73,74,219,253,43,74,224,45,224,128,58,98,213,157,83,20,86]},"announce":[],"urlList":[]}}