{
  "title": "CSI ETABS Version 15.2.2 Build 1364 (32bit &amp; 64bit) + Crack",
  "uid": 15269185,
  "size": 1086505932,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:5e428b29d4b9637b454fcc71c11c8e8f51a484af&amp;dn=CSI+ETABS+Version+15.2.2+Build+1364+%2832bit+%26amp%3B+64bit%29+%2B+Crack&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 43,
  "leechers": 4,
  "uploader": "JeffreyLato",
  "files": 3,
  "time": 1468248709,
  "description": "CSI ETABS Version 15.2.2 Build 1364 (32bit &amp; 64bit) + Crack\r\n\r\nNew crack, license available until July 2017!\r\n\r\nThe innovative and revolutionary new ETABS is the ultimate integrated software package for the structural analysis and design of buildings. Incorporating 40 years of continuous research and development, this latest ETABS offers unmatched 3D object based modeling and visualization tools, blazingly fast linear and nonlinear analytical power, sophisticated and comprehensive design capabilities for a wide-range of materials, and insightful graphic displays, reports, and schematic drawings that allow users to quickly and easily decipher and understand analysis and design results.\r\n\r\nFrom the start of design conception through the production of schematic drawings, ETABS integrates every aspect of the engineering design process. Creation of models has never been easier - intuitive drawing commands allow for the rapid generation of floor and elevation framing. CAD drawings can be converted directly into ETABS models or used as templates onto which ETABS objects may be overlaid. The state-of-the-art SAPFire 64-bit solver allows extremely large and complex models to be rapidly analyzed, and supports nonlinear modeling techniques such as construction sequencing and time effects (e.g., creep and shrinkage).\r\n\r\nDesign of steel and concrete frames (with automated optimization), composite beams, composite columns, steel joists, and concrete and masonry shear walls is included, as is the capacity check for steel connections and base plates. Models may be realistically rendered, and all results can be shown directly on the structure. Comprehensive and customizable reports are available for all analysis and design output, and schematic construction drawings of framing plans, schedules, details, and cross-sections may be generated for concrete and steel structures.\r\n\r\nETABS provides an unequaled suite of tools for structural engineers designing buildings, whether they are working on one-story industrial structures or the tallest commercial high-rises. Immensely capable, yet easy-to-use, has been the hallmark of ETABS since its introduction decades ago, and this latest release continues that tradition by providing engineers with the technologically-advanced, yet intuitive, software they require to be their most productive.\r\n\r\nCSI ETABS Version 15.2.2 with Keygen/License Generator by LAVteam (Thanks!)\r\n\r\n1. Disconnect from the Internet\r\n2. Run Setup 32 or 64 bit (your preferred)\r\n3. Run the etabs_v152_kg.exe and in the keygen folder it will be generated a lservrc license file (~4KB)\r\n4. Copy the license file to :\r\na. For 32bit Windows : C:Program Files (x86)Computers and StructuresETABS 2015 and C:Program Files (x86)Computers and StructuresETABS 2015CSiLicensing\r\nb. For 64bit Windows : C:Program FilesComputers and StructuresETABS 2015 and C:Program FilesComputers and StructuresETABS 2015CSiLicensing\r\nc. For another user-chosen folder, find the directory and copy the license file there.\r\n5. Copy level.txt file to C:Program FilesComputers and StructuresETABS 2015 (For 64-bit) or C:Program Files (x86)Computers and StructuresETABS 2015 (For 32-bit)\r\n6. Make sure ETABS.exe is blocked at the Firewall from connecting to the Internet\r\n\r\nThe How-to-crack above works. If the error &quot;...license file missing etc etc&quot; repeat the step above\r\nLicense is valid for 359 days starting from 10/07/2016 (ends somewhere in July 2017). If you want this time not to end :\r\n1. Change time at your windows clock and put it some years before 2016\r\n2. Wait for the next CSI ETABS update (Version 16 or 15.x.x) coming in the beggining of year 2017 (or earlier 2016) or another crack.\r\nUntil then support by keeping this torrent alive by seeding it or adding it to a seedbox, trust me it's worth the share!",
  "parsed": {
    "xt": "urn:btih:5e428b29d4b9637b454fcc71c11c8e8f51a484af",
    "dn": "CSI ETABS Version 15.2.2 Build 1364 (32bit &amp; 64bit)   Crack",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "5e428b29d4b9637b454fcc71c11c8e8f51a484af",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        94,
        66,
        139,
        41,
        212,
        185,
        99,
        123,
        69,
        79,
        204,
        113,
        193,
        28,
        142,
        143,
        81,
        164,
        132,
        175
      ]
    },
    "name": "CSI ETABS Version 15.2.2 Build 1364 (32bit &amp; 64bit)   Crack",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 25,
  "peers": 78,
  "last_updated": "2016-12-27T01:36:22.094Z"
}