{
  "title": "Malwarebytes Anti-Malware Premium 2.0.2.1012 Final + Keys",
  "uid": 10193831,
  "size": 17295861,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:5ecf64ba121d5b7ffe9e690c27dd24e3885e6595&amp;dn=Malwarebytes+Anti-Malware+Premium+2.0.2.1012+Final+%2B+Keys&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 89,
  "leechers": 4,
  "uploader": "AtomTPB",
  "files": 6,
  "time": 1400632274,
  "description": "Description:\nMalwarebytes Anti-Malware is an anti-malware application that can thoroughly remove even the most advanced malware. Malwarebytes products have a proven record of protecting computers by completely removing all forms of malware, including viruses, Trojans, spyware, adware and rootkits. When it comes to the safety of your computer, Malwarebytes provides the ultimate in protection from the cutting edge of technology! Malwarebytes technology takes the next step in the fight against malware. Malwarebytes Anti-Malware PRO detects and removes malware where even the best known anti-virus and anti-malware applications fail. Malwarebytes Anti-Malware PRO monitors every process and stops malicious processes before they even start.\n\nThe Proactive Protection Module of Malwarebytes Anti-Malware Pro keeps your system safe and secure with advanced heuristic scanning technology.\n\nMalwarebytes Anti-Malware Premium includes three proprietary technologies (signature, heuristics, and behavorial) that automatically protect you and your online experience from malware that antivirus products don't detect.\n\nIt employs malware removal techniques so innovative that computer technicians often recommend Malwarebytes when an antivirus can't finish the job.\n\nProprietary Malwarebytes Chameleon technology protects Malwarebytes Anti-Malware Premium against malware's attempts to disable it, so you're always protected.\n\n\nFeatures:\n*Detects and protects against malware in real-time\n*Blocks hacking and phishing attempts\n*Schedules automatic scanning\n*Offers three flexible scanning modes\n*Anti-Malware/Anti-Spyware\n*Malicious website blocking\n*Real-time protection\n*Heuristic detection\n*Integrated Malwarebytes Anti-Rootkit\n*Hyper Scan mode\n*Scan/Database update scheduler\n*Integrated Malwarebytes Chameleon\n*Advanced malware removal\n*Antivirus compatibility\n\n\nWhat's New in Version 2.0.2.1012:\nImprovements:\n*Changed some of the terminology used in scan results and scan logs to make them clearer\n*Enabling or disabling self-protection should now be more responsive under most circumstances\n*Each language name is now listed in its native tongue rather than being translated to make switching languages easier\n*Blank window is no longer observed flashing on screen during startup and shut down of system when Malwarebytes Anti-Malware is running in the tray on Windows Vista and newer operating systems\n\nIssues Fixed:\n*Several crashes and BSOD issues fixed with rootkit scanning\n*Scan speed improved with rootkit scanning enabled under some circumstances\n*Rootkit scans should no longer hang indefinitely under certain conditions\n*Compatibility issues with certain VPN client software fixed\n*Protection no longer fails to start after upgrade under some circumstances when self-protection is active prior to upgrading\n*Entire General Settings tab now responds to clicks correctly\n*Several issues with Access Policy restrictions not restricting access as they should\n*Editing the Access Policy password no longer results in restricted areas of the software being inaccessible when the correct password is entered\n*Access Policy feature now functions when Bitdefender Total Security is installed\n*Manual scan of individual files and folders using context menu scan feature in Explorer no longer results in the scan failing to run under certain circumstances\n*Green checkmark status is no longer indicated when Malwarebytes Anti-Malware is unable to reach update servers when attempting to update\n*Text is no longer cutoff in the UI on Windows XP or when the 'Classic' theme is used on Windows 7\n*Scan time is now reflected accurately at the end of a scan\n*Quarantined objects remain listed correctly in Limited User Accounts when restoration of an object fails due to lack of permissions\n*Some words in UI which were not translated into non-English languages now are when those languages are selected\n*Driver left behind during uninstallation of Malwarebytes Anti-Malware is now removed as it should be when the product is uninstalled\n\n\nRequirements:\n*OS: Windows 8.1Â®, Windows 8Â®, Windows 7Â®, Windows VistaÂ®, Windows XPÂ® (32-bit, 64-bit)\n*256MB of RAM (512MB or more recommended)\n*800MHz CPU or faster\n*20MB of free hard disk space\n*800x600 or greater screen resolution\n*Active internet connection for database and product updates\n*Internet Explorer 6 or newer",
  "parsed": {
    "xt": "urn:btih:5ecf64ba121d5b7ffe9e690c27dd24e3885e6595",
    "dn": "Malwarebytes Anti-Malware Premium 2.0.2.1012 Final   Keys",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "5ecf64ba121d5b7ffe9e690c27dd24e3885e6595",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        94,
        207,
        100,
        186,
        18,
        29,
        91,
        127,
        254,
        158,
        105,
        12,
        39,
        221,
        36,
        227,
        136,
        94,
        101,
        149
      ]
    },
    "name": "Malwarebytes Anti-Malware Premium 2.0.2.1012 Final   Keys",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 256,
  "peers": 256,
  "last_updated": "2016-12-27T01:39:42.820Z"
}