{
  "title": "Dark Souls Prepare to Die Edition repack Mr DJ",
  "uid": 14184502,
  "size": 3686701012,
  "categoryP": "games",
  "categoryS": "pc",
  "magnet": "?xt=urn:btih:5ed51d22ecac762a5e4bbf8b3ac09cfab9a795bf&amp;dn=Dark+Souls+Prepare+to+Die+Edition+repack+Mr+DJ&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 149,
  "leechers": 19,
  "uploader": "rock840",
  "files": 11,
  "time": 1459819939,
  "description": "Dark Souls Prepare to Die Edition repack Mr DJ\r\n\r\nLOSSLESS Repack by Mr DJ (Me)\r\n\r\nRepack features:\r\n\r\nNothing cut / recoded\r\nGame Version - 1.0.2.0 ;\r\nLanguage : English ;\r\nPrecracked - install and play [No Games For Windows Live (GFWL) required) ;\r\nInstall Time - 5 minutes [Quad Core mobile]\r\nFinal size: 3.64gb ;\r\nOperating system: Win XP,Win vista, Win 7,Win 8,Win 8.1,Win 10 ;\r\n\r\nDescription\r\n\r\nDark Souls: Prepare to Die Edition includes an untold chapter Lordran world in which the player will go into the past, at a time when Artorias knight was still alive. In Dark Souls, you will find many familiar elements: the universe in the style of &quot;dark fantasy&quot;, dark dungeons, battles with terrifying enemies and unique possibilities of interaction with other players. Dark Souls - this is not a direct continuation of Demon's Souls, but rather a spiritual successor to the game. Get ready to see a new, plunged into despair the world that you can explore freely. Get ready to hear a new mysterious story, the story is developed around the royal crown and the dying flame in the heart of the world. But above all, prepare to die. You will find many deadly traps, hordes of grotesque monsters are incredibly powerful demons and dragons. To cope with the trials of this unforgiving world, you have to learn from the fatal mistakes. But you're not alone. In Dark Souls may appear in the souls of other players in your world, so you can learn from their failures, and they, in turn, on your own. In addition, you will be able to call on players or invade another's worlds to fight in PVP-fights. In Dark Souls have fires that act as save points. While relaxing by the campfire your health and mana restored, and all the enemies respawn. Remember: in Dark Souls are no really safe place. As you progress through the game difficulty level will increase, so that Dark Souls will become your most serious test of the game this year. Can you survive the thousands of deaths and perpetuate his legacy.\r\n\r\n**INSTALL INSTRUCTIONS:\r\n\r\nDISABLE YOUR ANTIVIRUS BEFORE RUNNING 'Setup.exe' (IMPORTANT) to avoid any error message . (For avast users: Just Disable DeepScreen in antivirus settings)...\r\n\r\nAfter running setup,, click on 'Configure',, specify the install directory,, click on next and next,, select the necessary software (Direct X [provided in Redist folder]),, again next,, finally on 'Install'...PLAY THE GAME FROM DESKTOP SHORTCUT using run as administrator.... \r\n\r\nAlways open the game using 'Run as administrator' to avoid any savegame/crash issue, if it still crashes, lower the graphics settings and make sure u meet the system requirements along with updated graphic drivers for your graphics card ...\r\n\r\nCheck out my Official FB page:\r\nMr DJ repacks\r\nLike it guys to support, to get any help and updates on upcoming repacks",
  "parsed": {
    "xt": "urn:btih:5ed51d22ecac762a5e4bbf8b3ac09cfab9a795bf",
    "dn": "Dark Souls Prepare to Die Edition repack Mr DJ",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "5ed51d22ecac762a5e4bbf8b3ac09cfab9a795bf",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        94,
        213,
        29,
        34,
        236,
        172,
        118,
        42,
        94,
        75,
        191,
        139,
        58,
        192,
        156,
        250,
        185,
        167,
        149,
        191
      ]
    },
    "name": "Dark Souls Prepare to Die Edition repack Mr DJ",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 168,
  "peers": 122,
  "last_updated": "2016-12-25T02:29:52.930Z"
}