{
  "title": "The Willpower Instinct",
  "uid": 7857436,
  "size": 240860271,
  "categoryP": "audio",
  "categoryS": "audio_books",
  "magnet": "?xt=urn:btih:5f645f65b609373bfbd784239d5805800e033a77&amp;dn=The+Willpower+Instinct&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 37,
  "leechers": 0,
  "uploader": "cloak-and-dagger",
  "files": 12,
  "time": 1353808331,
  "description": "After years of watching her students struggling with their choices, health psychologist Kelly McGonigal, Ph.D., realized that much of what people believe about willpower is actually sabotaging their success. Committed to sharing what the scientific community already knew about self-control, McGonigal created a course called &quot;The Science of Willpower&quot; for Stanford University's Continuing Studies Program. The course was an instant hit and spawned the hugely successful Psychology Today blog with the same name.\n\nInformed by the latest research and combining cutting-edge insights from psychology, economics, neuroscience, and medicine, McGonigal's book explains exactly what willpower is, how it works, and why it matters. Readers will learn:\n\n\nWillpower is a mind-body response, not a virtue. It is a biological function that can be improved through mindfulness, exercise, nutrition, and sleep. People who have better control of their attention, emotions, and actions are healthier, happier, have more satisfying relationships, and make more money. Willpower is not an unlimited resource. Too much self-control can actually be bad for your health. Temptation and stress hijack the brain's systems of self-control, and that the brain can be trained for greater willpower.\n\nIn the groundbreaking tradition of Getting Things Done, The Willpower Instinct combines life-changing prescriptive advice and complementary exercises to help readers with goals ranging from a healthier life to more patient parenting, from greater productivity at work to finally finishing the basement.",
  "parsed": {
    "xt": "urn:btih:5f645f65b609373bfbd784239d5805800e033a77",
    "dn": "The Willpower Instinct",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "5f645f65b609373bfbd784239d5805800e033a77",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        95,
        100,
        95,
        101,
        182,
        9,
        55,
        59,
        251,
        215,
        132,
        35,
        157,
        88,
        5,
        128,
        14,
        3,
        58,
        119
      ]
    },
    "name": "The Willpower Instinct",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 47,
  "peers": 27,
  "last_updated": "2016-12-27T01:43:35.590Z"
}