{
  "title": "Revival By Stephen King (epub,mobi)",
  "uid": 11429468,
  "size": 1040164,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:5f82bf3397b79617e6cb7c872a4e3fbd881d3a3a&amp;dn=Revival+By+Stephen+King+%28epub%2Cmobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 58,
  "leechers": 6,
  "uploader": "maxdesolate",
  "files": 4,
  "time": 1415706675,
  "description": "\nA dark and electrifying novel about addiction, fanaticism, and what might exist on the other side of life.\n\nIn a small New England town, over half a century ago, a shadow falls over a small boy playing with his toy soldiers. Jamie Morton looks up to see a striking man, the new minister. Charles Jacobs, along with his beautiful wife, will transform the local church. The men and boys are all a bit in love with Mrs. Jacobs; the women and girls feel the same about Reverend Jacobs -- including Jamie's mother and beloved sister, Claire. With Jamie, the Reverend shares a deeper bond based on a secret obsession. When tragedy strikes the Jacobs family, this charismatic preacher curses God, mocks all religious belief, and is banished from the shocked town.\n\nJamie has demons of his own. Wed to his guitar from the age of thirteen, he plays in bands across the country, living the nomadic lifestyle of bar-band rock and roll while fleeing from his family's horrific loss. In his mid-thirties -- addicted to heroin, stranded, desperate -- Jamie meets Charles Jacobs again, with profound consequences for both men. Their bond becomes a pact beyond even the Devil's devising, and Jamie discovers that revival has many meanings.\n\nThis rich and disturbing novel spans five decades on its way to the most terrifying conclusion Stephen King has ever written. It's a masterpiece from King, in the great American tradition of Frank Norris, Nathaniel Hawthorne, and Edgar Allan Poe.\n\nepub and mobi. enjoy and seed",
  "parsed": {
    "xt": "urn:btih:5f82bf3397b79617e6cb7c872a4e3fbd881d3a3a",
    "dn": "Revival By Stephen King (epub,mobi)",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "5f82bf3397b79617e6cb7c872a4e3fbd881d3a3a",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        95,
        130,
        191,
        51,
        151,
        183,
        150,
        23,
        230,
        203,
        124,
        135,
        42,
        78,
        63,
        189,
        136,
        29,
        58,
        58
      ]
    },
    "name": "Revival By Stephen King (epub,mobi)",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 64,
  "peers": 29,
  "last_updated": "2016-12-25T02:34:31.809Z"
}