{
  "title": "Batman: The Dark Knight Returns (1986|Digital|TheHand-Empire)",
  "uid": 9880589,
  "size": 280987317,
  "categoryP": "other",
  "categoryS": "comics",
  "magnet": "?xt=urn:btih:5ffa9507bdd5cacb61f5d19e786d63d0284a9a2a&amp;dn=Batman%3A+The+Dark+Knight+Returns+%281986%7CDigital%7CTheHand-Empire%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 48,
  "leechers": 1,
  "uploader": "VikTSlick",
  "files": -1,
  "time": 1396542009,
  "description": "For more information about this story, please see the wikilink here: &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Dark_Knight_Returns&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Dark_Knight_Returns&lt;/a&gt;\n\nThis take on Batman, by Frank Miller, became a huge mega-selling hit, completely altered the perception of the main character to a forever darker and grittier view, re-made the landscape of the entire comics industry and turned its author into a superstar. It's impact cannot be overstated, and of course the actual comics themselves are remarkable. The Dark Night Returns tells the alternate-reality tale of an aging Bruce Wayne who has been absent from Gotham as Batman for ten years, and his return to the costume and the crimefighting as newer and more violent threats emerge. There are interesting psychological discussions about the Joker and Two-Face, a thrilling clash with now-government stooge Superman, a new (female) Robin and so much more. The paneling is always intriguing, as Miller and Klaus Janson's art makes good use of vertical space and carefully lays out its splash pages like bombs for the reader - and they do detonate! Miller also uses the TV news as a clever framing device throughout the story, as either exposition or commentary. The decaying of society is a major theme that registers as prescient today. I could go on and on but in short, this is a must-read classic that is deservedly considered to be among the best superhero comics ever made. \n\n\nThis is the one-volume edition that combines all four original issues, and has not yet been torrented outside the hitlists. The separate issues were in a pack by gesserit along with Miller's other Batman works. This awesome digital edition is by TheHand-Empire and really shows off Lynn Varley's tremendous abyss-like inking. Thanks to the scanners for their efforts, please seed and enjoy! :-)",
  "parsed": {
    "xt": "urn:btih:5ffa9507bdd5cacb61f5d19e786d63d0284a9a2a",
    "dn": "Batman: The Dark Knight Returns (1986|Digital|TheHand-Empire)",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "5ffa9507bdd5cacb61f5d19e786d63d0284a9a2a",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        95,
        250,
        149,
        7,
        189,
        213,
        202,
        203,
        97,
        245,
        209,
        158,
        120,
        109,
        99,
        208,
        40,
        74,
        154,
        42
      ]
    },
    "name": "Batman: The Dark Knight Returns (1986|Digital|TheHand-Empire)",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 16,
  "peers": 16,
  "last_updated": "2016-12-27T01:47:28.317Z"
}