{
  "title": "Krupp: A History of the Legendary German Firm",
  "uid": 15885435,
  "size": 1959843,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:60211ce64fdd1aa5122a0d8192d48e8399898918&amp;dn=Krupp%3A+A+History+of+the+Legendary+German+Firm&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 39,
  "leechers": 0,
  "uploader": "marty14",
  "files": 1,
  "time": 1474646193,
  "description": "Krupp: A History of the Legendary German Firm - Harold James [epub]\r\n\r\nThe history of Krupp is the history of modern Germany. No company symbolized the best and worst of that history more than the famous steel and arms maker. In this book, Harold James tells the story of the Krupp family and its industrial empire between the early nineteenth century and the present, and analyzes its transition from a family business to one owned by a nonprofit foundation.\r\n\r\nKrupp founded a small steel mill in 1811, which established the basis for one of the largest and most important companies in the world by the end of the century. Famously loyal to its highly paid workers, it rejected an exclusive focus on profit, but the company also played a central role in the armament of Nazi Germany and the firm's head was convicted as a war criminal at Nuremberg. Yet after the war Krupp managed to rebuild itself and become a symbol of Germany once again--this time open, economically successful, and socially responsible.\r\n\r\nBooks on Krupp tend to either denounce it as a diabolical enterprise or celebrate its technical ingenuity. In contrast, James presents a balanced account, showing that the owners felt ambivalent about the company's military connection even while becoming more and more entangled in Germany's aggressive politics during the imperial era and the Third Reich.\r\n\r\nBy placing the story of Krupp and its owners in a wide context, James also provides new insights into the political, social, and economic history of modern Germany",
  "parsed": {
    "xt": "urn:btih:60211ce64fdd1aa5122a0d8192d48e8399898918",
    "dn": "Krupp: A History of the Legendary German Firm",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "60211ce64fdd1aa5122a0d8192d48e8399898918",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        96,
        33,
        28,
        230,
        79,
        221,
        26,
        165,
        18,
        42,
        13,
        129,
        146,
        212,
        142,
        131,
        153,
        137,
        137,
        24
      ]
    },
    "name": "Krupp: A History of the Legendary German Firm",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 39,
  "peers": 22,
  "last_updated": "2016-12-25T02:38:10.528Z"
}