{"title":"Anno 1404 Gold","uid":8095043,"size":5136777216,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:60643253098a8d0892159420e1bc4f19a524e346&amp;dn=Anno+1404+Gold&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":36,"leechers":3,"uploader":"dawndawnd","files":-1,"time":1359815041,"description":"Anno 1404 Gold, update game to remove copy protection.\n\n---\n\nAnno 1404 Gold Edition gives you the complete 1404 experience in one neat package of incredible depth. Includes Anno 1404 and Anno 1404: Venice.\n\nAnno 1404 and its add-on Anno 1404: Venice are an award winning combination of construction, economy, discovery, diplomacy &amp; combat. Raise monumental metropolis and develop an idealized historical empire in the Orient and the Venice of the Renaissance. The game also offers multiplayer support, allowing you to share this experience with your friends.\n\nWhat makes the series truly great is the balanced learning curve and the simplicity of the interface which underwrites the complicated political and financial interaction. The latest expansion disk adds to the mix the new faction of Venice, new multiplayer modes, new mechanics of subterfuge and economic warfare, and several new scenarios to play through.\n\nThe addition of a Base of Operations to your building options now allows the issuing of spies and agents against your neighbouring cities. You can disrupt the economy of your rival, engage in arson, sponsor a false prophet, send a troupe of dancing girls to slow the easily distracted peasants and generally spread civil unrest. This generally weakens your opponents without open hostilities and undermines their settlements, giving you the city elders in your pocket and eventually just buy the Key to the City and take it as your own.\n\n---\n\nDRM: Keycode Activation\nCPU: Core 2 Duo E6600 2.4GHz\nGraphics: DirectXÂ®10-compatible graphics adapter with 512 MB RAM\nRAM: 1 GB\nSound Card: DirectXÂ®9-compatible\nOS: WindowsÂ® XP (SP3), Windows VistaÂ® or higher\nDirect X Version: DirectXÂ®9/10\nHard Disk Space: 6 GB free space","torrent":{"xt":"urn:btih:60643253098a8d0892159420e1bc4f19a524e346","amp;dn":"Anno+1404+Gold","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60643253098a8d0892159420e1bc4f19a524e346","infoHashBuffer":{"type":"Buffer","data":[96,100,50,83,9,138,141,8,146,21,148,32,225,188,79,25,165,36,227,70]},"announce":[],"urlList":[]}}