{"title":"Tycho - Awake (2014) [MP3 320] politux","uid":9805068,"size":88333428,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:60939e82d8e8f9a6a3a14e9796b6749af77ddf7b&amp;dn=Tycho+-+Awake+%282014%29+%5BMP3+320%5D+politux&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":110,"leechers":1,"uploader":"politux","files":-1,"time":1395443442,"description":"\n  Tycho - Awake (2014) [MP3 320] politux\n\n  Genre: Electronic\n  Styles: Downtempo, Ambient, Chillout\n  Source: Converted from FLAC\n  Codec: MP3\n  Bitrate: 320 CBR\n  Bit Depth: 16\n  Sample Rate: 44.1 kHz\n  \n  01 Awake \n  02 Montana\n  03 L\n  04 Dye \n  05 See \n  06 Apogee \n  07 Spectre \n  08 Plains\n\n  The variations within Tycho's music have always been subtle, hovering between ambient introspection and more active synth pop and post-rock elements. On Awake, Scott Hansen breaks the mold a bit, crafting a set of songs with more prominent peaks and valleys than his previous work. He makes this shift known with the album's first two songs, both of which shake off the insular feel of his previous album, Dive, in favor of streamlined guitar pop with most of its rough edges and raw emotions smoothed away. &quot;Awake&quot; foreshadows how large a role chugging and chiming guitars play on the rest of the album; Tycho's signature squiggly analog synths don't surface until the track is almost over. Meanwhile, the lush &quot;Montana&quot; is the closest Hansen has come to delivering an anthem. Later, &quot;Apogee&quot;'s prickly electronics and distorted beats underscore that Awake is something of a departure even in its more familiar-sounding moments. \n\n  Whenever it feels like Hansen has sacrificed too much of the haunting, affecting qualities of Dive and Past Is Prologue for something more superficially energetic -- such as &quot;See&quot;'s laser-guided climax -- he tempers Awake with more reflective pieces. &quot;Dye&quot; will reassure longtime fans that he hasn't lost his flair for breezily melancholic atmospheres, while &quot;L&quot;'s prominent beat doesn't detract from the song's gentle liftoff or the way its sparkling keyboards and guitars melt into each other. Despite Awake's flirtations with change, like other Tycho albums it's best appreciated as a whole; moving from bright to serene to brooding, it offers a sunset of moods. As it drifts off in a haze with &quot;Plains&quot;' winsome haze, it feels like the musical equivalent of tasteful graphic design; even as Tycho adds more depth and variety to his sound, his music's main success is giving listeners an attractive backdrop for whatever they might be doing.","torrent":{"xt":"urn:btih:60939e82d8e8f9a6a3a14e9796b6749af77ddf7b","amp;dn":"Tycho+-+Awake+%282014%29+%5BMP3+320%5D+politux","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60939e82d8e8f9a6a3a14e9796b6749af77ddf7b","infoHashBuffer":{"type":"Buffer","data":[96,147,158,130,216,232,249,166,163,161,78,151,150,182,116,154,247,125,223,123]},"announce":[],"urlList":[]}}