{"title":"Mirrors.Edge.Catalyst-CPY","uid":15939357,"size":24923703472,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6233988449f68383d09b00ba9bac449883e0b24b&amp;dn=Mirrors.Edge.Catalyst-CPY&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":69,"leechers":172,"uploader":"MrSnailD","files":3,"time":1475437492,"description":"R E L E A S E D    F O R    Y O U\r\n\r\nRELEASE NAME                    Mirrors.Edge.Catalyst-CPY\r\nRELEASE DATE                    02/10/2016\r\nSHOP RELEASE DATE          07/06/2016\r\nRELEASE TYPE                    Game\r\nKIND                                    Parkour\r\nFORMAT                                ISO\r\nPROTECTION                        EA DRM + Denuvo + Origin\r\nFILES N                              84x250\r\n\r\nRun, leap and fight your way to freedom in the city of Glass.\r\nGet ready to hit the ground running in this fast-paced,\r\nfree-running adventure with stunning visuals. Experience Faith's\r\nincredible freedom of movement as she darts up walls, zips down\r\nwires and makes death-defying leaps from rooftop to rooftop.\r\nCombine her punishing martial arts skills with a mastery of the\r\nsurroundings to take out any enemies she can't outrun.\r\nKey Features:\r\nExplore every inch of a vast city. Run free in the city of Glass\r\nat your own pace, however you want, and unlock its many\r\ndistricts as you play.\r\nHigh-velocity action. Whether she's smoothly slipping past\r\nenemies or delivering a serious beat down, Faith knows just how\r\nto make the most of her speed, agility and momentum. String\r\ntogether a series of attacks at top speed or outmaneuver\r\nopponents by Shifting or free-running out of range.\r\nGadgets and upgrades. Faith has some very handy toys at her\r\ndisposal that can help her turn the Conglomerate's own equipment\r\nagainst them. Use the MAG Rope to latch on to (and swing from)\r\ncameras throughout the city or the Disruptor to take out enemy\r\nsystems.\r\nShare the experience. Social Play lets you customize your\r\nprofile, check the leaderboards for Time Trials or create your\r\nown to share with friends. Add a Beat Location Emitter to create\r\nthe ultimate treasure hunt in the massive city. How many seconds\r\ncan you shave off your best time?\r\n\r\nInstructions:\r\n\r\n-Burn or mount the image\r\n-Install the game\r\n-Copy the crack\r\n-Enjoy\r\n\r\n&quot;Always Outnumbered, Never Outgunned&quot;\r\n\r\nEstablished in 1999, we are possibly the oldest Italian-based\r\nrelease group still in activity.  We express a big THANK YOU  to\r\nall those friends who helped us in various forms throughout thes\r\nyears!  Don't forget to support the companies and to keep the\r\nScene about FUN. \r\n\r\nFondato nel 1999, CPY e' probabilmente il piu' vecchio gruppo\r\nrelease in Italia ancora in attivita'.  Ringraziamo DI CUORE tutti\r\ngli amici che ci hanno aiutati in ogni maniera in questi anni!\r\nRicordate di supportare le compagnie cinematografiche e di\r\nsoftware, e che la Scena dev'essere basata sul DIVERTIMENTO. \r\n\r\nGreets to ENCRyPTED - iAT &amp; all our friends.\r\n\r\nAscii      gK","torrent":{"xt":"urn:btih:6233988449f68383d09b00ba9bac449883e0b24b","amp;dn":"Mirrors.Edge.Catalyst-CPY","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6233988449f68383d09b00ba9bac449883e0b24b","infoHashBuffer":{"type":"Buffer","data":[98,51,152,132,73,246,131,131,208,155,0,186,155,172,68,152,131,224,178,75]},"announce":[],"urlList":[]}}