{"title":"The Thick Of It Season 1, 2 &amp; 3 + Extras (Extra episodes) DVDRip","uid":6191900,"size":7936655775,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:62963b2339045ad22c47ea4da23bca6c0cff5e4f&amp;dn=The+Thick+Of+It+Season+1%2C+2+%26+3+%2B+Extras+%28Extra+episodes%29+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":54,"leechers":25,"uploader":"TSV","files":-1,"time":1298321385,"description":"The Thick of It is a British comedy television series that satirises the inner workings of modern British government. It was first broadcast on BBC Four in 2005, and has so far completed fourteen half-hour episodes and two special hour-long episodes to coincide with Christmas and Gordon Brown's appointment as Prime Minister. To date, the series has earned Best New Comedy and Best Comedy Performer for Chris Langham at the 2005 British Comedy Awards, Best Situation Comedy and Best Comedy Performance, also for Langham at the 2006 BAFTAs, and Best Comedy Performance Male and Female for Peter Capaldi and Rebecca Front, as well as Best Situation Comedy a second time at the 2010 BAFTAs.\n\nThe series has been described as the 21st century's answer to Yes Minister, highlighting the struggles of the media and spin doctors against civil servants. Series creator Iannucci describes it as &quot;Yes Minister meets Larry Sanders&quot;. The former civil servant Martin Sixsmith is an adviser to the writing team, giving some of the storylines an element of realism. In particular, the character of Malcolm Tucker bears a distinct resemblance to former Director of Communications and Strategy Alastair Campbell, a comparison Campbell himself has acknowledged.\n\nA feature film spin-off, In the Loop, was released in the UK on 17 April 2009. The third series was eight episodes long and started on 24 October 2009, on BBC Two and BBC HD. A fourth series, eight episodes long, has been commissioned. It will be filmed sometime in 2011.","torrent":{"xt":"urn:btih:62963b2339045ad22c47ea4da23bca6c0cff5e4f","amp;dn":"The+Thick+Of+It+Season+1%2C+2+%26+3+%2B+Extras+%28Extra+episodes%29+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62963b2339045ad22c47ea4da23bca6c0cff5e4f","infoHashBuffer":{"type":"Buffer","data":[98,150,59,35,57,4,90,210,44,71,234,77,162,59,202,108,12,255,94,79]},"announce":[],"urlList":[]}}