{
  "title": "House MD Season 4",
  "uid": 4439622,
  "size": 5848963584,
  "categoryP": "video",
  "categoryS": "tv_shows",
  "magnet": "?xt=urn:btih:6319054ad8de1bb309878c4ffe7d7d2720de5a2d&amp;dn=House+MD+Season+4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 40,
  "leechers": 11,
  "uploader": "Kraiton",
  "files": 19,
  "time": 1223746608,
  "description": "Below I show you how to seed the file while you are watching it on your computer. If you do not know how to create a playlist, just select and drag the files into the playlist area, name it then save it. But I need everyone to seed. I figure if it&amp;#039;s on your computer already, why stop seeding if you can watch it. I will recap again below. \n\nFirst off thanks for downloading the best quality house collection I have put together. If you need more complete seasons just click on my username (Kraiton) and you will find all the torrents I have uploaded. All of the House M.D. Videos are HDTV and coded with excellent sound. This brings me to to the AC 3 Filter that came with your download. This is a add-on to Windows Media that allows HD sound to play on your computer. I encourage you to install this Filter. You will only need to do so 1 time. Refer to the last paragraph for alternate installs. \n\nThis entire collection have all been tested and work great for your your computer. If you own a wide-screen it is High Def and will look great. If you have a question you can always IM me on Demonoid. \n\nIf you are wondering if the videos have other logos like fox or other logos. There are none at all, I know that people want to know if its got logos all over it, and the answer is no. \n\nThis is a complete season. They only released 16 episodes due to the writers strike. I verified this at fox.com \n\nAfter you have completed the download you can continue seeding the file while watching it. Just create a play-list and direct it to where you have the files downloaded. Not only will you be able to watch the show with no lag, you will be able to help keep it seeded so it get stronger and faster to download. I am very interactive with the torrents I have uploaded because I want everyone to enjoy the collection. \n\nIf you want more program with more features, then you can copy and paste the link below. It plays everything. It also includes the AC 3 filter, so if you want to use this program for everything, you can watch the videos in the provided Divx player, not to mention it also will allow Windows Media Player to play files with ease. I personally use this program so I can watch DVD&amp;#039;s in my DVD Rom on Windows Media Player. So you can get all in one with this one. If you want to use this program you will not need to install the AC 3 codec. It is included in this file and will just prompt you to un-install the codec. \n &lt;a href=&quot;\nhttp://ftp.freenet.de/pub/filepilot/windows/multimedia/video/k-lite_codec_pack/klcodec417f.exe&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ftp.freenet.de/pub/filepilot/windows/multimedia/video/k-lite_codec_pack/klcodec417f.exe&lt;/a&gt;",
  "parsed": {
    "xt": "urn:btih:6319054ad8de1bb309878c4ffe7d7d2720de5a2d",
    "dn": "House MD Season 4",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "6319054ad8de1bb309878c4ffe7d7d2720de5a2d",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        99,
        25,
        5,
        74,
        216,
        222,
        27,
        179,
        9,
        135,
        140,
        79,
        254,
        125,
        125,
        39,
        32,
        222,
        90,
        45
      ]
    },
    "name": "House MD Season 4",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 9,
  "peers": 44,
  "last_updated": "2016-12-27T02:06:07.997Z"
}