{"title":"Northmen: The Viking Saga 793-1241 AD","uid":15896901,"size":21819889,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:64cd50bf4fd0b3f168b0c7c7af6b7f51aaa60220&amp;dn=Northmen%3A+The+Viking+Saga+793-1241+AD&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":59,"leechers":3,"uploader":"marty14","files":1,"time":1474818992,"description":"Northmen: The Viking Saga 793-1241 AD - John Haywood [epub]\r\n\r\nIn AD 800, the Scandinavians were just barbarians in longships. Though they held sway in the north, their power meant little more than the ability to pillage and plunder, which they did to bolster their status at home. But as these Norse warriors left their strongholds to trade, raid, and settle across wide areas of Europe, Asia, and the North Atlantic, their violent and predatory culture left a unique imprint on medieval history. The twist that no one predicted, however, was a much slower, insidious takeover than any the Vikings would execute, and by a turn of the tide, they themselves became its target. For as they made their mark on Europe, Europe made its mark on them. By the year 1200, what remained of the Vikings’ pagan origins floated beneath the surface and the strong, strange territories of the north had become a part of Latin Christendom.\r\n\r\nNorthmen is there to tell the tale, to pay homage to what was lost and celebrate what was won. Focusing on key events, including the sack of Lindisfarne in 793 and the Battle of Stamford Bridge in 1066, medieval history expert John Haywood recounts the saga of the Viking Age, from the creation of the world through to the dwindling years of halfhearted raids and elegiac storytelling in the thirteenth century. He does so with meticulous research, engaging narrative, and sensitivity for his subject, shedding light and blood along the way","torrent":{"xt":"urn:btih:64cd50bf4fd0b3f168b0c7c7af6b7f51aaa60220","amp;dn":"Northmen%3A+The+Viking+Saga+793-1241+AD","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64cd50bf4fd0b3f168b0c7c7af6b7f51aaa60220","infoHashBuffer":{"type":"Buffer","data":[100,205,80,191,79,208,179,241,104,176,199,199,175,107,127,81,170,166,2,32]},"announce":[],"urlList":[]}}