{"title":"Rick Riordan - The Blood of Olympus (The Heroes of Olympus #5) [","uid":11170763,"size":1091283,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:65ca0323c829bb3051ea274cabcaf4111718c078&amp;dn=Rick+Riordan+-+The+Blood+of+Olympus+%28The+Heroes+of+Olympus+%235%29+%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":51,"leechers":0,"uploader":"Naveen_A","files":1,"time":1412699343,"description":"Though the Greek and Roman crewmembers of the Argo II have made progress in their many quests, they still seem no closer to defeating the earth mother, Gaea. Her giants have risen-all of them-and they're stronger than ever. They must be stopped before the Feast of Spes, when Gaea plans to have two demigods sacrificed in Athens. She needs their blood-the blood of Olympus-in order to wake. \n\nThe demigods are having more frequent visions of a terrible battle at Camp Half-Blood. The Roman legion from Camp Jupiter, led by Octavian, is almost within striking distance. Though it is tempting to take the Athena Parthenos to Athens to use as a secret weapon, the friends know that the huge statue belongs back on Long Island, where it might be able to stop a war between the two camps.\n\nThe Athena Parthenos will go west; the Argo II will go east. The gods, still suffering from multiple personality disorder, are useless. How can a handful of young demigods hope to persevere against Gaea's army of powerful giants? As dangerous as it is to head to Athens, they have no other option. They have sacrificed too much already. And if Gaea wakes, it is game over.","torrent":{"xt":"urn:btih:65ca0323c829bb3051ea274cabcaf4111718c078","amp;dn":"Rick+Riordan+-+The+Blood+of+Olympus+%28The+Heroes+of+Olympus+%235%29+%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65ca0323c829bb3051ea274cabcaf4111718c078","infoHashBuffer":{"type":"Buffer","data":[101,202,3,35,200,41,187,48,81,234,39,76,171,202,244,17,23,24,192,120]},"announce":[],"urlList":[]}}