{
  "title": "Age of Empires 3 [Full][Working][Tested] - Khaos Industries",
  "uid": 4614151,
  "size": 1799338630,
  "categoryP": "games",
  "categoryS": "pc",
  "magnet": "?xt=urn:btih:6694e15c410e294b258bb6de12bd240a3d02103e&amp;dn=Age+of+Empires+3+%5BFull%5D%5BWorking%5D%5BTested%5D+-+Khaos+Industries&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 69,
  "leechers": 2,
  "uploader": "khaosindu",
  "files": 20,
  "time": 1230747913,
  "description": "The Good\n\n    * Tried-and-true formula still makes for a complex and interesting strategy game  \n    * Innovative &quot;home city&quot; system creates long-term depth and strategy  \n    * Plenty of content and modes of play  \n    * Spectacular visuals, if you have a fast system.\n\n\nThe Bad\n\n    * Some aspects of combat don't look and feel quite right  \n    * Frame rate can bog down at the wrong moments  \n    * Falls into some of the same traps as many older real-time strategy games .\n\n\n\nSix years have flown by since Age of Empires II: The Age of Kings became one of the definitive real-time strategy games on the market. Age of Kings typified this style of gaming in many respects, but it innovated and improved the style in many others, establishing the template for untold numbers of historic real-time strategy games to come. Coming off the successful spin-off that was Age of Mythology, Ensemble Studios is back with another installment in the series that put the developer's name on the map. Age of Empires III advances the series hundreds of years into the future, trading swordsmen and catapults for musketeers and cannons, while keeping the series' signature formula basically intact. What's more, the game features some gorgeous visuals and an interesting, inventive twist in its persistent &quot;home city&quot; system. So it's unfortunate that the actual meat-and-potatoes combat of Age of Empires III didn't turn out better, since what ought to be the most fun and exciting part of the game is actually the part that feels like it's seen the fewest improvements.\n\nYou'll need a lot more than three musketeers to win a typical skirmish in the New World in Age of Empires III.\n\nMake no mistake, Age of Empires III is still an impressive game overall. But fans with fond memories of the previous installment will be left feeling nostalgic for that game. Part of the reason may be purely subjective. The colonial setting of Age of Empires III, which focuses on hypothetical conflicts between European powers vying for control over the New World (that is, an unfettered North and South America), presents a subtler culture clash than, say, samurai fighting Persian war elephants. And the transition through five different ages that's presented in the game, culminating in the industrial age (when locomotives and mass production became a reality), aren't drastically different in gameplay terms, since the magic of gunpowder is available from the get-go. Nevertheless, one look at either Age III's majestic galleons firing all broadsides or horse-drawn cannons readying a deadly payload ought to be all the convincing you need that this is a welcomed direction for the series to take.\n\nEight different European civilizations are at the forefront of Age of Empires III, though mercenaries from other foreign nations sort of make cameo appearances, and various Native American tribes are also included. The usual suspects are here, like the British, the French, the Spanish, and the Dutch. The Russians, the Portuguese, the Germans, and the Ottomans are also available, and each has certain key differences in its economy and military leanings. These differences are significant in practice, such as how the British automatically gain additional workers when they build new houses, or how the Russians may quickly train up large numbers of light infantry. But the eight cultures' personalities don't necessarily come across in combat, because most of the units and structures unique to each side aren't so unique as to be highly distinguishable, and many units and structures are shared in common across most sides. There are certainly exceptions--the Ottomans, with their heavy emphasis on gunpowder, bring to bear some of the biggest and baddest guns in the game, for instance. And, oddly enough, British longbows seem just as surprisingly deadly here as they did in Age II. It's probably just a necessary consequence of the setting, but don't expect for Age III's factions to blow your mind by how different or unusual they are. Fortunately, each one is complex enough and seems viable enough to where it's easy to find an early favorite and want to stick with it.\n\nAge of Empires III is every bit the fully featured game you'd expect it to be, featuring a lengthy single-player campaign in three interconnected acts, each one a generation apart. There's a fully customizable skirmish mode with five difficulty settings for the computer opponent; there's the ability to play over a network; and, of course, there's the ESOnline player-matching service, where you can compete in ranked matches over the Internet, chat with other players, and more. There's also a scenario editor, in case you wish to create your own maps or campaigns, plus some encyclopedic information about all the game's units, structures, cultures, circumstances, and more. A tutorial is there to teach you the basics, and you can also play a practice match in which a fairly helpful narrator will gently remind you of the stuff you're basically forgetting to do.\n\nThe game looks dramatically different on the surface, but much of the Age of Empires formula remains fully intact.\n\nWhen you get right down to it, Age of Empires III plays a lot like Age II. It's been simplified in a number of ways that fans of the past game will quickly notice and mostly appreciate, but the overall flow of gameplay remains very similar. You're put in charge of a fledgling colony in the New World, and you must deploy workers from your town center, who may build new structures and harvest the game's three resources: food, wood, and coin. Stone, which was a fourth resource in Age II, is no longer a factor, and you don't have to worry about creating resource drop-off sites this time around (settlers sent to chop wood, for instance, will just chop away without ever heading back to a town center or lumberyard). A marketplace structure centralizes economic upgrades, and mills and plantations can be built to produce an infinite supply of food and coin, respectively. So later on in a match, you can safely stop worrying about micromanaging your resource gathering--at least until your foes swoop in and damage your economic foundation.\n\nMeanwhile, additional houses must be built to support a growing population, and walls and defensive structures may be used to repel guerilla tactics. Military forces mainly consist of infantry, cavalry, and artillery, and they're trained from separate structures. Most military units can be queued up five at a time, so rather than produce musketeers one by one, you can build a group--provided you have the resources. Presumably this is so you can quickly marshal some defenses if caught off guard, but it's strange that the same amount of time is needed to train one soldier as is needed to train five. You can effectively get an interest-free loan by training your first troop, then waiting until he's almost ready before quickly queuing up four more.\n\n\n\nSo in an average match, you'll spend a considerable amount of time building up your base and your economy, eventually marshaling a mixed group of forces with which you'll try to overwhelm your enemy. Dancing between your economy and your military, as you micromanage each in turn, is the key to victory. While the game's interface makes it fairly easy to keep track of what's happening on these fronts, your manual dexterity is still key to success, both when preparing for combat and when engaged in it. A lot of buildup can end very quickly if opponents aren't evenly matched, while equally skilled opponents may be at each other's throats for longer than an hour in a typical Age of Empires III match.\n\nCombat between large forces gets chaotic, and the frame rate can bog down too. Micromanage your way to victory!\n\nThe game offers plenty of interface features for letting you keep tabs on everything, but when you get down to the combat, things are more chaotic and less true-to-life than you'd probably expect. Groups of units automatically form columns, just as you'd assume (infantry in front, artillery in back), and they move at the rate of the slowest unit. Unfortunately, when ordered to attack, they still move at that same slowest rate. So to make your cavalry effectively charge into battle, you must order them separately from your crossbowmen, and so on.\n\nThe neatly arranged ranks immediately break apart when the battle begins, with riflemen fanning out to attack and horse riders clumping around their targets and swinging away, rather than charging through the ranks. Units can all turn on a dime, so cannons have no trouble hitting moving targets, and the game's stately ships display some shockingly absurd behavior when in close quarters or near shore. Most units appear small onscreen, so it can be difficult to keep track of individual combatants in a hectic battle, especially since the game's frame rate will noticeably bog down--even on fast machines--when the bullets start flying. So not only does the game favor whoever brings to bear the biggest force in the first place, but also it favors whoever's got the fastest trigger finger in the West, not to mention the best frame rate, since you'll need to finesse some of your units around the battlefield to make the most of them. Granted, this is nothing out of the ordinary for a real-time strategy game, but that's just the problem: You might reasonably expect the long-awaited sequel to one of the best real-time strategy games of all time to have provided a good solution for what many players have identified as one of the genre's setbacks.\n\nThe imperialistic premise of Age of Empires III sets up the game's most unique feature: the concept of you having a home city looking out for your fledgling colony. At any time during play, you may instantly cut to your home city, which will occasionally send you aid in the form of resource surpluses, economic and military upgrades, and reinforcements. You can gain access to these shipments by earning experience points, which happens automatically as you build up your base and--better yet--kill foes and blow up their buildings. Different shipments are available in different ages (at first you can get just modest economic boosts, while later you can get cannons and cavalry), and most may only be used once. So you constantly have to weigh strategic options, like whether it's best to request reinforcements to mount an offensive or best to keep the option around should your enemy mount an ambush. The shipments system is both easy to use and interesting, and it also thankfully promotes somewhat of a more aggressive, more forgiving style of play than Age of Empires II.\n\nThe home city concept is a novel addition to Age of Empires, and it helps instill a sense of permanence to every victory--and to every defeat, since losers still gain experience.\n\nWhat's more, your home city is permanent in that the experience you earn from one match to the next all adds up, gradually giving you access to more and more shipment options. You unlock these as &quot;cards&quot; every time your home city gains an experience level. More-powerful cards are available only when your city reaches level 10 (which you can reach after about that number of matches), and stronger ones are available at level 25. Certain cards have prerequisites, too, so the system is similar to a skill tree in a role-playing game.\n\nIn fact, Age III likens the home city concept to creating a character in an RPG, although the game's thin attempts to let you personalize your home city won't do much to make you grow attached to the place. But unlocking new cards can be pretty rewarding. You're limited to no more than 20 cards in a given match, but since it's possible to unlock many more than that, the game also invites you to build different decks to suit different situations. For example, shipments of free caravels and galleons won't be of much use to you in the Great Plains, but they'd certainly help when battling in the Caribbean. All eight cultures have different cards available to them (though many cards are shared in common), and ultimately you can use this system to add some panache to your playing style. One possible side effect of this system, though, is that it encourages you to pick a side and stick with it. When playing online, you can't just pick a random civ like you could in previous Age games, and you might not even want to anymore since it's tempting to want all your experience points going in to one bucket.\n\n\n\nAge III makes a number of other changes to the series, though these may seem less original if you've kept up with real-time strategy gaming. For example, new colonies start with an explorer, an unkillable hero character whom you should use to reveal the fog of war around your starting area and who can also collect treasures and earn you experience early on. You'll find bandit camps, wild critters, and more guarding various trinkets that can help give you an economic edge in the beginning. More importantly, the explorer gives you something to do besides waiting for your resources to add up in the early going. If your explorer loses all his hit points, he collapses and may either be ransomed back for some coin or recovered by friendly units. As mentioned, you may also ally yourself with various Native American tribes by building trading posts on their reservations. Perhaps in the spirit of political correctness, Native American buildings cannot be destroyed, but by crushing a foe's trading post, his ties with the tribe are severed. Native American tribes each have a handful of units and economic upgrades you may purchase if you like, diversifying your strategy. Trading posts may be used in other places.\n\nThe Native American tribes may be friends or foes during a typical match. Some foreign mercenaries may make appearances, too.\n\nIn previous Age of Empires games, you could win a match by building and defending one of the wonders of the world, as opposed to just stomping all your opponents back to the Stone Age. For better or worse, in Age of Empires III, conquest is the only option...down to the very last man. Annoyingly, you need to completely decimate the enemy's side to win a match. The opponent is free to resign at any time, but when playing against sore losers on the Internet, matches might easily drag on for longer than necessary because some uppity person insists on scattering a handful of peasants behind trees and in the corners of the map. There are ways to reveal the enemy's position very late in the game, but why Age of Empires III matches don't end at the destruction of an enemy colony, as opposed to with genocide, isn't particularly clear. It's also somewhat frustrating that your home cities gain experience separately online and offline. Presumably this is to prevent cheating, but it still makes you feel like you're wasting your time playing skirmish matches offline when you could be gaining &quot;real&quot; experience playing against opponents online. It's actually possible to gain experience online playing against the computer, but only if there's at least one other player in the match.\n\nSpeaking of the computer opponents in Age of Empires III, they range from numbingly brain-dead at the &quot;easy&quot; setting to challenging at the &quot;hard&quot; and &quot;expert&quot; settings. In the Age of Empires tradition, the computer is incompetent in maps with a lot of naval warfare in them. However, on land-based maps, it can set up an economy very efficiently (at higher difficult settings), and it can harass you with greater numbers, both of which can more than compensate for the computer's lack of subtlety. Playing against the artificial intelligence is good for practice, but playing against real players definitely makes for a better experience. That applies to the game's campaign as well. Beginning with an adventure that takes you in search of the legendary Fountain of Youth, the fictitious campaign in Age of Empires III consists mainly of just the sort of missions you've come to expect, along with the less-than-stellar voice work and awkward cutscenes to move the story along. It would be unfair to dismiss the campaign outright, since it helps teach you the ropes and presents you with some unique situations, not to mention a high volume of different missions. But it's pretty standard for a real-time strategy game, and the swashbuckling high-adventure feel of the storyline seems better suited to Age of Mythology than to Age of Empires.\n\nWere it not for the awkward unit behavior and frame rate issues, Age of Empires III would look truly amazing. Maps with water on them are especially dramatic, as you can see waves gently rocking massive warships, whose cannons make them shudder from side to side. Ships, as well as buildings, break apart in chunks, with lots of fire and smoke all around, making for a spectacular sight. There are plenty of subtle animations to appreciate among the other military units in the game, and there's a good amount of variety to the environments, from the lush jungles of South America on up to the frigid Yukon. The combat has some thrilling moments, such as when a cannonball sends infantry careening every which way, but until the big guns come in to the picture, it all looks pretty tame. It's worth noting that Age of Empires III does a good job of autodetecting the best graphical settings for your system, and despite all the visual wizardry going on, it runs reasonably well--even on fairly modest systems.\n\nIt owes a debt to its ancestors, but Age of Empires III stands tall on its own merits.\n\nThe game sounds great, too, though in real-time strategy tradition, you'll hear the same unit acknowledgments over and over (at least they're mostly spoken in their native languages). Cannon fire is particularly dramatic, and when one force or another wins a skirmish, it's exciting to see all the men stand and cheer. The game's musical score flits between the different cultures' sounds while sticking well to the overall theme.\n\nAge of Empires III has some very big shoes to fill, and on top of that, the real-time strategy market has grown hugely competitive due in no small part to Ensemble Studios' previous accomplishments. This latest game offers a lot of what made Age II so great, and it's got plenty of depth and lasting appeal, despite how most matches tend to begin and ultimately pan out similarly. Age III does seem surprisingly rough around the edges in some respects, and those expecting the game to revolutionize or even refresh this style of gaming may come away disappointed that their high expectations weren't met. But those looking for a complex and interesting real-time strategy game with fantastic good looks and some historical flavor will find just what they want in Age of Empires III.\n___________________________________________________________________________________\n\nSystem Requirements\n\n    * MicrosoftÃ‚Â® WindowsÃ‚Â® XP\n    * PC with 1.4 GHz equivalent or higher processor\n    * 256 MB of system RAM\n    * 2 GB available hard disk space\n    * 32x speed or faster CD-ROM drive\n    * 64 MB video card with support for hardware transformation and lighting required\n    * Sound card, speakers or headphones required for audio\n    * Microsoft Mouse or compatible pointing device\n    * 56.6 Kbps or better modem for online play**\n\n**None Online Play Does Not Work With This Version.\n\nSecondly, This version has been tested over wireless LAN and works perfectly!\n\nInstallation Notes:\n-------------------\n\n  1. Install the game, when prompted for a serial enter the following:\n\n  2. Copy the cracked executable from the /crack dir on DVD to your\n     installation directory.\n\n  3. Play the game.\n\nThanks for downloading, and Enjoy!\n\nKhaos Industries",
  "parsed": {
    "xt": "urn:btih:6694e15c410e294b258bb6de12bd240a3d02103e",
    "dn": "Age of Empires 3 [Full][Working][Tested] - Khaos Industries",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "6694e15c410e294b258bb6de12bd240a3d02103e",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        102,
        148,
        225,
        92,
        65,
        14,
        41,
        75,
        37,
        139,
        182,
        222,
        18,
        189,
        36,
        10,
        61,
        2,
        16,
        62
      ]
    },
    "name": "Age of Empires 3 [Full][Working][Tested] - Khaos Industries",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 29,
  "peers": 163,
  "last_updated": "2016-12-27T02:29:14.583Z"
}