{
  "title": "Francesco Guccini - Discografia Completa [Mp3 - Ita] [Tntvillage",
  "uid": 5259789,
  "size": 1030777712,
  "categoryP": "audio",
  "categoryS": "other",
  "magnet": "?xt=urn:btih:672c87df091cba85acf4f950e604c2790aa26fdd&amp;dn=Francesco+Guccini+-+Discografia+Completa+%5BMp3+-+Ita%5D+%5BTntvillage&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 52,
  "leechers": 6,
  "uploader": "ginozanna",
  "files": 213,
  "time": 1262699253,
  "description": "Francesco Guccini - Discografia Completa [Mp3 - Ita] [Tntvillage.Scambioetico]\n\nVisit this info link: http://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=161453  Visit this link: http://img205.Imageshack.us/img205/3039/projectd.jpg\n\nGUCCINI FRANCESCO\n\nDiscografia Completa\n\nBiografia\n\nFrancesco Guccini nasce a Modena, in via Domenico Cucchiari 22, il 14 giugno del 1940.\n\nNel 1957, dopo aver imparato l'armonica a bocca da autodidatta e la chitarra con l'aiuto di un certo Celestino (un falegname di Porretta improvvisatosi liutaio per cinquemila lire), Francesco mette su il suo primo &quot;complesso&quot;. Ed oggi ricorda cosÃƒÂ¬ quel memorabile evento: Ã‚Â«Pier Farri, che era il piÃƒÂ¹ ricco, scelse la batteria; io, che ero il piÃƒÂ¹ povero, mi gettai sulla chitarra. Victor Sogliani disse che avrebbe suonato il sassofono, Pierino il contrabbasso e in piÃƒÂ¹ c'erano altre due chitarre, tanto per esagerare. [...] Guardavo i film di Elvis Presley e, come facevano in molti, mi mettevo davanti allo specchio e cercavo di imitarne le movenze. Cominciai a non separarmi piÃƒÂ¹ dalla chitarra perchÃƒÂ© la differenza tra un Guccini con chitarra e un Guccini senza chitarra era evidente: il secondo non aveva nessuna possibilitÃƒÂ  di avere delle ragazzeÃ‚Â».\nÃƒË† il 1959 quando Francesco, a soli 19 anni, trova lavoro come istitutore in un collegio di Pesaro, ma si tratta di un'esperienza breve e deludente: viene infatti licenziato dopo appena un mese e mezzo. NÃƒÂ© vanno meglio i contemporanei studi \nuniversitari; il primo anno di universitÃƒÂ , con il passaggio da Modena a Bologna, ÃƒÂ¨ infatti un fallimento: un solo esame sostenuto. Ã‚Â«Non sapevo nemmeno da dove si cominciasse per preparare un esame. Fu solo dopo il militare [...] che la mia vita \nuniversitaria assunse un senso. E fu lÃƒÂ¬, durante il militare, che scoprii Borges e Umberto Eco. [...] Ed ÃƒÂ¨ sempre lÃƒÂ¬ che conobbi il persiano, ovvero Omar Al Khayyam, un poeta del 1300 di cui parla spesso BorgesÃ‚Â».\nMa facciamo un passo indietro: di ritorno da Pesaro, Ã‚Â«dopo l'infelice esperienza come istitutore e prima della naiaÃ‚Â», Guccini lavora per due anni per la &quot;Gazzetta dell'Emilia&quot;, con uno stipendio di ventimila lire al mese per un impegno in redazione di quasi dodici ore al giorno. Un periodo faticoso, dunque, ma che Guccini ricorda con gioia e a cui pose termine per una questione di principio: Ã‚Â«lasciai la Gazzetta quando, dopo due settimane di vacanza, scoprii che non me le avevano conteggiate sulla busta paga. Andai dall'economo per chiedere spiegazioni. E lui disse: 'Niente lavoro, niente paga'. \nIncontrai Alfio della Equipe 84, che stava cercando un chitarrista cantante. Decisi di saltare il fosso. Per fortunaÃ‚Â». Con Alfio ed altri musicisti - tra cui Victor Sogliani - Guccini forma una band: si chiamerÃƒÂ , dapprima, &quot;Marinos&quot; (dal nome di uno dei membri, il pianista Marino Salardini) e poi &quot;Gatti&quot;. Suonano tutta l'estate del 1961 alle terme di Sassuolo e nell'inverno vengono ingaggiati perfino in Svizzera, vicino a Basilea. I Gatti - ricorda Guccini - Ã‚Â«per quell'occasione furono ribattezzati e diventarono &quot;I Fusti all'italiana&quot;. Una piccola concessione ai nostri connazionali all'estero. Fu quella l'unica volta in cui cambiammo nome al complesso. Ci pagarono un'esagerazione: dodicimila lire a testa, una cifra da ultimo dell'annoÃ‚Â».\nProprio nel 1961 Francesco si trasferisce con la famigli a Bologna, in Via Massarenti, Ã‚Â«a due passi da Via Paolo FabbriÃ‚Â». L'anno dopo parte per il militare. Con l'eccezione della fase centrale, nonostante i timori, si tratta di un'esperienza \npositiva per Francesco, il quale, prima di partire, aveva scritto Ã‚Â«un po' per pudore un po' per vergognaÃ‚Â» , &quot;L'antisociale&quot;, &quot;La ballata degli annegati&quot; e &quot;VenerdÃƒÂ¬ santo&quot;, canzoni che egli stesso definisce &quot;tentativi&quot;.\nNella sua maturazione musicale e artistica, al ritorno dal militare, risultano decisive, come le chiama lo stesso Guccini, alcune Ã‚Â«diete musicali. Importante fu il Cantacronache di Fausto Amodei, Sergio Liberovici e Michele Straniero, che mi introdusse nel mondo delle canzoni popolari e anarchicheÃ‚Â».\nForte di questo &quot;incontro&quot;, Francesco riprende le sue esibizioni con un gruppo di cui fa parte anche il poeta Adriano Spatola. E intanto riprende a frequentare l'universitÃƒÂ . Con vecchi e nuovi amici il ritrovo preferito ÃƒÂ¨ l'Osteria dei Poeti, senza dimenticare lo storico bar &quot;Grande Italia&quot; e &quot;La Grondaia&quot;.\nNel 1963, Guccini sostiene il suo secondo esame universitario: Storia medievale. Ã‚Â«Il docente era il fratello di Romano Prodi, l'ex Presidente del Consiglio. GuardÃƒÂ² il libretto e vide che l'esame precedente era Filologia romanza, anno 1959. E prima di darmi 28, sorrise ironicamente e disse, riferito al lasso di tempo tra i due esami: 'Vedo che l'ha preparato bene...'. Poi, altri due esami a giugnoÃ‚Â». Ma Francesco, pur dando tutti gli esami, non presenterÃƒÂ  mai la tesi di laurea. Dal 1965, tuttavia, grazie all'interessamento del suo professore di Inglese - Rizzardi - viene assunto alla Dickinson, sede bolognese di un college americano. LascerÃƒÂ  tale incarico (ricoperto in realtÃƒÂ  per il solo mese di Settembre) vent'anni piÃƒÂ¹ tardi. CosÃƒÂ¬ &quot;il maestrone&quot; ricorda quell'esperienza: Ã‚Â«Gli inizi furono bellissimi. A parte la sensazione elettrizzante che dÃƒÂ  il poter insegnare, c'era anche un altro aspetto da non sottovalutare: io e gli studenti eravamo quasi coetanei. 25 anni io, una ventina loro. Con il passare degli anni, le cose cambiarono sempre di piÃƒÂ¹ e il divertimento diminuÃƒÂ¬. Nel 1985 lasciai.Ã‚Â» \nNel 1964, sotto l'influenza di Bob Dylan, Guccini scrive tre pezzi: &quot;Auschwitz&quot;, &quot;ÃƒË† dall'amore che nasce l'uomo&quot; e &quot;Noi non ci saremo&quot;. La prima viene incisa dall'appena costituita Equipe 84 a firma Lunero-Vandelli e, dopo una causa trentennale, solo da pochi anni ÃƒÂ¨ tornata in possesso dell'autore reale. Sempre l'Equipe incide &quot;ÃƒË† dall'amore che nasce l'uomo&quot; mentre &quot;Noi non ci saremo&quot;, a nome Pontiack-Verona, viene incisa dai Nomadi.\nLa brutta esperienza con l'Equipe induce Guccini ad iscriversi alla SIAE, e &quot;Dio ÃƒÂ¨ morto&quot; ÃƒÂ¨ cosÃƒÂ¬ la prima canzone a comparire con la sua firma. Interpretata dai Nomadi, viene censurata dalla Rai ma ottiene Ã‚Â«l'assenso della Radio Vaticana e dello stesso Paolo VI, che definisce il testo un lodevole esempio di esortazione alla pace e al ritorno a giusti e sani principi moraliÃ‚Â».\nIl successo di &quot;Dio ÃƒÂ¨ morto&quot; procura a Guccini un contratto editoriale in esclusiva con la Emi-Voce del Padrone, con un compenso iniziale di ottantamila lire, presto aumentato a cento e quindi a duecento. Per la Emi, appunto, incide il suo primo 33 giri, &quot;Folk beat N.1&quot;, che ha un successo praticamente nullo. All'ultimo momento viene inclusa nel disco &quot;In morte di S.F.&quot; (nota anche con il titolo &quot;Canzone per un'amica&quot;), composta in quei giorni in memoria di un'amica morta in un incidente stradale. Dopo aver registrato il secondo album (&quot;Due anni dopo&quot;), nel gennaio del 1970 Francesco parte per gli Stati Uniti, certamente per la curiositÃƒÂ  di vedere quel Paese che aveva conosciuto attraverso i libri ma, soprattutto, per raggiungere Eloise, una sua allieva del Dickinson con cui aveva intrecciato una relazione sentimentale, contemporaneamente alla &quot;relazione universitaria&quot; con Roberta. Il viaggio ÃƒÂ¨ una vera e propria delusione: degli americani in genere lo infastidiscono certi approcci linguistici che rasentano l'ineducazione; coi familiari di Eloise (con la madre, soprattutto) entra ben presto in aperto conflitto. Insomma: Ã‚Â«l'America era meglio immaginarla che vederlaÃ‚Â», pensa Guccini. E torna a casa. Da quell'esperienza traumatizzante nasce &quot;L'orizzonte di K.D.&quot;, Ã‚Â«dove K.D. sono le iniziali di Karen Dunn, sorella di Eloise. Karen, in realtÃƒÂ , non c'entrava niente. Per pudore o per orgoglio non volli indirizzare la canzone a Eloise, o meglio la indirizzai a lei fingendo di parlare a un'altra. Mi feci inoltre crescere la barba lunga e i capelli ancora piÃƒÂ¹ lunghi. [...] Di quei tempi mi resta la barba. Non l'ho piÃƒÂ¹ fatta, da alloraÃ‚Â».\nAppena rientrato, si trasferisce in Via Paolo Fabbri 43 con la futura moglie Roberta. Nell'ottobre del 1970 esce &quot;L'isola non trovata&quot;, alla cui registrazione collaborano come musicisti Vince Tempera, Ares Tavolazzi ed Ellade Bandini, ovvero il nucleo \noriginario di quello che ancor oggi ÃƒÂ¨ il gruppo di Francesco. Nell'album, che ÃƒÂ¨ pieno di riferimenti letterari (da Gozzano a Salinger), viene inclusa anche &quot;Un altro giorno ÃƒÂ¨ andato&quot;, pubblicata originariamente come singolo. Il 1972 ÃƒÂ¨ l'anno del quarto album (&quot;Radici&quot;), la cui canzone piÃƒÂ¹ famosa e suggestiva resta senza dubbio &quot;La locomotiva&quot;, composta in mezz'ora e basata su un episodio realmente accaduto molti anni prima. L'enorme fama di questa canzone non oscura peraltro la bellezza di altri brani: da &quot;La canzone dei dodici mesi&quot; a &quot;Piccola cittÃƒÂ &quot;, da &quot;Incontro&quot; a &quot;Il vecchio e il bambino&quot;. Dopo l'intermezzo &quot;comico-giullaresco&quot; di Opera buffa (1973), che Guccini oggi liquida come Ã‚Â«un disco inventato e da me non volutoÃ‚Â», nel 1974 esce &quot;Stanze di vita quotidiana&quot; che Francesco, anche per situazioni sgradevoli verificatesi in fase di registrazione, classifica come Ã‚Â«il disco che piÃƒÂ¹ ho odiato nella mia vitaÃ‚Â», nonostante contenga capolavori assoluti quali &quot;Canzone delle osterie di fuori porta&quot; e &quot;Canzone per Piero&quot;.\nBen altra considerazione, da parte dello stesso cantautore, va al successivo &quot;Via Paolo Fabbri 43&quot; (1976), che Guccini definisce Ã‚Â«bello ed entusiasmante. Ancora oggi mi piace moltissimoÃ‚Â». La trama della canzone che dÃƒÂ  il titolo all'album ÃƒÂ¨ tessuta su citazioni della vita quotidiana dello stesso Guccini e impreziosita dal riferimento a personaggi fondamentali della cultura contemporanea (da Borges a Barthes). Vi sono inoltre citate Ã‚Â«tre eroine della canzone italiana: due evidenti (Alice e Marinella), una piÃƒÂ¹ nascosta (la piccola infelice, cioÃƒÂ¨ Lilly). Frecciatine rivolte a De Gregori, De AndrÃƒÂ©, Venditti. Mi sembrava avessero accettato piÃƒÂ¹ facilmente di me anche gli aspetti negativi di questo mestiere. Io ho impiegato piÃƒÂ¹ tempo. Infatti i miei eroi eran poveri e si chiedevano troppi perchÃƒÂ©Ã‚Â». Si tratta di una canzone molto vera, sentita, a cui Francesco ÃƒÂ¨ ovviamente legato; come ÃƒÂ¨ legato - per sua esplicita ammissione - a &quot;L'avvelenata&quot; e a &quot;Il pensionato&quot;. L'album successivo ÃƒÂ¨ &quot;Amerigo&quot;, pubblicato nel 1978. Della canzone omonima, dedicata ad Enrico, un suo prozio emigrato in America e morto nel 1963, Guccini afferma, quasi enfaticamente ma con trasporto e sinceritÃƒÂ , che Ã‚Â«ÃƒÂ¨ la piÃƒÂ¹ bella, \ncompleta, finita, ricca di cose e forse una delle piÃƒÂ¹ belle che io abbia mai scrittoÃ‚Â». Essa ÃƒÂ¨ in sostanza un confronto-contrasto tra l'America reale di &quot;Amerigo&quot; (fatta di lavoro e fatica, di giorni duri e difficili, di sudore e antracite) e quella di Francesco, Ã‚Â«sognata a PÃƒÂ vana dal mulino e da bambinoÃ‚Â»: due Ã‚Â«immagini che non si sovrappongono se non nel finale, quando capisco che quell'uomo era il mio volto, era il mio specchio. Amerigo ero ioÃ‚Â».\nNello stesso anno, dall'unione con la nuova compagna, Angela, nasce la prima ed unica figlia di Guccini. Dopo l'Album concerto, il live realizzato con i Nomadi nel 1979, nel 1981 esce &quot;Metropolis&quot;, altro disco non troppo amato dall'autore. Il 1983 ÃƒÂ¨ l'anno di uscita di &quot;Guccini&quot;. Fra le sei canzoni che compongono l'album,\n&quot;Autogrill&quot; ÃƒÂ¨ definita dallo stesso autore come Ã‚Â«la canzone piÃƒÂ¹ misteriosa in assoluto [...], intravista e non vissuta, venuta fuori chissÃƒÂ  come. Nacque a PÃƒÂ vana ed ÃƒÂ¨ il resoconto di ciÃƒÂ² che non fu mai, ovvero un sogno mai avveratoÃ‚Â». Quanto all'album stesso, dice: Ã‚Â«Guccini ÃƒÂ¨ per me l'impossibilitÃƒÂ  di viaggiare. Puoi raggiungere ogni parte del mondo in poche ore ma sei sempre condannato a essere turista. Per viaggiare e al tempo stesso vivere bisognerebbe avere sei o sette viteÃ‚Â». Nel 1984 Francesco partecipa al grande concerto di Piazza Maggiore, a Bologna, cui prendono parte altri artisti, dai Nomadi a Paolo Conte, da Giorgio Gaber all'Equipe 84. Ã‚Â«Parte di quel concerto finÃƒÂ¬ su Fra la Via Emilia e il West. Due volumi recentemente stampati anche su CDÃ‚Â».\nDopo tre anni fuori dai riflettori, esce nel 1987 Signora Bovary: ÃƒÂ¨ l'album di &quot;Culodritto&quot; e &quot;Van Loon&quot; dedicate, rispettivamente, alla figlia (Teresa) ed al padre scomparso (Ferruccio).\nPersonaggio eclettico e poliedrico, Guccini alla fine degli anni ottanta (1989) si affaccia anche al mondo della letteratura, pubblicando presso Feltrinelli &quot;CrÃƒÂ²niche epafÃƒÂ niche&quot; cui seguirÃƒÂ  nel 1993, quale suo Ã‚Â«seguito naturaleÃ‚Â», Vacca d'un cane, edito ancora da Feltrinelli.\nIl 1990 (anno di uscita di &quot;Quello che non...&quot;) regala agli appassionati di musica veri e propri capolavori. Ã‚Â«Battezzai gli anni '90 con la negazione di &quot;Quello che non...&quot;. Una negazione che tutti hanno definito montaliana e che invece ÃƒÂ¨, piÃƒÂ¹ semplicemente, lo sfogo di uno che scopre di vivere con una persona che non lo considera piÃƒÂ¹ molto. Nel brano che dÃƒÂ  il titolo all'album, la coppia non esiste, ÃƒÂ¨ dissolta, sparita, non ÃƒÂ¨ piÃƒÂ¹ niente. L'io narrante si rivolge a un'interlocutrice, come spesso accade nelle mie canzoni. La dissoluzione del rapporto emerge da una serie di immagini secche che, in apparenza, non hanno molto a che fare con il rapporto di coppia e che si sovrappongono l'una all'altra. Era un momento mio di grandi incertezze. Nonostante si trattasse di una questione privata, sotto c'era anche, per vie oblique, tutto il malessere delle sinistre, in evidente crisi d'identitÃƒÂ . Credo che entrambi i disamori si siano influenzati a vicendaÃ‚Â». Il secondo brano, Canzone delle domande consuete, viene premiata dal Club Tenco di Sanremo come &quot;canzone dell'anno&quot;.\nBisognerÃƒÂ  aspettare altri quattro anni per ascoltare un nuovo LP del &quot;maestrone&quot;: nel 1990, infatti, esce &quot;Parnassius Guccini&quot;, disco Ã‚Â«un po' ruvidoÃ‚Â» a detta dello stesso cantautore che spiega anche l'origine del titolo: Ã‚Â«nel 1993 arriva la farfalla. O meglio, la farfalla arriva molto prima, ma solo in quell'anno viene accostata al mio nome. Giovanni Sala, un entomologo dilettante, scoprÃƒÂ¬ una nuova farfalla nell'appennino tosco-emiliano e decise di chiamarla Parnassius Mnemosyne Guccini in mio onore e per gratitudine, essendo abituale consumatore dei miei dischi e della mia musica. Questa cosa mi fece molto piacere, un po' perchÃƒÂ© la farfalla in questione era una sorta di lepidottero robusto e montanaro, non quindi una di quelle farfalle bellissime e un po' fighette che si vedono in giro; un po' perchÃƒÂ© mi gratificava l'idea di aver dato un nome a qualcosa che sarebbe durata per sempre. Non so, infatti, se la mia musica abbia questa facoltÃƒÂ Ã‚Â». Il disco si apre con Canzone per Silvia, che ha per protagonista Silvia Baraldini, Ã‚Â«la cui storia, indipendentemente dalle idee politiche e dal giudizio di colpa, deve far riflettere chiunque abbia a cuore i diritti umaniÃ‚Â». Nel 1996 appare &quot;D'amore di morte e di altre sciocchezze&quot;, in cui, oltre a Cirano e Quattro stracci, spicca Lettera, un brano dedicata a due amici scomparsi: Bonvi e Victor Sogliani.\nDodici mesi dopo, Francesco fa il suo esordio nella letteratura noir con &quot;MacaronÃƒÂ¬&quot;, un giallo scritto a quattro mani con Loriano Macchiavelli e subito tradotto in tedesco e in francese. \nNel 1998, per celebrare i trent'anni di attivitÃƒÂ , la Emi pubblica raccolte di artisti della sua etichetta: in questo contesto vede la luce il doppio album &quot;Guccini live collection&quot;, che non ÃƒÂ¨ opera del cantautore, il quale precisa: Ã‚Â«non ho seguito tutte le fasi di lavorazione, ho semplicemente dato il mio assenso alla Emi affinchÃƒÂ© lo pubblicasse. La prova che io non c'entro ÃƒÂ¨ data da quel terribile errore ortografico in copertina: nel titolo &quot;Un'altro giorno ÃƒÂ¨ andato&quot;, &quot;un altro&quot; ÃƒÂ¨ scritto  con l'apostrofo. Mi sono indignato assai. [...] Tutto, dalla grafica alla copertina alla scelta delle canzoni, ÃƒÂ¨ stato fatto con il mio assenso, ma senza di meÃ‚Â».\nSempre nel 1998, e sempre in collaborazione con Macchiavelli, pubblica &quot;Un disco dei Platters&quot; e dÃƒÂ  inoltre alle stampe il suo atteso Dizionario del dialetto di PÃƒÂ vana (NuÃƒÂ¨ter, Pavana). \nÃƒË† sempre dello stesso anno la partecipazione nel film di Luciano Ligabue (&quot;Radiofreccia&quot;), nella parte di Ã‚Â«un barista scoglionato, burbero ma buonoÃ‚Â».\nNel 2000 esce &quot;Stagioni&quot;, che da Paolo Jachia, forse il piÃƒÂ¹ attento studioso del nostro cantautore, ÃƒÂ¨ stato definito Ã‚Â«una summa delle tematiche che accompagnano tutta la produzione artistica e intellettuale di Francesco: l'esistenzialismo, la polemica contro tutte le ingiustizie e i falsi ideali, il vivere giornaliero e lo scorrere inesorabile del tempo, la rabbia e l'indignazione per la propria impotenza a cambiare le cose e la vita, e poi l'amore, visto come specchio di se stessi, delle proprie belle illusioni e anche delle proprie fragilitÃƒÂ , e ancora la fantasia e l'ironia e l'umorismo come baluardo contro l'inutile follia realista degli uomini integrati al potere, e poi la coerenza con la propria storia e le proprie radici, la coscienza dell'appartenere, in senso profondo, alla terra e al popolo, e il rifiuto della cultura piccolo borghese e l'adesione profonda al grande sogno anarchico, libertario, democratico, comunista (l'Utopia)Ã‚Â» [P. Jachia: Francesco Guccini, Editori Riuniti, Roma 2002, p. 183].\nDopo due ennesime fatiche letterarie a quattro mani con Loriano Macchiavelli (&quot;Questo sangue che impasta la terra&quot; e &quot;Lo spirito e altri briganti&quot;) e dopo aver raccontato la Bologna di quarant'anni fa in CittanÃƒÂ²va Blues, il 2004 ÃƒÂ¨ l'anno dell'ultimo album di Francesco Guccini in ordine cronologico: Ritratti. Un album musicale, lirico e coinvolgente come pochi altri.\n\nDiscografia\n\n Folk beat N.1 [40'59''] \n(1966, La voce del padrone) \n \n Due anni dopo [41'15''] \n(1970, EMI Columbia) \n \n L'isola non trovata [39'26''] \n(1971, EMI Columbia) \n \n Radici [40'39''] \n(1972, EMI Columbia) \n \n Opera buffa [29'17''] \n(1973, EMI Columbia) \n \n Stanze di vita quotidiana [40'50''] \n(1974, EMI Columbia) \n \n Via Paolo Fabbri 43 [33'29''] \n(1976, EMI Italiana) \n \n Amerigo [35'30''] \n(1978, EMI Italiana) \n \n Francesco Guccini &amp; I Nomadi - Album concerto [35'27''] \n(1979, EMI Italiana) \n \n Metropolis [31'55''] \n(1981, EMI Italiana) \n \n Guccini [30'40''] \n(1983, EMI Italiana) \n \n Fra la via Emilia e il West [42'04'' + 46'26''] \n(1984, EMI Italiana) \n \n Signora Bovary [38'02''] \n(1987, EMI Italiana) \n \n ...quasi come Dumas... [47'43''] \n(1988, EMI Italiana) \n \n Quello che non... [44'25''] \n(1990, EMI Italiana) \n \n Parnassius Guccini [45'08''] \n(1994, EMI Italiana) \n \n D'amore di morte e di altre sciocchezze [49'27''] \n(1996, EMI Italiana) \n \n Guccini live collection [65'28'' + 64'46''] \n(1998, EMI Music Italy) \n \n Stagioni [42'11''] \n(2000, EMI Music Italy) \n \n Ritratti [46'31''] \n(2004, EMI Music Italy) \n\n\nBibliografia\n\n CRÃƒâ€™NICHE EPAFÃƒâ‚¬NICHE\nGuccini F., Feltrinelli, Milano 1989\n\n VACCA D'UN CANE\nGuccini F., Feltrinelli, Milano 1993\n\n MACARONÃƒÅ’\nGuccini F. - Macchiavelli L., Mondadori, Milano 1997\n \n UN DISCO DEI PLATTERS\nGuccini F. - Macchiavelli L., Mondadori, Milano 1998\n\n UN ALTRO GIORNO ÃƒË† ANDATO\nGuccini F. - Cotto M., Giunti, Firenze 1999\n\n STORIA DI ALTRE STORIE\nGuccini F. - Cerami V., Piemme, Casale Monferrato 2001\n\n QUESTO SANGUE CHE IMPASTA LA TERRA\n\n LO SPIRITO E ALTRI BRIGANTI\nGuccini F. - Macchiavelli L., Mondadori, Milano 2002\n\n CITTANÃƒâ€™VA BLUES\nGuccini F., Mondadori, Milano 2003\n\n\nDicono di lui\n\nSe Fabrizio De AndrÃƒÂ¨ ÃƒÂ¨ stato un poeta della canzone.\nSe Francesco De Gregori ÃƒÂ¨ un intellettuale con la chitarra.\nGuccini ÃƒÂ¨ la sintesi di entrambi.\nGuccini non ha di De AndrÃƒÂ¨ l'immediatezza, la folgorazione.\nNon ha il ragionamento distaccato di De Gregori.\nMa ha tutto il resto.\nIronia, senso della storia, capacitÃƒÂ  di indignarsi, impegno politico vissuto con sospetto, curiositÃƒÂ  verso il mondo.\nRoberto Cotroneo, giornalista e scrittore\n\nSapeste quante scopate che ci ho dato sulla schiena quando invece di studiare si metteva a suonare in camera sua con quelli dell'Equipe 84?\nEster Prandi, la sua mamma\n\nSe dovessi azzardare, in due parole, qual'ÃƒÂ¨ il denominatore comune dei testi di Guccini direi che ÃƒÂ¨ la gioia dell'impegno, la gioia di combattere le ingiustizie, la gioia di non essere come quell'Italia egoista e volgare vorrebbe che fossimo.\nVincenzo Cerami, giornalista e scrittore\n\nQuesto bambino diventerÃƒÂ  il miglior cantante di tutte le piazze d'Italia.\nTajadela - cantastorie bolognese che incontrÃƒÂ² Francesco alla stazione di Modena e a quella di Porretta nel 1943\n\nFrancesco io lo vedo come un albero, con delle radici solidissime, ben piantate in via Paolo Fabbri 43 o a PÃƒÂ vana.\nRed Ronnie, ex-bancario, ex-cantante, adesso presentatore tv\n\nLa Locomotiva ÃƒÂ¨ una delle ballate piÃƒÂ¹ belle mai scritte in Italia. C'ÃƒÂ¨ tutto il secolo in sintesi: il mito del progresso, l'anarchia, i fantasmi e le urgenze di un'epoca pulsante.\nSergio Staino, disegnatore e creatore di Bobo\n\nQuella di Guccini ÃƒÂ¨ la voce di quello che un tempo si diceva il &quot;movimento&quot;. Oggi, semplicemente una voce di gioventÃƒÂ¹. E cioÃƒÂ¨ di granitica coerenza con il proprio linguaggio e pensiero. Nella sua opera c'ÃƒÂ¨ un discorso interminabile: sull'ironia, sull'amicizia, sulla solidarietÃƒÂ .\nDario Fo, premio Nobel per la letteratura\n\nSe mi avessero dato venti lire ogni volta che ho ascoltato &quot;Incontro&quot; mi ci sarei comprato un biglietto aereo da farci il giro del mondo.\nConosco tutte le canzoni di Guccini a memoria.\nQuando sono andato cercarlo a PÃƒÂ vana e mi si ÃƒÂ¨ dischiuso in tutta la sua grandezza, ÃƒÂ¨ stato come essere davanti alla Madonna di Loreto.\nLeonardo Pieraccioni, comico - attore - regista e anche un po' cantautore\n\n\nGuccini ÃƒÂ¨ forse il piÃƒÂ¹ colto dei cantautori in circolazione: la sua ÃƒÂ¨ poesia dotta, intarsio di riferimenti. Guccini ÃƒÂ¨ un cantore da vaste pianure.\nGuccini ÃƒÂ¨ omerico, procede per agglomerazione, ha una gran sfacciataggine nell'osare una metafora dietro l'altra.\nUmberto Eco, semiologo \n\n\nAbbiamo delle nonne in comune io e Guccini. Fa piacere avere tra i parenti un tipo come lui. Sembra che non si sia mai allontanato da PÃƒÂ vana, e racconta storie che hanno come scenario quei paesaggi che hanno \naccompagnato anche la mia infanzia: col cuore e le parole dei poeti.\nEnzo Biagi, giornalista\n\nDe' AndrÃƒÂ¨ era l'unico poeta della canzone d'autore. Gli altri, me compreso, con l'eccezione forse di Guccini, sono bravi, non poeti.\nRoberto Vecchioni, cantautore e musicologo\n\n\n\n\n\nVisit http://www.tntvillage.scambioetico.org/",
  "parsed": {
    "xt": "urn:btih:672c87df091cba85acf4f950e604c2790aa26fdd",
    "dn": "Francesco Guccini - Discografia Completa [Mp3 - Ita] [Tntvillage",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "672c87df091cba85acf4f950e604c2790aa26fdd",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        103,
        44,
        135,
        223,
        9,
        28,
        186,
        133,
        172,
        244,
        249,
        80,
        230,
        4,
        194,
        121,
        10,
        162,
        111,
        221
      ]
    },
    "name": "Francesco Guccini - Discografia Completa [Mp3 - Ita] [Tntvillage",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 58,
  "peers": 0,
  "last_updated": "2016-12-25T03:23:20.982Z"
}