{
  "title": "The Americans - Season 2",
  "uid": 13715808,
  "size": 6390929687,
  "categoryP": "video",
  "categoryS": "movies",
  "magnet": "?xt=urn:btih:680f3b5084fe3e0a3eabec3efa86a68685e32ba8&amp;dn=The+Americans+-+Season+2&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 104,
  "leechers": 47,
  "uploader": "POtHS11",
  "files": 19,
  "time": 1456906770,
  "description": "Comrades\r\nElizabeth comes back from her injury and straight into what should have been a routine mission - but it goes awry, leaving her and Philip in fear not only for themselves but for their whole network... and family. Paige's suspicions have only grown in her mother's absence. Meanwhile, Stan continues to fall for the Russian agent who has started to play him.\r\n \r\nCardinal\r\nS2, Ep2\r\n5 Mar. 2014\r\nCardinal\r\nAs Philip investigates the fallout from the last operation, Elizabeth sticks close to home, concerned for her family until she gets a mysterious distress signal. Meanwhile, a walk-in arrives at the Rezidentura - providing both Nina and Stan with unique opportunities.\r\n \r\nThe Walk-In\r\nS2, Ep3\r\n12 Mar. 2014\r\nThe Walk-In\r\nPhilip and Elizabeth complete their next mission - but not without complications - and Philip's fears about Elizabeth's readiness for action deepen. Stan tracks the KGB walk-in which leads to much praise at work and a deepening of his attachment to, and dependence on, Nina. Meanwhile, Paige snoops into her mother's family background and Oleg begins to scrutinize Nina's secret operation.\r\n \r\nA Little Night Music\r\nS2, Ep4\r\n19 Mar. 2014\r\nA Little Night Music\r\nJust when Philip and Elizabeth think they have a quiet road ahead, an old friend returns to complicate things. Not only do they have to intercept a target who could prove valuable to the Soviet Union, but they also have to take on an important rogue mission without the support of the Centre. Divisions inside the Rezidentura deepen between Oleg and Arkady and there's an upheaval at the FBI as the chickens come home to roost for Agent Gaad. Meanwhile, Martha's frustrations threaten to blow Philip's cover.\r\n \r\nThe Deal\r\nS2, Ep5\r\n26 Mar. 2014\r\nThe Deal\r\nPhilip and Elizabeth are finally assigned a new handler as Philip works to clean up the mess of the last operation and Elizabeth, in disguise as Clark's sister Jennifer, does her best to smooth things over with Martha. As Stan searches for a missing scientist, Oleg and Arkady continue to argue over how best to handle the situation on their side, leaving Nina once again caught between the FBI and KGB.\r\n \r\nBehind the Red Door\r\nS2, Ep6\r\n2 Apr. 2014\r\nBehind the Red Door\r\nA dangerous Naval officer becomes the key to Philip and Elizabeth's mission as well as a potential threat to their family's safety. Lucia, a Sandinista intelligence officer working with the Jennings, is tasked with getting Elizabeth access to Capitol Hill. Stan struggles with the potential costs of protecting Nina.\r\n \r\nArpanet\r\nS2, Ep7\r\n9 Apr. 2014\r\nArpanet\r\nPhilip uses his agent Charles Duluth to help him gain access to an early precursor to the Internet so that the KGB can bug American government communications. Nina faces the threat of a potential FBI polygraph exam, bringing her closer to KGB colleague Oleg.\r\n \r\nNew Car\r\nS2, Ep8\r\n16 Apr. 2014\r\nNew Car\r\nPhilip and Elizabeth both find themselves faced with painful turns in their various missions. Stan fights to gain access to an American military program that could give him the upper hand in his battle of wills with Oleg.\r\n \r\nMartial Eagle\r\nS2, Ep9\r\n23 Apr. 2014\r\nMartial Eagle\r\nPhilip and Elizabeth's long-planned mission turns ugly, impacting each of them in different ways. Stan digs in deeper at work as his personal life continues to unravel.\r\n \r\nYousaf\r\nS2, Ep10\r\n30 Apr. 2014\r\nYousaf\r\nA new mission with international stakes has Philip calling on Annelise for assistance just as an old foe returns to D.C. with a vendetta. Stan makes a discovery that could put the FBI hot on the trail of illegals.\r\n \r\nStealth\r\nS2, Ep11\r\n7 May 2014\r\nStealth\r\nElizabeth makes a shocking discovery about Kate. Philip pursues a contact for information about the new Stealth technology. Stan continues his pursuit of the illegals.\r\n \r\nOperation Chronicle\r\nS2, Ep12\r\n14 May 2014\r\nOperation Chronicle\r\nWith Larrick closing in, Elizabeth rushes to exfiltrate Jared while Philip readies Fred for a crucial mission. Arkady finally plays his hand, forcing Stan to make an impossible choice.\r\n \r\nEcho\r\nS2, Ep13\r\n21 May 2014\r\nEcho\r\nNina finds that her future is Stan's hands. Meanwhile, Paige and Henry are moved to safety as their parents attempt to complete their assignment",
  "parsed": {
    "xt": "urn:btih:680f3b5084fe3e0a3eabec3efa86a68685e32ba8",
    "dn": "The Americans - Season 2",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "680f3b5084fe3e0a3eabec3efa86a68685e32ba8",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        104,
        15,
        59,
        80,
        132,
        254,
        62,
        10,
        62,
        171,
        236,
        62,
        250,
        134,
        166,
        134,
        133,
        227,
        43,
        168
      ]
    },
    "name": "The Americans - Season 2",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 100,
  "peers": 50,
  "last_updated": "2016-12-27T02:38:38.499Z"
}