{"title":"OS X Mavericks 10.9 DP1 VMware Image","uid":8613143,"size":4866368995,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:68f35909aef931e1fefbf872bfb5101bf09e2ca4&amp;dn=OS+X+Mavericks+10.9+DP1+VMware+Image&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":73,"leechers":11,"uploader":"SoulUploader","files":5,"time":1372191696,"description":"Full release notes can be found in this post:\n\nFirst version of the OS X Mavericks VMware Image. Contains OS X Mavericks DP1, and is compiled entirely from stock. Boots on average around a minute although it can be in as little as 25 seconds sometimes., but make sure to give up to 10 just in case. Recommended you watch the setup video contained in the download to get it working properly, anything covered in that won't be addressed in the comments. First boot will be slower compared to future startups.\n\nXcode can be installed via the App Store, as it functions *perfectly* as a Mac. AMD users should consult the setup guide beforehand as only certain models work so it's your call if you want to try it or not, however it's always worth a shot.\n\nWorks with Player, Workstation and Fusion, both old and new versions. Watch the Setup Guide to set it all up properly (it'll help you to no end). Without following the setup guide it's more than likely you'll have no luck.\n\nPlease note: The Hardware Bypasser included was created using Tola's Patching Engine 2.03b and packaged using UPX 3.07, which results in false reports from certain virus scanners. All it does is reconstruct the vmware-vmx.exe file in the VMware Program Files folder when run. If you're unwilling to take my word for it, just open the archive in 7zip (before you extract) and delete &quot;vmware-vmx-patch.exe&quot;, which will remove it. \n\nIf you wanna follow my work/releases follow us at http://souldevteam.net/blog.","torrent":{"xt":"urn:btih:68f35909aef931e1fefbf872bfb5101bf09e2ca4","amp;dn":"OS+X+Mavericks+10.9+DP1+VMware+Image","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68f35909aef931e1fefbf872bfb5101bf09e2ca4","infoHashBuffer":{"type":"Buffer","data":[104,243,89,9,174,249,49,225,254,251,248,114,191,181,16,27,240,158,44,164]},"announce":[],"urlList":[]}}