{
  "title": "Spring Break Fuck Parties 5 Split Scenes",
  "uid": 12399481,
  "size": 1899755122,
  "categoryP": "porn",
  "categoryS": "movies",
  "magnet": "?xt=urn:btih:69a4c6080b4fc1884c7757547f6a5a549f382d9d&amp;dn=Spring+Break+Fuck+Parties+5+Split+Scenes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 55,
  "leechers": 15,
  "uploader": "EndYou",
  "files": 4,
  "time": 1441997655,
  "description": "                                 :Description:\n                                 -------------\nNaughty Secret Santa Starring Moriah Tyler And Sydney Cole\n\nThese hot little minxes were getting ready for their Xmas party when the guys finally showed up. These dudes give these tight and tiny teens exactly what they want - dick in a box! The girls never saw it coming - but boy were they happy with their gifts! They sucked, stroked and fucked these holiday cocks with all the Yuletide spirit they could muster and in the end both of these slutty little elves got their mouths and faces covered in spunk! Happy Holidays from all of us!\n\nCyber Sluts Starring Taylor Reed, Mandy Muse, Naomi Heart and Nezvera Spice\n\nThese sexy babes were hacking away when they're discovered by their biggest rivals! The guys were ready to fuck some shit up - but instead settled on fucking some pussy instead. There was a nerd orgy going on as two chicks were getting plowed on a table! The guys inserted their hard drives deep into some free slots and made sure the girls never tired hacking again. In the end, their faces were soaked with spunk and these chicks were more than happy to lick it up!\n\nRoad Trip! starring Elena Gerbert, Alexis Crystal and Tayna\n\nOne of our overseas studs met up with these 3 Euro teens in the Czech Republic. Who knew that these Prague girls came stacked with such big asses? While driving they spotted a guy and got him in the van. Right away, Alexis ripped his pants off and went to town on his lovestick and with her pigtailed homegirl! This lucky hitchhiker fucked Alexis' pussy while her friend came in and took over with her mouth until he finally came all over Alexis' face and her friend's mouth!\n\nValentine's Day Starring Paisley Parker, Cassidy Klein and Nezvera Spice\n\nCassidy and her friends were busy making a special treat for some special dudes on Valentines day. They soon discovered they had the same Valentine! As payback, they blindfold him and had him taste test their muffins and cake! They each suck his cock, before Cassidy jumped on the counter looking to get fucked by that fat cock! Her homegirl got in on the action too! In the end, Cassidy and her friends made sure to get all the frosting out of his tube!\n\nMandy Muse, Sydney Cole, Cassidy Klein, Alexis Crystal, Paisley Parker, Taylor Reed, Elena Gilbert, Tayna, Mariah Taylor\n\n                                 :Screenshots:\n                                 -------------\n                       &lt;a href=&quot; http://imgpremium.com/image/I&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://imgpremium.com/image/I&lt;/a&gt;\n                       &lt;a href=&quot; http://imgpremium.com/image/P&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://imgpremium.com/image/P&lt;/a&gt;\n                       &lt;a href=&quot; http://imgpremium.com/image/S&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://imgpremium.com/image/S&lt;/a&gt;\n                       &lt;a href=&quot; http://imgpremium.com/image/l&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://imgpremium.com/image/l&lt;/a&gt;\n                       &lt;a href=&quot; http://imgpremium.com/image/0&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://imgpremium.com/image/0&lt;/a&gt;",
  "parsed": {
    "xt": "urn:btih:69a4c6080b4fc1884c7757547f6a5a549f382d9d",
    "dn": "Spring Break Fuck Parties 5 Split Scenes",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "69a4c6080b4fc1884c7757547f6a5a549f382d9d",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        105,
        164,
        198,
        8,
        11,
        79,
        193,
        136,
        76,
        119,
        87,
        84,
        127,
        106,
        90,
        84,
        159,
        56,
        45,
        157
      ]
    },
    "name": "Spring Break Fuck Parties 5 Split Scenes",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 22,
  "peers": 9,
  "last_updated": "2016-12-27T02:48:34.488Z"
}