{
  "title": "DEEPFREEZE STANDARD 7.22.060.3453  + SERIAL LATEST",
  "uid": 6768974,
  "size": 23411161,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:6a2866e6f6d2423e88ca6b1cc6ae12d9d35643a0&amp;dn=DEEPFREEZE+STANDARD+7.22.060.3453++%2B+SERIAL+LATEST&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 67,
  "leechers": 1,
  "uploader": "BLACKTROY",
  "files": -1,
  "time": 1319506321,
  "description": "Faronics Deep Freeze helps eliminate workstation damage and downtime by making computer configurations indestructible. Once Deep Freeze is installed on a workstation, any changes made to the computerregardless of whether they are accidental or maliciousare never permanent. Deep Freeze provides immediate immunity many of the problems that plague computers todayinevitable configuration drift, accidental system misconfiguration, malicious software activity, and incidental system degradation. Deep Freeze ensures computers are absolutely bulletproof, even when users have full access to system software and settings. Users get to enjoy a pristine and unrestricted computing experience, while IT personnel are freed tedious helpdesk requests, constant system maintenance, and continuous configuration drift.\nBalancing Security with Productivity\nDeep Freeze is the only solution that effectively balances workstation security with user productivity. By mapping user and application data to a Thawed (unprotected) partition or drive, users are able to store their documents, pictures, music, etc., while still enjoying the total system consistency that Deep Freeze offers.\nFlexible Resiliency\nDeep Freeze offers flexible scheduling options that enable IT administrators to easily create automated update and maintenance periods. Schedule Deep Freeze to allow system and virus definition updates to occur predefined timeseither with the Deep Freeze Enterprise Console or using your preferred third-party desktop management solution.\nVisit the Key Features page for a full listing of Deep Freeze's capabilities and options for the two Windows editions: Standard and Enterprise. Mac OS X, Linux, and Windows Server editions are also available.\nDiscover how Deep Freeze applies to your environment:\nEducation Corporate &amp; Government Hospitality Libraries\nEducation Corporate/Government Hospitality Libraries\nEducation\nComputers in education environments are among the toughest IT environments to manage and secure. The large number of daily users, the limited resources of on-site staff, and the immense number of computers and labs that technology personnel must manage all come together to create an IT 'perfect storm'. IT personnel cannot afford to have computer systems down for longstudents use computers in schools to conduct research and complete assignments; instructors need computers to record grades and organize their lessons; administrative staff need their workstations to complete their job function.\nComputer Labs\nDeep Freeze makes it easy for IT administrators to create bulletproof computer labs that deliver trouble-free computing to instructors and students. Deep Freeze ensures that students are able to use public access computers with the assurance that their session will be free accidental system misconfiguration, malicious software activity, and incidental system degradation. Personal information is never retained by the computer, which means IT personnel dont need to worry about desktop computers becoming congested with student projects and files. Computing environments become easier to manage, and expensive computer assets are kept running at 100% capacity.\nDeep Freeze's ability to prevent stability degradation ensures that scholastic computer labs are able to provide the same experience over and over again regardless of the user on the desktopan important prerequisite to successfully teaching a classroom concept.\nAdministrative Machines\nDeep Freeze is not just for student machines; it can also be used on instructor and employee computers. Since Deep Freeze offers flexible options for saving user data, it becomes easy to secure a workstation with total resiliency while still enabling users to save their work. Instructors and staff enjoy the assurance of knowing their computers will never fail them, and IT personnel are freed having to deal with tedious helpdesk requests.\nLibraries\nDeep Freeze ensures that students and staff enjoy a trouble-free library computing experience. Students are able to use library computers with the assurance that their session will be free malicious software and system slowdowns. IT personnel can rest easy with the knowledge that Deep Freeze makes media computers immune system slowdowns and software corruption caused by students accessing online media resources during their research.\nOS : Win XP/2000/Vista/Win 7\nLanguage : English\n\n",
  "parsed": {
    "xt": "urn:btih:6a2866e6f6d2423e88ca6b1cc6ae12d9d35643a0",
    "dn": "DEEPFREEZE STANDARD 7.22.060.3453    SERIAL LATEST",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "6a2866e6f6d2423e88ca6b1cc6ae12d9d35643a0",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        106,
        40,
        102,
        230,
        246,
        210,
        66,
        62,
        136,
        202,
        107,
        28,
        198,
        174,
        18,
        217,
        211,
        86,
        67,
        160
      ]
    },
    "name": "DEEPFREEZE STANDARD 7.22.060.3453    SERIAL LATEST",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 68,
  "peers": 28,
  "last_updated": "2016-12-25T03:41:50.677Z"
}