{"title":"Sim City 4 Deluxe Edition (GOG)","uid":10275346,"size":1119164732,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6c0db5caa3b2265da5c1be5a9756d2946c80ed53&amp;dn=Sim+City+4+Deluxe+Edition+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":86,"leechers":2,"uploader":"Sarah116","files":-1,"time":1401646414,"description":"Hey guys, here Sim city 4 deluxe edition. It includes the base game and &quot;Rush Hour&quot; expansion. All bonus content is included. Hope you guys enjoy and please help seed.\n\n\n-------------------------\n\n\nBonus content included for FREE with purchase: \n\n- Manual \n\n- Wallpaper\n\n-------------------------\n\n\nWhat's cool about it:\n\n\n- SimCityâ„¢ 4 Deluxe Edition includes the base game and the SimCityâ„¢ 4 Rush Hour expansion.\n\n\n- Create a megalopolis by weaving together a tapestry of cities ranging from a bedroom community to a high tech urban center or a vacation destination to a farming village.\n\n\n- Use &quot;god-like&quot; powers to create mountain ranges, carve valleys, and lay rivers to construct the most realistic metropolis imaginable.\n\n\n---------------------------\n\n\nIn SimCity 4, you don't just build your city, you breathe life into it. Create a megalopolis by weaving together a tapestry of cities ranging from a bedroom community to a high tech urban center or a vacation destination to a farming village. You can create a region of interconnected cities sharing and competing for resources that are linked by a fully integrated transportation network. Use &quot;god-like&quot; powers to create mountain ranges, carve valleys, and lay rivers to construct the most realistic metropolis imaginable. The new simulation engine offers immediate feedback so you can react to the needs of an expanding metropolis. Now individual buildings and their lots provide you with feedback. Use the My Sim features to personalize your Sim and immediately move him or her into any area and watch them experience life around town and get instant feedback on the city's progress. Each decision has a greater impact and gives you the ability to respond more effectively.\n\nHave the ultimate level of control over your city's transportation network by completely taking charge of roads, rail, air, waterways, and even vehicles. U-Drive It! missions will be presented for you to solve, such as chasing down a bank robber or apprehending a car-jacker. If missions are completed successfully, you will earn reward buildings and other vehicles. As traction is gained by fixing problems and accomplishing missions, your mayor approval rating will soar and Sims will flock to your city. Choose from all-new road types including wide-avenues, suspension bridges, or one-way streets, as well as map out seamless regional networks that whisk Sims from one city to another. Additional options include going global to create a metropolis based on an all-new modern European building set or personalizing new creations by labeling streets, mountains, neighborhoods, and points of interest. Wreak havoc with all-new disasters including a UFO invasion, massive wrecks at railroad crossings, and the occasional car fender bender. There are also all-new tutorials available to help you get started. New gameplay levels are also available so you can create the city of your dreams.\n\n &lt;a href=&quot;\nhttp://www.gog.com/game/simcity_4_deluxe_edition&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.gog.com/game/simcity_4_deluxe_edition&lt;/a&gt;","torrent":{"xt":"urn:btih:6c0db5caa3b2265da5c1be5a9756d2946c80ed53","amp;dn":"Sim+City+4+Deluxe+Edition+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c0db5caa3b2265da5c1be5a9756d2946c80ed53","infoHashBuffer":{"type":"Buffer","data":[108,13,181,202,163,178,38,93,165,193,190,90,151,86,210,148,108,128,237,83]},"announce":[],"urlList":[]}}