{"title":"John Steinbeck - Nobel Prize in Literature, 1962 (35 books)","uid":15842022,"size":65223190,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6fa9f482a85a30a2fd74019669c4b400bc898bc2&amp;dn=John+Steinbeck+-+Nobel+Prize+in+Literature%2C+1962+%2835+books%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":40,"leechers":4,"uploader":"workerbee","files":70,"time":1474054977,"description":"JOHN STEINBECK (1902-1968) was an American war correspondent, novelist and author.  He was awarded the 1962 Nobel Prize in Literature &quot;for his realistic and imaginative writings, combining as they do sympathetic humour and keen social perception.&quot;\n\nMost of Steinbeck's work is set in southern and central California, particularly in the Salinas Valley and the California Coast Ranges region.  His works frequently explore the themes of fate and injustice, especially as applied to downtrodden or everyman protagonists.  His reputation rests mostly on the naturalistic novels with proletarian themes he wrote in the 1930s; it is in these works that his building of rich symbolic structures and his attempts at conveying mythopoeic and archetypal qualities in his characters are most effective.\n\nSteinbeck's first novel, CUP OF GOLD (1929), was followed by THE PASTURES OF HEAVEN (1932) and TO A GOD UNKNOWN (1933), none of which were successful.  He first achieved popularity with TORTILLA FLAT (1935), an affectionately told story of Mexican Americans.  The mood of gentle humour turned to one of unrelenting grimness in his next novel, IN DUBIOUS BATTLE (1936), a classic account of a strike by agricultural labourers and a pair of Marxist labour organizers who engineer it.  The novella OF MICE AND MEN (1937), which also appeared in play and film versions, is a tragic story about the strange, complex bond between two migrant labourers.\n\nTHE GRAPES OF WRATH (1939) is considered Steinbeck's finest and most ambitious novel.  Telling the story of a dispossessed Oklahoma family and their struggle to carve out a new life in California at the height of the Great Depression, the book captured the mood and angst of the nation during this time period.  At the height of its popularity, the novel sold 10,000 copies per week and eventually earned Steinbeck a Pulitzer Prize in 1940.\n\nFollowing the success of GRAPES, Steinbeck went to Mexico to collect marine life and collaborated in writing SEA OF CORTEZ (1941), a study of the fauna of the Gulf of California.  During World War II Steinbeck wrote some effective pieces of government propaganda, among them THE MOON IS DOWN (1942), a novel of Norwegians under the Nazis, and he also served as a war correspondent.  His immediate postwar work -- CANNERY ROW (1945), THE PEARL (1947), and THE WAYWARD BUS (1947) -- contained the familiar elements of his social criticism but were more relaxed in approach and sentimental in tone.\n\nHis later writings -- which include TRAVELS WITH CHARLEY (1962), about Steinbeck's experiences as he drove across the U.S. -- were interspersed with three conscientious attempts to reassert his stature as a major novelist: BURNING BRIGHT (1950), EAST OF EDEN (1952), and THE WINTER OF OUR DISCONTENT (1961).  In critical opinion, none equaled his earlier achievement.  Outstanding among the scripts he wrote directly for motion pictures were FORGOTTEN VILLAGE (1941) and VIVA ZAPATA! (1952).\n\n\nThis is an updated version of an earlier torrent.  The following books are in ePUB format unless otherwise indicated:\n\n                                                 \n                            == NOVELS &amp; NOVELLAS ==\n\n* Acts of King Arthur and His Noble Knights (Penguin, 2007).  Edited by Chase Horton with a Foreword by Christopher Paolini.\n\n* Burning Bright: A Play in Story Form (Bantam, 1970). -- PDF\n\n* Cannery Row (Penguin, 1992).\n\n* Cup of Gold: A Life of Sir Henry Morgan, Buccaneer, with Occasional Reference to History (Penguin, 2008).  Introduction by Susan F. Beegel.\n\n* East of Eden (Penguin, 1992).  Introduction by David Wyatt.\n\n* Forgotten Village, The: With 136 Photographs from the Film of the Same Name (Penguin, 2009).\n\n* Grapes of Wrath, The (Penguin, 1992).  Introduction by Robert DeMott.\n\n* In Dubious Battle (Penguin, 1992).\n\n* The Moon Is Down (Penguin, 1995).  Introduction by Donald Coers.\n\n* Of Mice and Men (Penguin, 1993).\n\n* Pearl, The (Penguin, 1994).  Introduction by Linda Wagner-Martin.\n\n* Red Pony, The (Penguin, 1994).  Introduction by John Seelye.\n\n* Short Novels of John Steinbeck (Penguin, 2009).\n\n* Short Reign of Pippin IV: A Fabrication (Penguin, 2007).  Introduction by Robert Morsberger and Katherine Morsberger.\n\n* Sweet Thursday (Penguin, 2008).  Introduction by Robert DeMott.\n\n* To A God Unknown (Penguin, 1995).\n\n* Tortilla Flat (Penguin, 1963).\n\n* Wayward Bus, The (Penguin, 2006).  Edited with an Introduction and Notes by Gary Scharnhorst.\n\n* Winter of Our Discontent, The (Penguin, 2008).  Introduction and Notes by Susan Shillinglaw.\n\n* Zapata (Penguin, 2001).  Edited with commentary by Robert E. Morsberger.\n\n\n                                == SHORT STORIES ==\n\n* Chrysanthemums &amp; Other Stories (Penguin, 1995). -- PDF\n\n* Long Valley, The (Penguin, 1995).  Introduction and Notes by John H. Timmerman.\n\n* Pastures of Heaven, The (Penguin, 1995).  Introduction and Notes by James Nagel.\n\n\n                                 == NON-FICTION ==\n\n* America and Americans &amp; Selected Nonfiction (Viking, 2001).  Edited by Susan Shillinglaw and Jackson J. Benson.\n\n* Art of Fiction, The (Paris Review, Fall 1969).  Interview by Nathaniel Benchley. -- PDF\n\n* Bombs Away: The Story of a Bomber Team (Penguin, 2009).  Second edition.  With an Introduction by James H. Meredith.\n\n* Harvest Gypsies, The: On the Road to the Grapes of Wrath (Heyday, 2002).  \n\n* Log from the Sea of Cortez, The (Penguin, 1995).  Introduction by Richard Astro.\n\n* Nobel Prize Acceptance Speech (Nobel Library, 1971) -- PDF\n\n* Once There Was A War (Penguin, 2007).  Introduction by Mark Bowden.\n\n* A Russian Journal (Penguin, 1999).  With Photographs by Robert Capa, and an Introduction by Susan Shillinglaw.\n\n* Sea of Cortez: A Leisurely Journal of Travel and Research (Penguin, 2009).  With Edward F. Ricketts.\n\n* Steinbeck: A Life in Letters (Penguin, 1976).  Edited by Elaine Steinbeck and Robert Wallsten.\n\n* Travels With Charlie: In Search of America (Penguin, 2011).\n\n* Working Days: The Journals of &quot;The Grapes of Wrath&quot; 1938-1941 (Penguin, 1990).  Edited by Robert DeMott.\n\n_____________________________________________________________________________\n\n\nCONTACT ME: You can reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account): \nhttps://pirates-forum.org/User-workerbee\n\nPLEASE HELP TO SEED! If you like these books and want others to have access to them, please help to seed for as long as you can. The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content. Thank you!","torrent":{"xt":"urn:btih:6fa9f482a85a30a2fd74019669c4b400bc898bc2","amp;dn":"John+Steinbeck+-+Nobel+Prize+in+Literature%2C+1962+%2835+books%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6fa9f482a85a30a2fd74019669c4b400bc898bc2","infoHashBuffer":{"type":"Buffer","data":[111,169,244,130,168,90,48,162,253,116,1,150,105,196,180,0,188,137,139,194]},"announce":[],"urlList":[]}}