{"title":"Grand Theft Auto Vice City (GTA) v1.03 + SD DATA Android","uid":9088427,"size":952243673,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:707c1911024d60b33460a4c7bac9200dce0de01e&amp;dn=Grand+Theft+Auto+Vice+City+%28GTA%29+v1.03+%2B+SD+DATA+Android&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":61,"leechers":7,"uploader":".BONE.","files":-1,"time":1382541694,"description":"From the decade of big hair, excess and pastel suits comes a story of one man's rise to the top of the criminal pile. Vice City, a huge urban sprawl ranging from the beach to the swamps and the glitz to the ghetto, was one of the most varied, complete and alive digital cities ever created. Combining open-world gameplay with a character driven narrative, you arrive in a town brimming with delights and degradation and given the opportunity to take it over as you choose.\n\nTo celebrate its 10 year anniversary, Rockstar Games brings Grand Theft Auto: Vice City to mobile devices with high-resolution graphics, updated controls and a host of new features including:\n\nFeatures:\nBeautifully updated graphics, character models and lighting effects \nNew, precisely tailored firing and targeting options \nCustom controls with a fully customizable layout \nMassive campaign with countless hours of gameplay\nCompatible with the MoGa Wireless Game Controller and select USB gamepads\nIntegrated with Immersion tactile effects \nTailor your visual experience with adjustable graphic settings\nLanguages Supported: English, French, Italian, German, Spanish, Korean, Russian, and Japanese.\n\nWhat's in this version: (Updated : Dec 18, 2012)\nFixed crash experienced by some Samsung Galaxy S2 users after the latest firmware update\nVarious bug fixes\nRequired Android O/S : 2.3+","torrent":{"xt":"urn:btih:707c1911024d60b33460a4c7bac9200dce0de01e","amp;dn":"Grand+Theft+Auto+Vice+City+%28GTA%29+v1.03+%2B+SD+DATA+Android","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"707c1911024d60b33460a4c7bac9200dce0de01e","infoHashBuffer":{"type":"Buffer","data":[112,124,25,17,2,77,96,179,52,96,164,199,186,201,32,13,206,13,224,30]},"announce":[],"urlList":[]}}