{
  "title": "Naomi Klein- 2007 - The shock doctrine - The Rise of Disaster Ca",
  "uid": 11160479,
  "size": 8938221,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:71ab59c898fd5be5f35fa443c1d0c76c9a429189&amp;dn=Naomi+Klein-+2007+-+The+shock+doctrine+-+The+Rise+of+Disaster+Ca&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 40,
  "leechers": 1,
  "uploader": "Inua1",
  "files": 1,
  "time": 1412526596,
  "description": "In this groundbreaking alternative history of the most dominant ideology of our time, Milton Friedman's free-market economic revolution, Naomi Klein challenges the popular myth of this movement's peaceful global victory. From Chile in 1973 to Iraq today, Klein shows how Friedman and his followers have repeatedly harnessed terrible shocks and violence to implement their radical policies. As John Gray wrote in The Guardian, &quot;There are very few books that really help us understand the present. The Shock Doctrine is one of those books.&quot;\n\n\nThe Shock Doctrine retells the story of the most dominant ideology of our time, Milton Friedman's free market economic revolution. In contrast to the popular myth of this movement's peaceful global victory, Klein shows how it has exploited moments of shock and extreme violence in order to implement its economic policies in so many parts of the world from Latin America and Eastern Europe to South Africa, Russia, and Iraq. At the core of disaster capitalism is the use of cataclysmic events to advance radical privatization combined with the privatization of the disaster response itself. By capitalizing on crises, created by nature or war, Klein argues that the disaster capitalism complex now exists as a booming new economy, and is the violent culmination of a radical economic project that has been incubating for fifty years.\n\nWinner of the 2009 Warwick Prize for Writing \n\n&quot;Only a crisis - actual or perceived - produces real change. When that crisis occurs, the actions that are taken depend on the ideas that are lying around.&quot;\n--Milton Friedman \n\nThe shock doctrine is the unofficial story of how the &quot;free market&quot; came to dominate the world, from Chile to Russia, China to Iraq, South Africa to Canada. But it is a story radically different from the one usually told. It is a story about violence and shock perpetrated on people, on countries, on economies. About a program of social and economic engineering that is driving our world, that Naomi Klein calls &quot;disaster capitalism.&quot; \n\nBased on breakthrough historical research and four years of on-the-ground reporting in disaster zones, Klein explodes the myth that the global free market triumphed democratically, and that unfettered capitalism goes hand-in-hand with democracy. Instead, she argues it has consistently relied on violence and shock, and reveals the puppet strings behind the critical events of the last four decades. \n\n&quot;The shock doctrine&quot; is the influential but little understood theory that in order to push through profoundly unpopular policies that enrich the few and impoverish the many, there needs to be some kind of collective crisis or disaster - either real or manufactured. A crisis that opens up a &quot;window of opportunity&quot; - when people and societies are too disoriented to protect their own interests - for radically remaking countries using the trademark tactic of rapid-fire economic shock therapy and, all too often, less metaphorical forms of shock: the shock of the police truncheon, the Taser gun or the electric prod in the prison cell. \n\nKlein vividly traces the origins of modern shock tactics back to the economic lab of the University of Chicago under Milton Friedman in the 60s, and beyond to the CIA-funded electroshock experiments at McGill University in the 50s which helped write the torture manuals used today at Guantanamo Bay. She details, in this riveting - indeed shocking - story, the well-known events of the recent past that have been deliberate, active theatres for the shock doctrine: among them, Pinochet's coup in Chile in 1973, the Falklands War in 1982, the Tiananmen Square Massacre in 1989, the collapse of the Soviet Union in 1991; and, more recently, the September 11 attacks, the &quot;Shock and Awe&quot; invasion of Iraq, the Asian tsunami and Hurricane Katrina. And she shows how - in the hands of the Bush Administration - the &quot;war on terror&quot; is a thin cover for a thriving destruction/ reconstruction complex, with disasters, wars and homeland security fuelling a booming new economy. Naomi Klein has once again written a book that will change the way we see the world. \n\n&quot;The world is a messy place, and someone has to clean it up.&quot;\n--Condoleezza Rice, September 2002, on the need to invade Iraq \n\n&quot;George's answer to any problem at the ranch is to cut it down with a chainsaw. Which I think is why he and Cheney and Rumsfeld get along so well.&quot;\n--Laura Bush&quot; \n",
  "parsed": {
    "xt": "urn:btih:71ab59c898fd5be5f35fa443c1d0c76c9a429189",
    "dn": "Naomi Klein- 2007 - The shock doctrine - The Rise of Disaster Ca",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "71ab59c898fd5be5f35fa443c1d0c76c9a429189",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        113,
        171,
        89,
        200,
        152,
        253,
        91,
        229,
        243,
        95,
        164,
        67,
        193,
        208,
        199,
        108,
        154,
        66,
        145,
        137
      ]
    },
    "name": "Naomi Klein- 2007 - The shock doctrine - The Rise of Disaster Ca",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 3,
  "peers": 8,
  "last_updated": "2016-12-27T03:41:37.235Z"
}