{"title":"Domination And Submission - The BDSM Relationship Handbook (2013","uid":9556360,"size":2243214,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7373f4771bad229fb60497b82da92e8ee04d8147&amp;dn=Domination+And+Submission+-+The+BDSM+Relationship+Handbook+%282013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":38,"leechers":1,"uploader":"GoonerTPB","files":3,"time":1391364300,"description":"Format: mobi/epub/azw3\nLength: 496 pages\nGenre: Non-Fiction/Lifestyles &amp; Relationships\nDate: 22 September 2013\n\nThe definitive handbook on Domination and Submission (D/s) relationships and the BDSM lifestyle. A must-read for anyone considering or curious about non-traditional relationships within a fetish culture context. \n\nFunny, insightful, educational, and inspiring. Author Michael Makai goes in-depth on Dominants, submissives, switches, primals, and their relationship dynamics. Learn about BDSM activities, bondage, toys, groups, protocols, and safety. \n\nThis book even dares to go where others fear to tread: The Gorean subculture, online D/s &amp; BDSM, first meetings, religion vs. kink, and what could go wrong. You'll love Michael Makai's irreverent and humorous treatment of this subject as he gives you the benefit of his 35+ years of experience in the D/s and BDSM lifestyles. \n\nAuthor:\n\nMichael is an unapologetically atypical White Knight Dominant with over thirty-five years of experience in both D/s relationships and the BDSM lifestyle. He was born in Japan and raised in Hawaii and California, where he worked as a waiter and bartender to pay his own way at the University of California, Riverside. He has lived all over the United States, and spent ten years living in Europe in the Rheinland-Pfalz region of Germany, near the Franco-German border. He currently resides near Wichita Falls, Texas.","torrent":{"xt":"urn:btih:7373f4771bad229fb60497b82da92e8ee04d8147","amp;dn":"Domination+And+Submission+-+The+BDSM+Relationship+Handbook+%282013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7373f4771bad229fb60497b82da92e8ee04d8147","infoHashBuffer":{"type":"Buffer","data":[115,115,244,119,27,173,34,159,182,4,151,184,45,169,46,142,224,77,129,71]},"announce":[],"urlList":[]}}