{"title":"Photoscape  V. 3.3","uid":4780771,"size":15063882,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:739acbf3b7ce953f78e121ade40134119d28c0cc&amp;dn=Photoscape++V.+3.3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":65,"leechers":0,"uploader":"Sinshenron","files":1,"time":1237335220,"description":"Just download and install.That's it.Tested spyware and virus free.\n\nDescription:\n*License:Free\n*Editor's Rating:4.0 stars(Out of five)\n*Average User Rating:4.0 stars (out of 200 votes)\n*Operating Systems:Windows Vista, Windows 95,    Windows Me, \n Windows 2000,   Windows NT, Windows XP, Windows 98\n*Additional Requirements:Windows 95/98/Me/NT/2000/XP/Vista\n*Limitations: No limitations\n--------------------------------------------------\nPublisher's description of PhotoScape:\nPhotoScape is an all-in-one style photo editor with fun and ease of use. Major capabilities are: viewer, editor, batch editor, page, combine, animated GIF, print, splitter, screen capture, color picker, rename, raw converter, resizing, brightness/color/white-balance adjustment, backlight correction, frames, balloons, text, drawing pictures, cropping, filters, red eye removal and blooming. PhotoScape has been used for two years and is expanding its features continuously.\n--------------------------------------------------\nEditor's review of PhotoScape\n\n*4.0 stars\n*&quot;Change your image-editing view&quot;\n*Reviewed by: CBS Interactive staff\n*Version reviewed: PhotoScape 3.3\n\nAdd another name to the roster of feature-rich freeware image editors: PhotoScape. Although it eats and leaks about as much memory as Firefox, this editor is perfect for those making the jump between JPEG and am-pro dSLR work.\n\nIt supports RAW, as well as all other major image formats from JPEG and PNG to animated GIFs. It comes with prebuilt templates for users to create photo collages, fumetti, and Web comics, and has a standard set of red-eye removal, light/shadow, and contrast-editing features. One warning about the RAW processing: although it looks like you can drag and drop, the converter doesn't change RAW to JPEG unless you load the RAW file from within the native file navigator. It's a minor bug, but one that can lead you to believe that there's no RAW support at all. You can also batch edit images, combine them, and print them out one at a time or several at once.\n\nThe program loads fast and possesses an interface completely different from those familiar with Adobe's industry-leading tools. Users are greeted by circular navigator complemented by a tabbed nav on the top of the main screen. Most but not all main features are accessible from either nav. It might take some people time to get used to the unusual layout, but it's only unusual for an image editor; otherwise it's intuitive, fast, and lacks only the most advanced of image editing features.","torrent":{"xt":"urn:btih:739acbf3b7ce953f78e121ade40134119d28c0cc","amp;dn":"Photoscape++V.+3.3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"739acbf3b7ce953f78e121ade40134119d28c0cc","infoHashBuffer":{"type":"Buffer","data":[115,154,203,243,183,206,149,63,120,225,33,173,228,1,52,17,157,40,192,204]},"announce":[],"urlList":[]}}