{"title":"Sorry Not Sorry: Dreams, Mistakes... (2016) by Naya Rivera","uid":15876193,"size":4959440,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:74c0ef3c1217ee171c1bb9d6671441c198f5a30f&amp;dn=Sorry+Not+Sorry%3A+Dreams%2C+Mistakes...+%282016%29+by+Naya+Rivera&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":42,"leechers":0,"uploader":"Dr.Soc","files":1,"time":1474513861,"description":"Sorry Not Sorry: Dreams, Mistakes, and Growing Up by Naya Rivera\r\nEnglish | 2016 | ISBN: 0399184988 | 256 pages | EPUB | 5 MB\r\n\r\nFunny and deeply personal, Sorry Not Sorry recounts Glee star Naya Rivera's successes and missteps, urging young women to pursue their dreams and to refuse to let past mistakes define them.\r\n\r\nNavigating through youth and young adulthood isn't easy, and in Sorry Not Sorry, Naya Rivera shows us that we're not alone in the highs, lows, and in-betweens. Whether it's with love and dating, career and ambition, friends, or gossip, Naya inspires us to follow our own destiny and step over–or plod through–all the crap along the way. After her rise and fall from early childhood stardom, barely eking her way through high school, a brief stint as a Hooters waitress, going through thick and thin with her mom/manager, and resurrecting her acting career as Santana Lopez on Glee, Naya emerged from these experiences with some key life lessons:\r\n\r\nSorry:\r\n- All those times I scrawled &quot;I HATE MY MOM&quot; in my journal. So many moms and teenage daughters don't get along–we just have to realize it's nothing personal on either side.\r\n- At-home highlights and DIY hair extensions. Some things are best left to the experts, and hair dye is one of them.\r\n- Falling in love with the idea of a person, instead of the actual person.\r\n\r\nNot Sorry:\r\n- That I don't always get along with everyone. Having people not like you is a risk you have to take to be real, and I'll take that over being fake any day.\r\n- Laughing at the gossip instead of getting upset by it.\r\n- Getting my financial disasters out of the way early–before I was married or had a family–so that the only credit score that I wrecked was my own.\r\n\r\nEven with a successful career and a family that she loves more than anything else, Naya says, &quot;There's still a thirteen-year-old girl inside of me making detailed lists of how I can improve, who's never sure of my own self-worth.&quot; Sorry Not Sorry is for that thirteen-year-old in all of us","torrent":{"xt":"urn:btih:74c0ef3c1217ee171c1bb9d6671441c198f5a30f","amp;dn":"Sorry+Not+Sorry%3A+Dreams%2C+Mistakes...+%282016%29+by+Naya+Rivera","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74c0ef3c1217ee171c1bb9d6671441c198f5a30f","infoHashBuffer":{"type":"Buffer","data":[116,192,239,60,18,23,238,23,28,27,185,214,103,20,65,193,152,245,163,15]},"announce":[],"urlList":[]}}