{
  "title": "Heartbreak Ridge (1986) 720p BrRip x264 - YIFY",
  "uid": 11274618,
  "size": 921315610,
  "categoryP": "video",
  "categoryS": "hd___movies",
  "magnet": "?xt=urn:btih:75907d75d900a8be5d9d9bec8a4bc14e3d846359&amp;dn=Heartbreak+Ridge+%281986%29+720p+BrRip+x264+-+YIFY&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 49,
  "leechers": 3,
  "uploader": "YIFY",
  "files": -1,
  "time": 1414123640,
  "description": "-------------------------------------------------------------------------------\n\n-------------------------------------------------------------------------------\n\n\nGet all YIFYs newest releases first at \n\nAlso there you will find a list of upcoming uploads, instant chat, account registration and an effective movie search. &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0091187/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0091187/&lt;/a&gt;\n\n\nIMDB RATING: 6.8\n\nFORMAT.......................: MP4\nCODEC........................: X264\nGENRE........................: Action\nFILE SIZE....................: 878.53 MB\nRESOLUTION...................: 1280*720\nFRAME RATE...................: 23.976 fps\nLANGUAGE.....................: English\nSUBTITLES....................: NONE\nRUNTIME......................: 129 mins\n\n\n\n1983. Tom Highway is a well-decorated career military man in the United States Marine Corps, he who has seen action in Korea and Vietnam. His current rank is Gunnery Sergeant. His experiences have led him to become an opinionated, no nonsense man, who is prone to bursts of violence, especially when he's drunk, if the situation does not suit him, regardless of the specifics or people involved. Because of these actions, he has spent his fair share of overnighters behind bars. Close to retirement, one of his last assignments, one he requested, is back at his old unit at Cherry Point, North Carolina, from where he was transferred for insubordination. He is to train a reconnaissance platoon. His superior officer, the much younger and combat inexperienced Major Malcolm Powers, sees Highway as a relic of an old styled military. Highway's commanding officer, Lieutenant Ring, the platoon leader, is also a younger man who has no combat experience, but is academically inclined and happy-go-lucky. Highway finds that his team is a rag-tag bunch of slackers, who includes wannabe rock musician Stitch Jones, with who Highway had an inauspicious earlier meeting. The men in the platoon, who truly believe Highway is crazy, hate him, and don't understand why they have to follow his harsh training regimen when the United States is not currently at war. The major, who is all about efficiency regardless of combat readiness, has the same views of Highway. He is clear that he sees Highway's platoon solely as a training mechanism for his own elite squad trained by Highway's nemesis, Staff Sergeant Webster. Things for Highway and his platoon change when the United States enters into war in Grenada. Through it all, Highway tries to reconnect with his bar waitress ex-wife Aggie, he even clandestinely reading women's magazines to understand her better. Two primary obstacles stand in his way: Roy Jennings, Aggie's boss and current suitor who hates Marines, and Aggie's own remembrance of how dysfunctional their marriage was",
  "parsed": {
    "xt": "urn:btih:75907d75d900a8be5d9d9bec8a4bc14e3d846359",
    "dn": "Heartbreak Ridge (1986) 720p BrRip x264 - YIFY",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "75907d75d900a8be5d9d9bec8a4bc14e3d846359",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        117,
        144,
        125,
        117,
        217,
        0,
        168,
        190,
        93,
        157,
        155,
        236,
        138,
        75,
        193,
        78,
        61,
        132,
        99,
        89
      ]
    },
    "name": "Heartbreak Ridge (1986) 720p BrRip x264 - YIFY",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 52,
  "peers": 0,
  "last_updated": "2016-12-25T04:56:59.214Z"
}