{
  "title": "Wondershare Video Converter Ultimate v3.5.1 [MacOSX] + Serials.r",
  "uid": 8631184,
  "size": 35443679,
  "categoryP": "applications",
  "categoryS": "mac",
  "magnet": "?xt=urn:btih:7594d95eeaba6b5666b6e3afc0f4a3ca27fb081a&amp;dn=Wondershare+Video+Converter+Ultimate+v3.5.1+%5BMacOSX%5D+%2B+Serials.r&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 108,
  "leechers": 3,
  "uploader": "Swegin8r",
  "files": 1,
  "time": 1372633576,
  "description": "Includes the Wondershare Video Converter Ultimate v3.5.1 installation DMG and a text file containing instructions and registration details.\n\nInstall as usual. BLOCK WITH LITTLE SNITCH! When asked for registration, use the provided details. Done! Enjoy!\n\n\n-----------------------------------------------------------------------------------\n\n\n\nMore of a video toolbox than a just a converter, this app lets you effortlessly convert/burn home DVD, even download and edit videos - enjoying video anywhere just got simpler.\n\nPowered by Wondershare's industry leading APEXTRANS technology, giving you unbelievable conversion speed, and featuring an exclusive innovated transcoding engine which allows you to convert lossless video up to 30X faster than other converters on the market - just play and enjoy!\n\nWith an ultra-intuitive user experience, anyone can easily convert video to 158 formats, including MOV, M4V, MP4, WMV, MKV, AVI, XviD,MPEG, DVD-Video, FLV, 3GP and load more--perfect to fit your iPad, iPhone(iPhone 5 included), iPod(iPod Touch 5 included), android,windows Phone,PSP, Xbox 360 and a rainbow of other devices.\n\nWith Fast conversion speed and high quality conversion, you can easily convert home DVD movies to video in MP4, MPG, WMV, 3GP, FLV, and tons of other formats. Or, if you want to watch movies on the go, convert them to optimized device formats with great image quality for playback on iPad/iPhone/iPod (iPod Touch 5 and iPhone 5 included), Android devices and more.\n\nQuickly and easily burn any homemade video in different formats to DVD5/DVD 9 disc, DVD folder, or ISO files with free provided 10 DVD menu templates to make your DVD unique, so you can enjoy the action on the big screen.\n\nWith VCU, trimming and clipping the perfect video is just easy. More editing power under the hood lets you edit and personalize video using classic features including cut, merge, crop, trim, rotate, add watermark, adjust duration, etc. Touch up video with up to ten effects, making audio/video editing fun. Add text, photos, and stitch together all types of media including videos, audio, images and color slides. Now it's easy to make the perfect home movie.\n\nA smart Download button will appear automatically when you play a video in any major browser. Simply click on this button and your video starts downloading to your PC, letting you download hilarious and priceless videos from video sharing sites, your friends' blogs, etc. Simply convert, load them on your smartphone, and just playback without internet. Download multiple videos simultaneously and up to three times faster.",
  "parsed": {
    "xt": "urn:btih:7594d95eeaba6b5666b6e3afc0f4a3ca27fb081a",
    "dn": "Wondershare Video Converter Ultimate v3.5.1 [MacOSX]   Serials.r",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "7594d95eeaba6b5666b6e3afc0f4a3ca27fb081a",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        117,
        148,
        217,
        94,
        234,
        186,
        107,
        86,
        102,
        182,
        227,
        175,
        192,
        244,
        163,
        202,
        39,
        251,
        8,
        26
      ]
    },
    "name": "Wondershare Video Converter Ultimate v3.5.1 [MacOSX]   Serials.r",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 11,
  "peers": 8,
  "last_updated": "2016-12-27T04:07:16.246Z"
}