{"title":"Murder in Samarkand: A British Ambassador’s Defiance ...","uid":15896898,"size":733427,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7783c37430dc1745d1419b2f3c9b6597e575b4b4&amp;dn=Murder+in+Samarkand%3A+A+British+Ambassador%26rsquo%3Bs+Defiance+...&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":41,"leechers":3,"uploader":"marty14","files":1,"time":1474818864,"description":"Murder in Samarkand: A British Ambassador’s Controversial Defiance of Tyranny in the War on Terror - Craig Murray [epub]\r\n\r\nCraig Murray was the United Kingdom’s Ambassador to Uzbekistan until he was removed from his post in October 2004 after exposing appalling human rights abuses by the US-funded regime of President Islam Karimov. In this candid and at times shocking memoir, he lays bare the dark and dirty underside of the War on Terror.\r\n\r\nIn Uzbekistan, the land of Alexander the Great and Tamburlaine, lurks one of the most hideous tyrannies on earth – one founded on cotton slavery and brutal torture. As neighbouring 'liberated’ Afghanistan produces record levels of heroin, the Uzbek rulers cash in on massive trafficking. They are even involved in trafficking their own women to prostitution in the West. But this did not prevent Karimov being viewed as a key US ally in the War on Terror.\r\n\r\nWhen Craig Murray arrived in Uzbekistan, he was a young Ambassador with a brilliant career and a taste for whisky and women. But after hearing accounts of dissident prisoners being boiled to death and innocent people being raped and murdered by agents of the state, he started to question both his role and that of his country in so-called 'democratising’ states.\r\n\r\nWhen Murray decided to go public with his shocking findings, Washington and 10 Downing Street reached the conclusion that he had to go. But Uzbekistan had changed the high-living diplomat and there was no way he was going to go quietly","torrent":{"xt":"urn:btih:7783c37430dc1745d1419b2f3c9b6597e575b4b4","amp;dn":"Murder+in+Samarkand%3A+A+British+Ambassador%26rsquo%3Bs+Defiance+...","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7783c37430dc1745d1419b2f3c9b6597e575b4b4","infoHashBuffer":{"type":"Buffer","data":[119,131,195,116,48,220,23,69,209,65,155,47,60,155,101,151,229,117,180,180]},"announce":[],"urlList":[]}}