{
  "title": "XXXPawn: Harlow Harrison Tattooed Harlow gets needled and inked",
  "uid": 15927571,
  "size": 623171404,
  "categoryP": "porn",
  "categoryS": "movie_clips",
  "magnet": "?xt=urn:btih:77c8691c85eca00fc95d7a6dde9a37e2695c74f4&amp;dn=XXXPawn%3A+Harlow+Harrison+Tattooed+Harlow+gets+needled+and+inked&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 43,
  "leechers": 13,
  "uploader": "EndYou",
  "files": 1,
  "time": 1475325117,
  "description": "... : More exclusive porn at : ...\r\n    https://thepiratebay.org/user/EndYou\r\n\r\n          ... : Screenshots : ... \nhttp://imgpremium.com/img-57ef9068efbfd.html  \nhttp://imgpremium.com/img-57ef9069815da.html \r\n\r\nTattoos are cool, but not for me. I believe my body is my temple and you don’t put bumper stickers on muscle cars, you know what Im sayin’ . Well today this nice looking Harlett named Harlow came into the XXX PAWN SHOP, She came in looking to sell her tattoo gun, because she need to pay her rent and keep her tattoo business a float. I asked her where her business was she told me it was at inner circle. Something about that place seemed familiar. She had heard about the XXXPAWNSHOP and how quick and easy it was to get money here, so she attempted to get top dollar for her custom tattoo guns. Like I said I’m not a fan of tattoos, but Seeing them on Harlow was a treat she had a rocking body and I knew I had to get to see more of those things. After looking them once over I gave her a price I knew she wouldn’t like, just so I can snag her and lure her into my SEX DEN. Well Harlow is like a big fish and like any big fish she took the bait, but she fought the good fight. It took a lot of convincing to get her to the back room but once i got her back there I knew I had her in my clutches. so to speak. That’s when I pulled my move I offered her 200 to see the rest of her tats. Thats when she told me that her LANDLORD tried to pull the same move! WTF! THATS MY MOVE! That’s when I realized why that place was so familiar. Her landlord was a guy named STEVE, I fucked his wife a few years back and I guess he was trying to get revenge by stealing my girls. Well not in the XXXPAWNSHOP buddy. I quickly remembered that STEVE owed me money so I wouldn’t go out of pocket. So I offered Harlow 600 to let me fuck and BINGO that was the magic number. I got fuck Harlow, see all her tattoo and got to ink her a bit my self with my special white ink. Best part about it is I didn’t have to go out of pocket to do so. THANKS STEVE.\r\n\r\nMPEG4 Video (H264) 852x480",
  "parsed": {
    "xt": "urn:btih:77c8691c85eca00fc95d7a6dde9a37e2695c74f4",
    "dn": "XXXPawn: Harlow Harrison Tattooed Harlow gets needled and inked",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "77c8691c85eca00fc95d7a6dde9a37e2695c74f4",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        119,
        200,
        105,
        28,
        133,
        236,
        160,
        15,
        201,
        93,
        122,
        109,
        222,
        154,
        55,
        226,
        105,
        92,
        116,
        244
      ]
    },
    "name": "XXXPawn: Harlow Harrison Tattooed Harlow gets needled and inked",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 56,
  "peers": 59,
  "last_updated": "2016-12-25T05:11:38.092Z"
}