{
  "title": "Poly Bridge v1.0",
  "uid": 15290196,
  "size": 138164025,
  "categoryP": "games",
  "categoryS": "pc",
  "magnet": "?xt=urn:btih:78ff580c40f1a89430783647fc6f2ba3c775eea5&amp;dn=Poly+Bridge+v1.0&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 45,
  "leechers": 0,
  "uploader": "dauphong",
  "files": 1,
  "time": 1468413633,
  "description": "\nAbout This Game\r\nUnleash your engineering creativity with an engaging and fresh bridge-building simulator with all the bells and whistles.\r\nEnjoy hours of physics-based puzzle solving in the Campaign and then jump in the Sandbox to create your own bridge designs and puzzles.\r\nChallenge friends and the rest of the Steam Workshop community to solve your puzzles and download more levels submitted by other players.\r\nCheck out the Online Gallery at http://gallery.drycactus.com !\r\n\r\n\r\nEnjoy hours of bridge-building fun with loads of levels to solve, ranging from simple light car bridges to multi-deck draw-bridges and jumps, just to name a few!\r\nLevels get increasingly challenging from the engineering aspect and restrictions are also imposed on the resources you can use to build your bridge.\r\n\r\n\r\nWhat would an awesome bridge-builder game be without an equally awesome Sandbox?\r\nGo wild and create the most complex bridge the world has ever seen, or just an absurd creation that pushes the mechanics of the game in a new direction, and if you're feeling like it publish your design online as a puzzle level on the Workshop for everyone to try and solve!\r\n\r\n\r\nDownload hundreds of extra levels from the Workshop!\r\nWe'll also be featuring the most original and fun bridge designs that are submitted, making it easier for you to find the ones that are worth the challenge.\r\n\r\n\r\nOne of our favorite features of the game!\r\nSave a super cool looking animated GIF of your bridge in all its glory (or failure!) and save it locally, upload it to the Poly Bridge Online Gallery and/or share it Twitter,Reddit or Tumblr without ever leaving the game!\r\nCheck out the Online Gallery at http://gallery.drycactus.com !\r\n\r\n\r\nUnleash your true engineer using the advanced building and level designing tools in-game, such as:\r\n\r\n    Advanced Hydraulics\r\n    Multi-phase Hydraulics Controller (control which hydraulic piston activates when)\r\n    Node-base event system\r\n    Multiple types of checkpoints\r\n    Copy &amp; Paste tools\r\n    Line Tracer tools (draw perfect arcs or straight lines and fill them in with your material of choice)\r\n    And much more",
  "parsed": {
    "xt": "urn:btih:78ff580c40f1a89430783647fc6f2ba3c775eea5",
    "dn": "Poly Bridge v1.0",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "78ff580c40f1a89430783647fc6f2ba3c775eea5",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        120,
        255,
        88,
        12,
        64,
        241,
        168,
        148,
        48,
        120,
        54,
        71,
        252,
        111,
        43,
        163,
        199,
        117,
        238,
        165
      ]
    },
    "name": "Poly Bridge v1.0",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 45,
  "peers": 22,
  "last_updated": "2016-12-25T05:19:35.675Z"
}