{"title":"Commandos.Anthology.Repack-R.G.Mechanics","uid":10781009,"size":4409153162,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7b8f0225a65d638761445f66fbe49d9778bd45d8&amp;dn=Commandos.Anthology.Repack-R.G.Mechanics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":101,"leechers":34,"uploader":"Taker009","files":33,"time":1408162383,"description":"Commandos.Anthology.Repack-R.G.Mechanics\n\n &lt;a href=&quot;\nhttp://www.imagelink.cz/images/0b7c2a2adcd470e03cd4.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imagelink.cz/images/0b7c2a2adcd470e03cd4.png&lt;/a&gt;\n\n\nRelease Info:\n\n\n1.Commandos: Behind Enemy Lines\n\n\nGame information:\n\n\nCommandos: Behind Enemy Lines - tactical game real-time,\naction which takes place during the Second World War.\nYou command a small squad of elite soldiers. Send them\ninto the enemy in a series of risky missions, and return\nthem back alive. Clever strategy has never been so vibrant.\nStudy the movement of the enemy, develop a careful plan,\ncoordinate their people and throw them into a swift and\nfierce attack using all your abilities and skills.\n\n\nRepack Features:\n\nCommandos: Behind Enemy Lines\nDo not cut / recoded\n\n\n2.Commandos: Beyond the Call of Duty\n\n\n\nGame information:\n\n\nYou have been called to active service in the Commandos,\nand must now mobilize in a series of 8 new dangerous missions.\nYou could come with experience of action in Behind Enemy Lines,\nor perhaps you are just a rookie - as if it was, you will have\na chance to show themselves to the limit in the courage and\ntactics. As the leader of a small elite unit operating deep\nin enemy territory, you will fall out new challenges and\ngoals of these new missions. As well as new vehicles,\nbuildings, weapons, and two levels of difficulty must\nsatisfy both Commandos veterans, so new recruits.\n\n\nRepack Features:\n\nCommandos: Beyond the Call of Duty\nVersion of the game - v1.1\nDo not recoded\nCut Credits (titers developers)\n\n\n3.Commandos 2: Men of Courage\n\n\n\nGame information:\n\n\nAt your disposal there is a certain group of soldiers.\nAll of them have their own set of skills and a well-trained\nto perform very complex tasks. Besides, each of them has\ntheir own special talent that will be useful in certain\nsituations. Your people will help you learn more about\nthe enemy and develop an action plan.\n\nIn the game, you will spend your squad through a series of\nmissions related to the events of World War II. In each mission\nyou must perform a number of tasks, the results of which will\ndepend on your tactics skills to own a gun and to manage people.\nAs a rule, there is one main mission: save, scout, grab, protect,\nand several minor, which will help to fulfill the main. If you\ndo not do the job of a mission or lose one of your people, you\nhave to go through the mission again.\n\n\n\nRepack Features:\n\nCommandos 2: Men of Courage\nGame Version - v1.20\nDo not cut / recoded\n\n4.Commandos 3: Destination Berlin\n\n\nGame information:\n\nDeath to the fascist invaders! With this motto peremptory American\ncommandos were landed behind enemy lines ... Already the second\nseries in a row ... Extremely realistic terrain as traced be captured\non camera people, the unique abilities of soldiers. This voltage\nyou will not be able to keep even drive with eroticism. As you\nlook at it as a partisan Natasha seduce stupid Kraut and tidy\nup the rear of the enemy? Or swim with scuba diving right under\nthe noses of the German patrol? Stun Lieutenant Stolz? However,\nit is tempting? Well, everything is in your hands.\n\nGame Features:\n\n12 missions with numerous cinematic scenes are divided into 3\ncampaigns: Stalingrad, Normandy and Central Europe, each of\nwhich consists of a variety of tactical puzzles.\nNew special skills of various team members (physical strength,\nagility, camouflage, climbing walls, and so on. D.).\nImproved management and a new training system for each commando.\nMore Actions: assaults and point bombing, as well as appliances:\njeeps, motorcycles with sidecars, tanks and trucks.\nImproved artificial intelligence of enemies, new enemies\n(the soldiers of the SS, the Gestapo).\nStunning graphics, a fully three-dimensional engine with a\nturn of 360 degrees in either direction, zooming,\nand changing the landscape.\nNew types of weapons including mortars, machine guns,\nheavy machine guns and artillery. All weapons have their\nreal prototypes of the Second World War.\n\nRepack Features:\n\nCommandos 3: Destination Berlin\nGame Version - v1.42\nDo not cut / recoded\n\n\n5.Commandos: Strike Force\n\n\n\nGame information:\n\nIn 1942. Europe under the control of the Wehrmacht,\nand only on the Eastern Front fierce resistance of\nSoviet troops did not allow Hitler to advance deep\ninto the Soviet Union.\n\nLegendary fighters squad will once again penetrate\nbehind enemy lines to strike a powerful blow that\nwill help turn the tide of the war and enable the\nmain forces to destroy the military machine of the\nThird Reich.\n\nThe most dangerous suicide mission again become the\nlot of desperate commandos. But so it does not happen -\nbecause you can not win a war without heroes.\n\n\nRepack Features:\n\nCommandos: Strike Force\nVersion of the game - v1.1\nDo not recoded\nCut multiplayer demo and video developers\n","torrent":{"xt":"urn:btih:7b8f0225a65d638761445f66fbe49d9778bd45d8","amp;dn":"Commandos.Anthology.Repack-R.G.Mechanics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b8f0225a65d638761445f66fbe49d9778bd45d8","infoHashBuffer":{"type":"Buffer","data":[123,143,2,37,166,93,99,135,97,68,95,102,251,228,157,151,120,189,69,216]},"announce":[],"urlList":[]}}