{
  "title": "Nirvana - Greatest Hits (2002) 320 vtwin88cube",
  "uid": 6161017,
  "size": 119444373,
  "categoryP": "audio",
  "categoryS": "music",
  "magnet": "?xt=urn:btih:7cc31912d3d673365974576607450438af11564e&amp;dn=Nirvana+-+Greatest+Hits+%282002%29+320+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 331,
  "leechers": 15,
  "uploader": "vtwin88cube",
  "files": -1,
  "time": 1297212815,
  "description": "Nirvana\nGreatest Hits (2002)\n\nPrior to Nirvana, alternative music was consigned to specialty sections of record stores, and major labels considered it to be, at the very most, a tax write-off. After the band's second album, 1991's Nevermind, nothing was ever quite the same, for better and for worse. Nirvana popularized punk, post-punk, and indie rock, unintentionally bringing it into the American mainstream like no other band to date. While their sound was equal parts Black Sabbath (as learned by fellow Washington underground rockers the Melvins) and Cheap Trick, Nirvana's aesthetics were strictly indie rock. They covered Vaselines songs, they revived new wave cuts by Devo, and leader Kurt Cobain relentlessly pushed his favorite bands -- whether it was the art punk of the Raincoats or the country-fried hardcore of the Meat Puppets -- as if his favorite records were always more important than his own music. While Nirvana's ideology was indie rock and their melodies were pop, the sonic rush of their records and live shows merged the post-industrial white noise with heavy metal grind. And that's what made the group an unprecedented multi-platinum sensation. Jane's Addiction and Soundgarden may have proven to the vast American heavy metal audience that alternative could rock, and the Pixies may have merged pop sensibilities with indie rock white noise, but Nirvana pulled at all together, creating a sound that was both fiery and melodic. Since Nirvana was rooted in the indie aesthetic but loved pop music, they fought their stardom while courting it, becoming some of the most notorious anti-rock stars in history. The result was a conscious attempt to shed their audience with the abrasive In Utero, which only partially fulfilled the band's goal. But by that point, the fate of the band and Kurt Cobain had been sealed. Suffering from drug addiction and manic depression, Cobain had become destructive and suicidal, though his management and label were able to hide the extent of his problems from the public until April 8, 1994, when he was found dead of a self-inflicted shotgun wound. Cobain may not have been able to weather Nirvana's success, but the band's legacy stands as one of the most influential in rock &amp; roll history.\n\nChannels:\t\t2 (Stereo)\nSample Rate:\t\t44.1 KHz\nSample Size:\t\t16 bit\nBit Rate:\t\t320 kbps\n\nAudio Quality:\t\tVery High (Lossy)\nEncoder:\t\tLAME 3.98r\nEncoder Settings:\tConstant Bit Rate 320 kbps (Insane)\nContains:\t\tAlbum Art, ID Tag [ID3v2.3 (ANSI) &amp; ID3v1.1]\n\nFormat:\t\t\tMp3\nGenre:\t\t\tGrunge\t\t\nM3U Playlist:\t\tYes\n\n01.You Know You're Right\n02.About A Girl\n03.Been A Son\n04.Sliver\n05.Smells Like Teen Spirit\n06.Come As You Are\n07.Lithium\n08.In Bloom\n09.Heart Shaped Box\n10.Pennyroyal Tea\n11.Rape Me\n12.Dumb\n13.All Apologies\n14.The Man Who Sold The World\n",
  "parsed": {
    "xt": "urn:btih:7cc31912d3d673365974576607450438af11564e",
    "dn": "Nirvana - Greatest Hits (2002) 320 vtwin88cube",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "7cc31912d3d673365974576607450438af11564e",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        124,
        195,
        25,
        18,
        211,
        214,
        115,
        54,
        89,
        116,
        87,
        102,
        7,
        69,
        4,
        56,
        175,
        17,
        86,
        78
      ]
    },
    "name": "Nirvana - Greatest Hits (2002) 320 vtwin88cube",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 351,
  "peers": 51,
  "last_updated": "2016-12-27T04:52:51.616Z"
}