{
  "title": "How to Write a Thesis by Umberto Eco",
  "uid": 15848145,
  "size": 2495239,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:7e3c83560c4cfe25211f982ca918723807b6f64c&amp;dn=How+to+Write+a+Thesis+by+Umberto+Eco&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 41,
  "leechers": 0,
  "uploader": "marty14",
  "files": 1,
  "time": 1474130449,
  "description": "How to Write a Thesis - Umberto Eco [epub]\r\n\r\nBy the time Umberto Eco published his best-selling novel The Name of the Rose, he was one of Italy's most celebrated intellectuals, a distinguished academic and the author of influential works on semiotics. Some years before that, in 1977, Eco published a little book for his students, How to Write a Thesis, in which he offered useful advice on all the steps involved in researching and writing a thesis -- from choosing a topic to organizing a work schedule to writing the final draft. Now in its twenty-third edition in Italy and translated into seventeen languages, How to Write a Thesis has become a classic. Remarkably, this is its first, long overdue publication in English.\r\n\r\nEco's approach is anything but dry and academic. He not only offers practical advice but also considers larger questions about the value of the thesis-writing exercise. How to Write a Thesis is unlike any other writing manual. It reads like a novel. It is opinionated. It is frequently irreverent, sometimes polemical, and often hilarious. Eco advises students how to avoid &quot;thesis neurosis&quot; and he answers the important question &quot;Must You Read Books?&quot; He reminds students &quot;You are not Proust&quot; and &quot;Write everything that comes into your head, but only in the first draft.&quot; Of course, there was no Internet in 1977, but Eco's index card research system offers important lessons about critical thinking and information curating for students of today who may be burdened by Big Data.\r\n\r\nHow to Write a Thesis belongs on the bookshelves of students, teachers, writers, and Eco fans everywhere. Already a classic, it would fit nicely between two other classics: Strunk and White and The Name of the Rose",
  "parsed": {
    "xt": "urn:btih:7e3c83560c4cfe25211f982ca918723807b6f64c",
    "dn": "How to Write a Thesis by Umberto Eco",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "7e3c83560c4cfe25211f982ca918723807b6f64c",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        126,
        60,
        131,
        86,
        12,
        76,
        254,
        37,
        33,
        31,
        152,
        44,
        169,
        24,
        114,
        56,
        7,
        182,
        246,
        76
      ]
    },
    "name": "How to Write a Thesis by Umberto Eco",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 11,
  "peers": 11,
  "last_updated": "2016-12-27T05:01:33.454Z"
}