{
  "title": "Hearts of Iron IV: Field Marshal Edition",
  "uid": 14816496,
  "size": 987608064,
  "categoryP": "games",
  "categoryS": "pc",
  "magnet": "?xt=urn:btih:7f8926b012a85bb554fb458085143f3644c74dee&amp;dn=Hearts+of+Iron+IV%3A+Field+Marshal+Edition&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 207,
  "leechers": 4,
  "uploader": "dauphong",
  "files": 1,
  "time": 1465240049,
  "description": "\nAbout This Game\r\nVictory is at your fingertips! Your ability to lead your nation is your supreme weapon, the strategy game Hearts of Iron IV lets you take command of any nation in World War II; the most engaging conflict in world history.\r\n\r\nFrom the heart of the battlefield to the command center, you will guide your nation to glory and wage war, negotiate or invade. You hold the power to tip the very balance of WWII.\r\n\r\nIt is time to show your ability as the greatest military leader in the world. Will you relive or change history? Will you change the fate of the world by achieving victory at all costs?\r\n\r\nMain Features:\r\n\r\n    Total strategic war: War is not only won on land, sea and in the air. It’s also achieved in the hearts and minds of men and women.\r\n    Authentic real-time war simulation: Let the greatest commanders of WW2 fight your war with the tools of the time; tanks, planes, ships, guns and newly discovered weapons of mass destruction.\r\n    Assume control of any nation: Choose from the greatest powers striving for victory, or the small nations trying to weather the storm.\r\n    Turn the world into your battlefield: Experience the full WWII timespan in a topographical map complete with seasons, weather and terrain. Snow, mud, storms can be both your strong ally and a ruthless enemy.\r\n    Negotiate or force your will: Experience the advanced politics and diplomacy systems, form factions, engage in trade for resources and appoint ministers to your party.\r\n    Intense Online Combat: Battle in both competitive and cooperative multiplayer for up to 32 players. Featuring cross-platform multiplayer.\r\n    Give your nation a unique edge: Experience the flexible technology system, where all major powers get their own unique identity. Develop detailed historic tanks and planes through research and army experience. \r\n\r\n\r\nEveryone will receive:\r\n\r\n    Poland: United and Ready:\r\n    A Free DLC adds a unique focus tree for Poland, new 3d models for tanks and planes, 2d assets, and extra leader portraits for the ultimate in historical accuracy.\r\n    Forum Avatar\r\n    Wallpaper",
  "parsed": {
    "xt": "urn:btih:7f8926b012a85bb554fb458085143f3644c74dee",
    "dn": "Hearts of Iron IV: Field Marshal Edition",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "7f8926b012a85bb554fb458085143f3644c74dee",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        127,
        137,
        38,
        176,
        18,
        168,
        91,
        181,
        84,
        251,
        69,
        128,
        133,
        20,
        63,
        54,
        68,
        199,
        77,
        238
      ]
    },
    "name": "Hearts of Iron IV: Field Marshal Edition",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 371,
  "peers": 212,
  "last_updated": "2016-12-27T05:09:22.852Z"
}