{
  "title": "Queens of the Stone Age - Discography 1997-2013 [FLAC]",
  "uid": 10001849,
  "size": 12761360980,
  "categoryP": "audio",
  "categoryS": "flac",
  "magnet": "?xt=urn:btih:7fe10b4ba3f1b87201a188db30606d6d6c01ad66&amp;dn=Queens+of+the+Stone+Age+-+Discography+1997-2013+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 44,
  "leechers": 19,
  "uploader": "rudown78",
  "files": 353,
  "time": 1397991828,
  "description": "Queens of the Stone Age - Discography 1997-2013 [FLAC]\n\n\nFormed from the ashes of stoner rock icons Kyuss, Queens of the Stone Age reunited the group's singer/guitarist Josh Homme, drummer Alfredo Hernandez, and bassist Nick Oliveri along with new guitarist/keyboardist Dave Catching. The project's origins date back to Homme, who in the wake of Kyuss' 1995 demise relocated to Seattle to tour with the Screaming Trees; he soon began working with a revolving lineup of musicians including the Trees' Van Conner, Soundgarden's Matt Cameron, and Dinosaur Jr.'s Mike Johnson, recording a series of 7&quot;s originally issued under the name Gamma Ray. After rechristening the group Queens of the Stone Age, Homme recruited Hernandez to begin work on their self-titled debut LP, issued in late 1998 on Loosegroove; after the album was completed, Oliveri left the Dwarves to rejoin his former bandmates, with the subsequent addition of Catching rounding out the roster. In addition to extensive touring, Homme put together a series of albums for the indie label Man's Ruin; the various volumes of the Desert Sessions feature Homme's collaborations with a loose-knit, revolving-door lineup of like-minded musicians, some from bands like Soundgarden, Fu Manchu, and Monster Magnet.\n\nIn mid-2000, Queens of the Stone Age issued their sophomore album, R (as in the movie rating; some promo copies were distributed with the original title, II), before appearing on that year's Ozzfest tour. By that point, drummer Hernandez had been replaced by a tag-team combo of Gene Troutman and Nicky Lucero. The group built a healthy buzz courtesy of accolades from such renowned publications as Rolling Stone, and due to good old-fashioned touring. 2001 saw the group perform at the massive Rock in Rio festival (after which Oliveri was arrested by the Brazilian police for performing nude) and a spot on the year's Ozzfest. The same year, Homme and Oliveri put together yet another volume of the Desert Sessions series, while QOTSA assembled a third studio album.\n\nEx-Nirvana drummer Dave Grohl was very vocal in the press about his admiration of the Queens, which led to an invitation for him to join the group for the third album's recording and, subsequently, supporting tour. Surprisingly, Grohl accepted, putting the Foo Fighters on hold (despite having a new album completed and ready to go). One of the year's most eagerly anticipated hard rock albums, Songs for the Deaf was issued in August 2002 and was preceded by a tour that saw Oliveri and Homme joined by Grohl on drums, ex-Screaming Trees vocalist Mark Lanegan, and A Perfect Circle guitarist/keyboardist Troy Van Leeuwen. As if their schedules weren't busy enough between QOTSA and their other projects, Oliveri and Homme signed on to pen the musical score to the movie The Dangerous Lives of Altar Boys (with backing by Rage Against the Machine drummer Brad Wilk), and formed a new project, Headband, with ex-Marilyn Manson bassist Twiggy Ramirez and Amen frontman Casey Chaos. Homme also hooked up with old friend Jesse Hughes for Eagles of Death Metal, which issued the Peace Love Death Metal LP in 2004. (Homme played drums.)\n\nWhen QOTSA reconvened for the March 2005 LP Lullabies to Paralyze, the lineup featured Homme, Joey Castillo, Alain Johannes, Van Leeuwan, and Lanegan. The Over the Years and Through the Woods CD/DVD appeared in November that same year. It featured live material from the band's tour for Lullabies, but also included rare and archival Queens footage. In 2007, the band (Lanegan at this point was only a guest) released the excellent Era Vulgaris, which also included contributions from the Strokes' Julian Casablancas, among others.\n\nEra Vulgaris wrapped up QOTSA's contract with Interscope and the group went into a period of inactivity as Homme pursued other projects over the next few years. Chief among these was Them Crooked Vultures, a power trio also featuring Dave Grohl and Led Zeppelin bassist John Paul Jones, who released an eponymous album in 2009. The next year saw a deluxe reissue of Rated R and then in 2011, the band reissued their hard-to-find debut and did a small supporting tour behind this deluxe edition. QOTSA began recording a new album in 2012, bringing Grohl back into the fold and also finding spots for Mark Lanegan, Trent Reznor, Jake Shears, and Elton John, as well as Nick Oliveri. Queens of the Stone Age signed with Matador in 2013 and the ...Like Clockwork album was released in June of that year.\n\n\n1997 - Kyuss/Queens of the Stone Age [EP]\n1998 - The Split CD [EP] w/ Beaver\n1998 - Queens of the Stone Age\n2000 - Rated R\n2002 - Songs for the Deaf\n2004 - Stone Age Complication [EP]\n2005 - Lullabies to Paralyze [Limited Tour Edition]\n2005 - Over the Years and Through the Woods [CD+DVD]\n2007 - Era Vulgaris\n2010 - Rated R [Deluxe Edition]\n2011 - Queens of the Stone Age [Remastered + Expanded]\n2013 - ...Like Clockwork\n\n\nAlbum artwork and rip logs are included. Enjoy!!!!!!!!!!!!!!!!!!!!!!!!!!!",
  "parsed": {
    "xt": "urn:btih:7fe10b4ba3f1b87201a188db30606d6d6c01ad66",
    "dn": "Queens of the Stone Age - Discography 1997-2013 [FLAC]",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "7fe10b4ba3f1b87201a188db30606d6d6c01ad66",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        127,
        225,
        11,
        75,
        163,
        241,
        184,
        114,
        1,
        161,
        136,
        219,
        48,
        96,
        109,
        109,
        108,
        1,
        173,
        102
      ]
    },
    "name": "Queens of the Stone Age - Discography 1997-2013 [FLAC]",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 63,
  "peers": 9,
  "last_updated": "2016-12-25T06:01:43.864Z"
}