{
  "title": "Need For Speed Underground 2 Reloaded",
  "uid": 4686514,
  "size": 1333462113,
  "categoryP": "games",
  "categoryS": "pc",
  "magnet": "?xt=urn:btih:822396c02ba904d237dd52f2cb421881e4624d28&amp;dn=Need+For+Speed+Underground+2+Reloaded&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 45,
  "leechers": 4,
  "uploader": "7171974",
  "files": -1,
  "time": 1233252198,
  "description": "Perfectly working Need For Speed Underground 2\n\nBy Reloaded.\n\nFound on internet....noticed Pirate Bay was short on this title.\n\nNo credits to me outside of sharing torrent and seeding.\n\nI personally would recommend everyone download and use Roxio Creator 2009's mounting tools rather then Daemon's...I never liked Daemon's and it's really buggy with Vista....You can download Roxio Creator 2009 here:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/4583913/Roxio_Creator_2009___KeyGen_-_Shadeyman&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/4583913/Roxio_Creator_2009___KeyGen_-_Shadeyman&lt;/a&gt;\n\nSincerely,\n\nMonolith\n\n\nDescription Need for Speed Underground 2 (c) EA Games\nRELEASE DATE: 11/2004\nPROTECTION: Safedisc 3\nDISC(S): 2\nGAME TYPE: Racing\n\nUNCOVER THE UNDERGROUND\n\nDiscover the living, breathing world of tuner culture in Need for Speed\nUnderground 2, the sequel to the best-selling racing game of 2003, and the\nlatest blockbuster installment in the legendary Need for Speed franchise.\nTaking place in a massive, free-roaming city featuring five distinct\ninterconnected neighborhoods, Need for Speed Underground 2 delivers an\nimmersive game world where the streets are your menus. As players explore\nthe city, they'll encounter rival racers who will school them in the ways of\nthe underground and tip them off to the hottest racing spots in town.\nDeep new performance tuning allows gamers to fine-tune every aspect of their\nride's handling and performance, while hundreds of new visual customizations\nguarantee players can create their own personalized, totally unique car.\nAll-new game modes join Circuit, Drift, and Drag events to add depth and\nvariety, pushing car and driver to the limit, while more than a dozen new\ncars and hundreds of aftermarket parts from the biggest names in the\nbusiness make Need for Speed Underground 2 the deepest, most authentic tuner\nexperience ever.\n\n\nKey Features\n\n- Free-Roaming City: Explore a massive city divided into five distinct,\ninterconnected neighborhoods, ranging from serpentine suburban hills to an\nintense downtown grid. A complex series of drivable freeways connect the\nneighborhoods together.\n- Emergent Gameplay: Want to make a name for yourself in the underground?\nYou'll need to find it first. Races can happen anywhere and at any time\nand as players encounter rivals on the street they'll be clued into where\nthey can buy the hottest upgrades or enter the most elite events.\n- New Gameplay Modes: Three new gameplay modes are added to last year's\ncircuit, drift and drag competitions, challenging gamers to hone their\nskills in a number of driving disciplines.\n- Performance Tuning: Tune every aspect of your car's performance with\nhundreds of licensed aftermarket performance upgrades and then fine-tune\neverything from the gear ratio to the suspension for the ultimate ride.\n- The Hottest Cars: More than thirty of the most sought-after tuner cars are\navailable from the hottest manufacturers--from Mitsubishi Motors, Nissan,\nand Toyota to Ford and Volkswagen, if they're hot on the street, they're\nin the game.\n- Visual Customization: With more than twice the visual customizations of\nlast year's game, there are literally billions of car combinations\navailable to gamers. Featuring audio upgrades, scissor doors, spoilers,\nheadlights, side skirts, roof scoops, hoods, rims, wide body kits, neon\nand more, if you can trick it out in real life, you can trick it out in\nNeed for Speed Underground 2.\n- Environmental Variety: Each of the five distinct neighborhoods in Need for\nSpeed Underground 2 feature a unique look and feel, including varied\ndriving conditions and track types. Road surfaces, real-time weather\neffects, and environmental hazards will keep gamers on their toes as they\nrace from dusk till dawn.\n\n1. Unrar.\n2. Burn or mount with daemon tools.\n3. Install the game.\n4. Use the keygen in /Crack dir on CD1 or in .rar file to generate your own key.\n5. Copy over cracked executables from /Crack dir on CD1 to your install dir.\n6. Play the game.",
  "parsed": {
    "xt": "urn:btih:822396c02ba904d237dd52f2cb421881e4624d28",
    "dn": "Need For Speed Underground 2 Reloaded",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "822396c02ba904d237dd52f2cb421881e4624d28",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        130,
        35,
        150,
        192,
        43,
        169,
        4,
        210,
        55,
        221,
        82,
        242,
        203,
        66,
        24,
        129,
        228,
        98,
        77,
        40
      ]
    },
    "name": "Need For Speed Underground 2 Reloaded",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 43,
  "peers": 5,
  "last_updated": "2016-12-27T05:25:26.167Z"
}