{
  "title": "Ableton Live 9 Suite 9.0.1 Mac os x (32 bit-io) [ChingLiu]",
  "uid": 8237375,
  "size": 698338044,
  "categoryP": "applications",
  "categoryS": "mac",
  "magnet": "?xt=urn:btih:82b1e4b6f1e52972edd0d86d6407dea962ff3809&amp;dn=Ableton+Live+9+Suite+9.0.1+Mac+os+x+%2832+bit-io%29+%5BChingLiu%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 38,
  "leechers": 1,
  "uploader": "Ching_Liu",
  "files": -1,
  "time": 1362871193,
  "description": "Ableton Live 9 new features\n\n* Session automation: In Session View, automation can now be recorded in real time directly within clips. Automation can move together with clips between Arrangement and Session View.\n* Find sounds fast: Live's new browser puts all instruments, effects, samples, and plug-ins in one easy-to-navigate view. Drag and drop folders from anywhere on your computer, search as you type and navigate from the keyboard to find everything quickly.\n* Discover new sounds: Live comes with a large selection (3,500 in the Suite edition) of production-ready sounds, which were carefully crafted with the help of over 40 artists, sound designers and engineers. All sounds feature Macro controls for fast access to their most meaningful, musical parameters.\n* Get your sound right: Live's studio effects have all been reworked for even better sound and usability. The Glue Compressor is a new effect - an authentic model of a legendary 1980s console bus compressor. EQ Eight has an audition mode for isolating frequencies and an expandable spectrum display. The Gate and Compressor effects feature a Gain Reduction view which shows changes in signal level over time.\n* Extract music from samples: Live's new Harmony, Melody and Drums To Midi tools extract natural-feeling MIDI directly from the favourite parts of your music collection. You can also sing, tap a rhythm, play any solo instrument, then use Melody or Drums to MIDI to turn your recordings into MIDI clips that you can edit and reuse with any sound.\n* Edit the details: Transpose, reverse and stretch MIDI notes or warp clip automation and add curves to automation envelopes. New tools and an improved workflow allow fast and flexible editing of musical ideas.\n* Max for Live - now in Suite: The Suite edition of Live 9 comes with Max for Live and its many unique instruments, effects and tools. Max for Live itself includes 24 new devices such as a convolution reverb, new drum synthesizer instruments, MIDI echo as well as reworked versions of classics such as Step Sequencer and Buffer Shuffler 2.\n\nSystem requirements\n\n- IntelÂ® Mac with Mac OS X 10.5 or later (32 bit)\n- Multicore processor\n- 2 GB RAM\n-1024x768 display\n-3GB free disk space\n\nLanguages : English, French, German, Italian, Japanese, Spanish\n\nHomepage :  &lt;a href=&quot;\nhttps://www.ableton.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://www.ableton.com/&lt;/a&gt;",
  "parsed": {
    "xt": "urn:btih:82b1e4b6f1e52972edd0d86d6407dea962ff3809",
    "dn": "Ableton Live 9 Suite 9.0.1 Mac os x (32 bit-io) [ChingLiu]",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "82b1e4b6f1e52972edd0d86d6407dea962ff3809",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        130,
        177,
        228,
        182,
        241,
        229,
        41,
        114,
        237,
        208,
        216,
        109,
        100,
        7,
        222,
        169,
        98,
        255,
        56,
        9
      ]
    },
    "name": "Ableton Live 9 Suite 9.0.1 Mac os x (32 bit-io) [ChingLiu]",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 8,
  "peers": 1,
  "last_updated": "2016-12-27T05:29:14.845Z"
}