{"title":"Understanding Bitcoin - Cryptography  Engineering and Economics-","uid":11311921,"size":5406253,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:830fd5bbb8a24da260c86de5436d705deb531230&amp;dn=Understanding+Bitcoin+-+Cryptography++Engineering+and+Economics-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":37,"leechers":0,"uploader":"eboneezer","files":-1,"time":1414518076,"description":" Author:Pedro Franco\nSeries: The Wiley Finance Series\nPages: 288 \nPublisher: Wiley; 1 edition (November 3, 2014)\nLanguage: English\nISBN-10: 1119019168\nISBN-13: 978-1119019169\n\nBitcoin is arguably one of the biggest developments in finance since the advent of fiat currency. With Understanding Bitcoin, expert author Pedro Franco provides finance professionals with a complete technical guide and resource to the cryptography, engineering and economic development of Bitcoin and other cryptocurrencies. This comprehensive, yet accessible work fully explores the supporting economic realities and technological advances of Bitcoin, and presents positive and negative arguments from various economic schools regarding its continued viability.\n\nThis authoritative text provides a step-by-step description of how Bitcoin works, starting with public key cryptography and moving on to explain transaction processing, the blockchain and mining technologies. This vital resource reviews Bitcoin from the broader perspective of digital currencies and explores historical attempts at cryptographic currencies. Bitcoin is, after all, not just a digital currency; it's a modern approach to the secure transfer of value using cryptography. This book is a detailed guide to what it is, how it works, and how it just may jumpstart a change in the way digital value changes hands.\n\n  Understand how Bitcoin works, and the technology behind it\nDelve into the economics of Bitcoin, and its impact on the financial industry\nDiscover alt-coins and other available cryptocurrencies\nExplore the ideas behind Bitcoin 2.0 technologies\nLearn transaction protocols, micropayment channels, atomic cross-chain trading, and more\n\n\n Bitcoin challenges the basic assumption under which the current financial system rests: that currencies are issued by central governments, and their supply is managed by central banks. To fully understand this revolutionary technology, Understanding Bitcoin is a uniquely complete, reader-friendly guide","torrent":{"xt":"urn:btih:830fd5bbb8a24da260c86de5436d705deb531230","amp;dn":"Understanding+Bitcoin+-+Cryptography++Engineering+and+Economics-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"830fd5bbb8a24da260c86de5436d705deb531230","infoHashBuffer":{"type":"Buffer","data":[131,15,213,187,184,162,77,162,96,200,109,229,67,109,112,93,235,83,18,48]},"announce":[],"urlList":[]}}