{
  "title": "The Land Before Time Movies Complete (All 13)",
  "uid": 5144073,
  "size": 9581452258,
  "categoryP": "video",
  "categoryS": "movies",
  "magnet": "?xt=urn:btih:83838a7f2b2c795fdfc4e54f32c4e9b2e0594ca5&amp;dn=The+Land+Before+Time+Movies+Complete+%28All+13%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 92,
  "leechers": 50,
  "uploader": "Bigfoot420",
  "files": 13,
  "time": 1257115016,
  "description": "The Land Before Time &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0095489/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0095489/&lt;/a&gt;\n\nAn orphaned brontosaurus named Littlefoot sets off in search of the legendary Great Valley. A land of lush vegetation where the dinosaurs can thrive and live in peace. Along the way he meets four other young dinosaurs, each one a different species, and they encounter several obstacles as they learn to work together in order to survive.\n\n\nThe Land Before Time 2 - The Great Valley Adventure &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0110300/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0110300/&lt;/a&gt;\n\nIn search of some adventure in their safe and peaceful valley, the five dinosaur friends make a hideaway. From there, they spot two thieves in action, stealing an egg from one of their broods. They chase them down and manage to recover the egg without its parents noticing, but in the process, accidentally create an opening into the valley, allowing two dreaded Sharptooths in. Everyone must fight them off together to preserve their peaceful way of life.\n\n\nThe Land Before Time 3 - The Time of the Great Giving  &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0113596/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0113596/&lt;/a&gt;\n\nA nearby meteorite crash blocks off the dinosaurs' water supply, starting an ecological chain-reaction that threatens life in the valley. All the dinosaurs, including a group of stupid bullies, must cooperate in an effort to free the blockage, which involves a risky venture outside the valley.  \n\n\nThe Land Before Time 4 - Journey Through the Mists &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0116817/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0116817/&lt;/a&gt;\n\nLittlefoot's grandfather is dreadfully ill and a golden flower is the only hope to cure him, but it lies within the land of the Mists so Littlefoot and his friends Cera, Ducky, Petrie, Spike and newcomer, Ali, journey through the mists to find it. Mayhem and danger await around every turn!\n\n\nThe Land Before Time V: The Mysterious Island &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0123950/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0123950/&lt;/a&gt;\n\nWhen a swarm of &quot;leaf-gobblers&quot; devours all the green food in the Great Valley, the herds move on to find another valley of greens and in the process, Littlefoot and his friends Spike, Cera, Petrie and Ducky wind up on an island in the middle of the Big Water. They're reunited with Chomper...Along with his nasty, hungry parents.\n\n\nThe Land Before Time 6 - The Secret of Saurus Rock &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0167247/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0167247/&lt;/a&gt;\n\nLittlefoot's grandfather one night tells the protagonist children a story about &quot;The Lone Dinosaur&quot;, a legendary longneck who once protected the Great Valley from the most ferocious sharptooth ever to live. A fight ensued, which led to the Sharptooth's death. However, the sharptooth left &quot;The Lone Dinosaur&quot; with a scar slashed across his right eye. Soon after the battle, a huge monolith that resembled a proud sauropod, having life-sized tyrannosaur teeth arranged around his neck, came out of the ground during an earthquake. The dinosaurs called it &quot;Saurus Rock&quot;.\n\n\nThe Land Before Time 7 - The Stone of Cold Fire &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0267657/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0267657/&lt;/a&gt;\n\nLittlefoot and his pals set off in search of a &quot;stone of cold fire&quot; that fell from the night sky. Since he's the only one who has seen it though, nobody really believes him. Littlefoot's uncle Pterano offers support only because he thinks the stone has secret powers and wants it for himself but conceals this from the rest. The young dinos must figure out the truth, before Pterano gets the power.\n\n\nThe Land Before Time 8 - The Big Freeze &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0301526/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0301526/&lt;/a&gt;\n\nWhen the dinosaur families get trapped in a valley by an ice storm, one family of &quot;spike tail&quot; dinosaurs volunteers to leave since they consume more food than the others. Meanwhile, the young dinos and a new adult dinosaur named Mr. Thicknose, head out to bring back their friend Spike, who has left his friends to be with members of his own species.\n\n\nThe Land Before Time 9 - Journey to the Big Water &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0345543/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0345543/&lt;/a&gt;\n\nWhen heavy rains create a mysterious &quot;new water&quot;, Littlefoot sets off to explore the Great Valley. He quickly becomes friends with Mo, a prank-playing dolphin-like creature who can't find his way back to the Big Water. Littlefoot and his pals come to the rescue and prove the value of courage, friendship, and diversity.\n\n\nThe Land Before Time 10 - The Great Longneck Migration &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0378230/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0378230/&lt;/a&gt;\n\nA bedtime story leads Littlefoot and his grandparents on a journey to a new land, where Littlefoot discovers someone who vanished before he was born: his father! Now Littlefoot must decide between two worlds. Will he leave to be with his friends in the Great Valley, or stay behind and start a new life with his father? This is the decision that could forever change The Land Before Time saga.\n\n\nThe Land Before Time 11 - Invasion of the Tinysauruses &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0424228/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0424228/&lt;/a&gt;\n\nWhile trying to obtain &quot;Tree Sweets&quot;, Littlefoot into the tree and knocks down all the blossoms, which attract the tiny dinosaurs, Tinysauruses. They devour the plants and disappear. But Littlefoot isn't blamed for the disappearance. Instead of taking the blame, he accidentally makes the adults go into a &quot;Get Frankenstein&quot; frenzy when they believe the tiny dinosaurs were the main cause. Now Littlefoot and his friends must protect the tiny herd, and in the end learn the value of honesty.\n\n\nThe Land Before Time 12 - The Great Day of the Flyers &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0933064/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0933064/&lt;/a&gt;\n\nPetrie and his siblings get ready to fly for the Day of the Flyers, but Petrie is frustrated that he keeps flying out of formation. While practicing, he meets Guido, a Microraptor who does not know what he is, or where he belongs. With the help of Guido, Petrie learns how to be himself and stand out from the crowd.\n\n\nThe Land Before Time 13 - Wisdom Of Friends &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1139111/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1139111/&lt;/a&gt;\n\nAfter an incident which nearly cost Littlefoot's grandmother her life, Littlefoot learns a series of lessons which his species call &quot;Wisdoms&quot;. Meanwhile, a trio of dim-witted Beipiaosauruses named Loofah, Doofah and Foobie arrive in the Great Valley and behave in a strange manner towards Littlefoot and the gang. Littlefoot is determined that they learn the &quot;Wisdoms&quot; and the journey to the one place the trio have dreamed of, Berry Valley, begins.",
  "parsed": {
    "xt": "urn:btih:83838a7f2b2c795fdfc4e54f32c4e9b2e0594ca5",
    "dn": "The Land Before Time Movies Complete (All 13)",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "83838a7f2b2c795fdfc4e54f32c4e9b2e0594ca5",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        131,
        131,
        138,
        127,
        43,
        44,
        121,
        95,
        223,
        196,
        229,
        79,
        50,
        196,
        233,
        178,
        224,
        89,
        76,
        165
      ]
    },
    "name": "The Land Before Time Movies Complete (All 13)",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 32,
  "peers": 97,
  "last_updated": "2016-12-27T05:34:13.770Z"
}