{
  "title": "Childs Play 1, 2, 3, 4, 5, 6 - Chucky Hexalogy Eng 720p [H264-mp",
  "uid": 11147946,
  "size": 3982948835,
  "categoryP": "video",
  "categoryS": "hd___movies",
  "magnet": "?xt=urn:btih:8404576e52a8563e1f293f878d7f70067ae5975b&amp;dn=Childs+Play+1%2C+2%2C+3%2C+4%2C+5%2C+6+-+Chucky+Hexalogy+Eng+720p+%5BH264-mp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 65,
  "leechers": 30,
  "uploader": "eyezin",
  "files": -1,
  "time": 1412287449,
  "description": "............................................................\n..:++++++++++++++++++++++++++++++++++++++++++++++++++:..\n..:+++++++++++++++++++Childs Play++++++++++++++++++++:..\n..:++++++++++++++++++++Hexalogy++++++++++++++++++++++:..\n..:++++++++++++++++++++++++++++++++++++++++++++++++++:..\n........................................................\n\n=&gt;-Childs Play 1..........: http://www.imdb.com/title/tt0094862/\n=&gt;-Childs Play 2..........: http://www.imdb.com/title/tt0099253/\n=&gt;-Childs Play 3..........: http://www.imdb.com/title/tt0103956/\n=&gt;-Childs Play 4..........: http://www.imdb.com/title/tt0144120/\n=&gt;-Childs Play 5..........: http://www.imdb.com/title/tt0387575/\n=&gt;-Childs Play 6..........: http://www.imdb.com/title/tt2230358/\n\nChilds Play.\nYoung Andy Barclay sees a commercial for a 'Good Guy' doll on TV, and asks his\nmother for one for his birthday. At work, Andy's mom and her friend discover a\npeddler selling one for a low price, and she buys it. What she doesn't know is\nthat the particular doll contains the spirit of Charles Lee Ray, aka 'The\nLakeshore Strangler', who died at the hands of police the night before and had\ntransferred his spirit to the doll by voodoo. That night, Andy's babysitter is\npushed from their 5th-floor window to her death, and only young Andy knows that\n'Chucky' - the doll - is responsible for that a death and a series of murders\nthat follow. Worse than that, the soul of Charles Lee Ray is trying to get out\nof the doll's body - and take over Andy's.\n\nStars.\n=&gt;-Catherine Hicks.\n=&gt;-Chris Sarandon.\n\nDirector.\n=&gt;-Tom Holland.\n\nChilds Play 2.\nChucky's back! The notorious killer doll with the satanic smile comes back to\nlife in this new chapter depicting the terrifying struggle between young Andy\nBarclay (Alex Vincent) and the demonic doll attempting to possess his soul.\nDespite being roasted to a crisp in his last escapade, Chucky rises from the\nashes after being reconstructed by a toy factory to dispel the negative publicity\nsurrounding the doll. Back in one piece, Chucky tracks his prey to a foster home\nwhere the chase begins again in this sequel to the enormously popular original. \n\nStars.\n=&gt;-Alex Vincent.\n=&gt;-Jenny Agutter.\n\nDirector.\n=&gt;-John Lafia.\n\nChilds Play 3.\nIt's been eight years since the events in the second film, we now see that Andy\nis a teenager who has been enrolled in a military school. Play Pals Toy Company\ndecides to re-release its Good Guys line, feeling that after all this time, the\nbad publicity has died down. As they re-used old materials, the spirit of Charles\nLee Ray once again comes to life. In his search for Andy, Chucky falls into the\nhands of a younger boy, and he realizes that it may be easier to transfer his\nsoul into this unsuspecting child. Andy is the only one who knows what Chucky is\nup to, and it's now up to him to put a stop to it.\n\nStars.\n=&gt;-Justin Whalin.\n=&gt;-Perrey Reeves.\n\nDirector.\n=&gt;-Jack Bender.\n\nBride of Chucky.\nSorry Jack! Chucky's back! In this horror flick, the murderous serial killer,\nCharles Lee Ray, has his body parts being held at a criminal evidence station\nin the form of a small doll known as the famous Chucky. When his old-time sweet\nheart, Tiffany, picks up his remaining limbs and puts them back together, she\nperforms a ritual that revives the murderous maniac. But Chucky decides that\nhe wants another individual to help him with his dirty work. So he kills\nTiffany, and then revives her as a &quot;doll bride&quot;. When they decide to spend\ntheir honeymoon with another happy couple on the highway, it becomes another\nmurder spree. With a &quot;blood-bath on wheels&quot; and two murderous dolls, the human\ncouples find that this was going to be a &quot;Highway To Hell&quot; in this gruesome\nfilm of blood and gore and a little bit of Chucky &amp; Tiffany.\n\nStars.\n=&gt;-Jennifer Tilly.\n=&gt;-Brad Dourif.\n\nDirector.\n=&gt;-Ronny Yu.\n\nSeed of Chucky.\nThe killer doll is back! Glen, the orphan doll offspring of the irrepressible\ndevilish-doll-come-to-life Chucky and his equally twisted bride Tiffany. When\nproduction starts on a movie detailing the urban legend of his parents' lethal\nexploits, Glen heads for Hollywood where he brings his bloodthirsty parents\nback from the dead. The family dynamics are far from perfect as Chucky and\nTiffany go Hollywood and get rolling on a new spree of murderous mayhem; much\nto gentle Glen's horror. Chucky can't believe that his child doesn't want to\nwalk in his murdering footsteps, and star-struck Tiffany can't believe that the\nmovie will star her favorite actress, Jennifer Tilly, who soon becomes an\nunwitting hostess to this new family in more ways than one.\n\nStars.\n=&gt;-Jennifer Tilly.\n=&gt;-Brad Dourif.\n\nDirector.\n=&gt;-Don Mancini.\n\nCurse of Chucky.\nDepressed Sarah lives with her disabled daughter Nica, who is wheelchair-bound\nsince birth, in an isolated old house. Sarah receives a package containing the\ncreepy red-haired doll Chucky and she throws it in the garbage. But during the\nnight she is found dead and Chucky is sat on a chair in the living room. Nica's\nsister Barb attends the funeral with her estranged husband Ian; their little\ndaughter Alice; the nanny Jill and her friend Father Frank. During the night,\nthere are mysterious deaths and Nica discovers that the package was sent from\nthe evidence depositary. She also researches on the Internet and suspects that\nChucky might be behind the murders.\n\nStars.\n\n=&gt;-Chantal Quesnelle.\n=&gt;-Fiona Dourif.\n\nDirector.\n=&gt;-Don Mancini. \n\nInfo\n=&gt;-Genre..................: Horror : Thriller.\n=&gt;-Release Date...........: 1988 : 1990 : 1991 : 1998 : 2004 : 2013.\n=&gt;-Language...............: English.\n=&gt;-File Size..............: 623MiB : 593MiB : 647MiB : 638MiB : 618MiB : 679 MiB. \n=&gt;-Overall bit rate.......: 998Kbps:1005Kbps:1011Kbps:1005Kbps:1005Kbps:1004Kbps.\n=&gt;-Movie Runtime..........: 1h27mn : 1h22mn : 1h29mn : 1h 28mn : 1h 25mn : 1h 34mn.\n\nVideo\n=&gt;-Codec..................: H.264/MPEG-4 AVC.\n=&gt;-Aspect Ratio...........: 16:9.\n=&gt;-Resolution.............: 1280 : 720.\n=&gt;-Bit rate...............: 850 Kbps.\n\nAudio\n=&gt;-Codec..................: mp4a: MPEG-4 AAC LC.\n=&gt;-Channels...............: 2 channel Stereo.\n=&gt;-Bit Rate...............: 152 Kbps.\n=&gt;-Maximum bit rate.......: 192 Kbps.",
  "parsed": {
    "xt": "urn:btih:8404576e52a8563e1f293f878d7f70067ae5975b",
    "dn": "Childs Play 1, 2, 3, 4, 5, 6 - Chucky Hexalogy Eng 720p [H264-mp",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "8404576e52a8563e1f293f878d7f70067ae5975b",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        132,
        4,
        87,
        110,
        82,
        168,
        86,
        62,
        31,
        41,
        63,
        135,
        141,
        127,
        112,
        6,
        122,
        229,
        151,
        91
      ]
    },
    "name": "Childs Play 1, 2, 3, 4, 5, 6 - Chucky Hexalogy Eng 720p [H264-mp",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 95,
  "peers": 0,
  "last_updated": "2016-12-25T06:27:14.880Z"
}