{
  "title": "Metallica -  Master Of Puppets  mp3 320k  1986",
  "uid": 11170045,
  "size": 131610562,
  "categoryP": "audio",
  "categoryS": "music",
  "magnet": "?xt=urn:btih:866f393af91083f2fb8f7510570012f81cf808bb&amp;dn=Metallica+-++Master+Of+Puppets++mp3+320k++1986&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 72,
  "leechers": 8,
  "uploader": "analogkid6103",
  "files": 8,
  "time": 1412688677,
  "description": "Country of origin:\nUnited States\nGenre:\nThrash Metal\nLyrical themes:\nSociety, Corruption, Internal Struggles, Anger\nLars Ulrich Drums (1981-present)\nJames Hetfield Guitars, Vocals (1981-present)\nKirk Hammett Guitars (lead) (1983-present)\nSee also: ex-Exodus\nRobert Trujillo Bass (2003-present)\nTracklist:\nimageUploader Speaks- Did anyone notice a metal loader and at almost 1000 uploads no Metallica. Do I hate em? Yeah and No As the music goes I was on board all the way back to Metal up your ass days and the compilation they were on back when Dave Mustain was still the lead axe slinger My problem became the outspoken views on file sharing they have a f*cking short memory, when they were trying to come up way back then a lot of the efforts that assisted them was the fact that all of us that loved the music were sharing it with everybody we knew as so on and on get it? Music sharing played a huge part in there rise so I find it incredible that they are so opposed to file sharing in comparison to then when they gave it away and exhorted us to share it . So theres that, I was never gonna share them again forget em all. I found that was not as easy as that Its better to share it than make anyone else pay for them we all payed enough for them now they are giving back. Im done thats all I got Now I will share them once again.,..\n1. Battery (5:12)\n2. Master of Puppets (8:35)\n3. The Thing That Should Not Be (6:36)\n4. Welcome Home (Sanitarium) (6:27)\n5. Disposable Heroes (8:16)\n6. Leper Messiah (5:40)\n7. Orion (8:27)\n8. Damage, Inc. (5:32)\n\n\nGenre: Thrash\nSubgenre: Thrash Metal\nBitrate: 320 k\nSize: 125.51 MB\nShow/Hide Files:\n8 files\nMetallica was formed by Lars Ulrich and James Hetfield in the fall of 1981. Ulrich (who originally came to the US to play tennis) had, during that summer, met Brian Slagel of Metal Blade Records and had secured an appeareance on an upcoming compilation called Metal Massacre but had no band. He quickly found Hetfield, who was playing in Leather Charm at the time, and one day in December of 1981, they recorded the rhythm tracks to a remake of a Leather Charm song, &quot;Hit the Lights.&quot; Guitarist Lloyd Grant ({link Defcon (USA)}) recorded a solo in January, 1982, and the song appeared on Metal Massacre in February.\n\nPermanent guitarist Dave Mustaine (Megadeth) was brought in in February of 1982, and a bassist, Ron McGovney was found. Ron (who also designed the famous Metallica logo) was James's roommate, and James taught him to play bass, so that the band could play live. The first live show was on March 14th, at Radio City Music Hall in Anaheim. James did only vocals, and Dave was the single guitarist. The band at this point had several rehearsal tapes floating about, but then in response to one of those being pressed to vinyl by Bongus Loadus Records, decided to record their first demo, with the Grant version of Hit the Lights and two covers. This demo was first given out at the March 27th, 1982 gig at the Whisky, when they opened for Saxon. A vocalist named Sammy Dijon, of the band {link Ruthless}, was in for a few rehearsals but no actual gigs (so do not add him to the former members section!).\nimage\nTwo more studio demos were recorded in 1982, one in April and one in July. On April 23rd, 1982, guitarist &quot;Damien Phillips&quot; (real name: Brad Parker) played one gig, before quitting, because Dave wouldn't let him do duelling leads. James took over as second guitarist live from then on. Extensive live gigging occured, including one show at Lars's high school on May 25th at which the final attendance was zero. On May 28th, Jef Warner was on vocals, but this show seems to have been a glorified rehearsal. He sang only that one gig. Tygers of Pan Tang vocalist Jesse Cox was considered, and John Bush was also offered the gig, but neither accepted.\n\nA live demo was recorded on November 29th, 1982, on a road trip to San Francisco. This road trip would prove useful, as the opener for Metallica on November 29th was a band called Exodus with Kirk Hammett on guitar. Also, Metallica attended a Trauma gig, with Cliff Burton on bass, and immediately tried to convince Cliff to join Metallica.\n\nCliff was convinced to join, on the condition that Metallica move to San Francisco. Cliff's first gig was March 5th, 1983. Ron McGovney was later seen in Phantasm. Problems between Dave Mustaine and the rest of the band arose in late March on a road trip to the east coast. Dave was given a bus ticket back home and unceremoniously released, while Kirk Hammett flew in and the band did not miss a gig. At this time, the band stayed with Anthrax and from what the band has said, it was very tough living, as all their little money went towards the band.\n\nThe first album, &quot;Kill 'em All,&quot; was recorded for Megaforce Records in the summer of 1983, and after some touring, they cut a four song demo in October. James Hetfield became the vocalist out of necessity and had considered finding a replacement so he could be a full time rhythm guitar player. They contemplated asking vocalist John Bush, vocalist of Armored Saint and later to be vocalist of Anthrax, to join but he declined, deciding to stay with &quot;his buddies band.&quot; In the end Hetfield decided to take over vocals once and for all. The second album, &quot;Ride The Lightning,&quot; came out in the spring of 1984, featuring riffs from Dave Mustaine and also Tom Hunting via Kirk Hammett.\n\nWork on a third album began in the summer of 1985, and the album, &quot;Master Of Puppets,&quot; was released in the spring of 1986. When James Hetfield broke his arm in a skateboarding accident in July, 1986, six weeks of gigs featured roadie John Marshall on rhythm guitar (he would later join Metal Church). On September 25th, James was back. One more gig was played on the 26th, and then on the morning of the 27th, their tour bus hit a patch of black ice and flipped over, killing bassist Cliff Burton. (Morbid aside: he and Kirk had switched bunks just a few hours before.)\n\nThe band decided to continue, and began searching for a new bassist. Among those that tried out was Kirk Hammett's friend, bass freak Les Claypool (Blind Illusion, Primus), who was rejected because he played too well. In the end, Flotsam &amp; Jetsam bassist Jason Newsted was brought in in November, being officially sworn in at a restaurant in Phoenix called Tommy's Joint. The &quot;...And Justice for All&quot; album was recorded in 1988, with a serious lack of bass presence, and then a world tour followed in 1989.\n\nIn 1989, Metallica was nominated to a grammy in &quot;Best Heavy Metal Performance of the Year&quot; alongside AC/DC, Iggy Pop and Jethro Tull. Everybody was expecting for Metallica to take the award, but surprisingly, the award went to classic rockers Jethro Tull. If you look closely, you can tell from the look in Alice Cooper's face (Alice presented the award along with Lita Ford) that he finds it VERY surprising.\n\nIn 1991, the fifth Metallica album was released and this time they had a new producer. Flemming Rasmussen (who have also produced for Pretty Maids and Blind Guardian among others), who had produced the previous 3 albums was out, and the new producer was Bob Rock. The new album was self-titled and had a much more commercial feel to it and sold 20 million copies worldwide.\n\nAnd this time, justice took place as Metallica received a grammy award for &quot;Best Heavy Metal Performance of the Year.&quot; When they received it, Lars Ulrich said: &quot;First of all we wanna thank... as you guys were expecting... We wanna thank Jethro Tull for not putting out an album this year.&quot;\n\nAfter extensive touring over the next four years, Metallica returned to the studio in May 1995, and recorded the album &quot;Load.&quot; The album was less metal-orientated and more laid back, and it still divides fans to this day. The follow up to &quot;Load,&quot; &quot;Reload,&quot; was released in 1997, and consisted of outtakes from &quot;Load.&quot;\n\nThe next album was released only a year later. &quot;Garage Inc.&quot; was a collection of B-Sides and the long out of print &quot;Garage Days Re-Revisited&quot; EP, along with a second disc consisting of brand new covers of songs from bands such as Mercyful Fate, The Misfits, Nick Cave and Lynyrd Skynyrd among others.\n\nAfter a year of touring, the next Metallica project was entitled &quot;S&amp;M,&quot; a collaboration of sorts with the San Fransisco Symphony Orchestra. This consisted of two live shows, with Metallica playing some of their songs with a full Orchestral Backing. &quot;S&amp;M&quot; was released in CD, video and DVD format in November 1999. Metallica then won a grammy for &quot;Rock Instrumental Performance&quot; with &quot;The Call of the Ktulu&quot; taken from the &quot;S&amp;M&quot; album.\n\nThe next few years would see a lot of upheaval within Metallica. In 2000 Metallica sued the file-sharing service Napster, with the claim that Napster &quot;encourages and enables visitors to its website to unlawfully exchange with others copyrighted songs and sound recordings without the knowledge or permission of Metallica&quot;` This move, while ultimately successful, alienated a significant portion of Metallica's fans. Next, in January 2001, Jason Newstead, who had been Metallica's bassist for 14 years, quit &quot;due to private and personal reasons, and the physical damage that [he had] done to [him]self over the years.&quot; This was followed by James going to rehab in July 2001.\n\nOver the next few years Metallica were quite close to splitting up, as was documented in their DVD &quot;Some Kind of Monster.&quot; However, they managed to overcome their differences, and by July 2003 they had Rob Trujillo as their new bassist and had released their eighth studio album, &quot;St. Anger.&quot;\n\nOn April 4, 2009 Metallica was inducted into the Rock And Roll Hall of Fame.So In conclusion Hetfield's view of file sharing sucks but Im not gonna let it deprive anybody of the music, we shared it to get em started and we will share it still enough said get thrashing...",
  "parsed": {
    "xt": "urn:btih:866f393af91083f2fb8f7510570012f81cf808bb",
    "dn": "Metallica -  Master Of Puppets  mp3 320k  1986",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "866f393af91083f2fb8f7510570012f81cf808bb",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        134,
        111,
        57,
        58,
        249,
        16,
        131,
        242,
        251,
        143,
        117,
        16,
        87,
        0,
        18,
        248,
        28,
        248,
        8,
        187
      ]
    },
    "name": "Metallica -  Master Of Puppets  mp3 320k  1986",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 80,
  "peers": 29,
  "last_updated": "2016-12-25T06:42:23.845Z"
}