{"title":"Depeche Mode - Discography 1981-2013 [FLAC]","uid":9445536,"size":21412112513,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:874abc68ec3e7b89ee212a14bcba0512c3a312e2&amp;dn=Depeche+Mode+-+Discography+1981-2013+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":79,"leechers":61,"uploader":"rudown78","files":1295,"time":1389090234,"description":"Depeche Mode - Discography 1981-2013 [FLAC]\n\nOriginally a product of Britain's new romantic movement, Depeche Mode went on to become the quintessential electro-pop band of the 1980s. One of the first acts to establish a musical identity based completely around the use of synthesizers, they began their existence as a bouncy dance-pop outfit but gradually developed a darker, more dramatic sound that ultimately positioned them as one of the most successful alternative bands of their era.\n\nThe roots of Depeche Mode date to 1976, when Basildon, England-based keyboardists Vince Clarke and Andrew Fletcher first teamed to form the group No Romance in China. The band proved short-lived, and by 1979 Clarke had formed French Look, another duo featuring guitarist/keyboardist Martin Gore; Fletcher soon signed on, and the group rechristened itself Composition of Sound. Initially, Clarke handled vocal chores, but in 1980 singer David Gahan was brought in to complete the lineup. After one final name change to Depeche Mode, the quartet members jettisoned all instruments excluding their synthesizers, honing a slick, techno-based sound to showcase Clarke's catchy melodies.\n\nAfter building a following on the London club scene, Depeche Mode debuted in 1980 with &quot;Photographic,&quot; a track included on the Some Bizzare Album label compilation. After signing to Mute Records, they issued &quot;Dreaming of Me&quot; in early 1981; while neither the single nor its follow-up, &quot;New Life,&quot; caused much of a stir, their third effort, &quot;Just Can't Get Enough,&quot; became a Top Ten U.K. hit, and their 1981 debut LP, Speak and Spell, was also a success. Just as Depeche Mode appeared poised for a major commercial breakthrough, however, principal songwriter Clarke abruptly exited to form Yazoo with singer Alison Moyet, leaving the group's future in grave doubt.\n\nAs Gore grabbed the band's songwriting reins, the remaining trio recruited keyboardist Alan Wilder to fill the technological void created by Clarke's departure. While 1982's A Broken Frame deviated only slightly from Depeche Mode's earlier work, Gore's ominous songs grew more assured and sophisticated by the time of 1983's Construction Time Again. Some Great Reward, issued the following year, was their artistic and commercial breakthrough, as Gore's dark, kinky preoccupations with spiritual doubt (&quot;Blasphemous Rumours&quot;) and psychosexual manipulation (&quot;Master and Servant&quot;) came to the fore; the egalitarian single &quot;People Are People&quot; was a major hit on both sides of the Atlantic and typified the music's turn toward more industrial textures.\n\nReleased in 1986, the atmospheric Black Celebration continued the trend toward grim melancholy and further established the group as a commercial force; it eventually sold over 500,000 copies in the U.S., which earned it gold status. Released in 1987, Music for the Masses, featuring three Hot 100 singles in &quot;Strangelove,&quot; &quot;Never Let Me Down Again,&quot; and &quot;Behind the Wheel,&quot; propelled the group into the mainstream. The album would sell over a million copies in the U.S. alone. A subsequent sold-out tour yielded the 1989 double live set 101. Recorded at the Rose Bowl in Pasadena, California, it was accompanied by a concert film directed by the legendary D.A. Pennebaker.\n\nWith the alternative music boom of the early '90s, Depeche Mode emerged as one of the world's most successful acts. The triple-platinum Violator, released in 1990, was a Top Ten smash that spawned the hits &quot;Personal Jesus&quot; (a number eight single), &quot;Enjoy the Silence,&quot; &quot;Policy of Truth,&quot; and &quot;World in My Eyes.&quot; Their 1993 LP Songs of Faith and Devotion -- featuring a significant change in its heavy use of electric guitars -- entered the charts in the number one slot. However, at the peak of its success, the group began to unravel, beginning with Wilder's 1995 exit. Gahan attempted to take his own life and later entered a drug rehabilitation clinic to battle an addiction to heroin.\n\nAfter a four-year layoff, Depeche Mode continued onward as a trio and released 1997's Ultra, which featured the hits &quot;Barrel of a Gun&quot; and &quot;It's No Good.&quot; A year later, the band embarked on a tour in support of its newly released hits album, The Singles 86&gt;98. Depeche Mode played 64 shows in 18 countries for over one million fans. Each member took some considerable time off after the tour's completion, and Depeche Mode would not regroup for another three years.\n\nExciter, the band's follow-up to Ultra, was released in 2001, with the singles &quot;Dream On&quot; and &quot;I Feel Loved&quot; finding moderate success on international radio outlets. Two years later, Gahan issued his debut solo album, the dark and sultry Paper Monsters. Gore also followed suit by issuing the all-covers CounterfeitÂ², a full-length sequel to his similarly themed 1989 EP. Each member supported his work with respective tours of the U.S. and Europe; however, the bandmembers soon resumed working together, and Playing the Angel, their 11th studio album, became a Top Ten hit upon its release in October 2005. Produced by Ben Hillier (Doves, Blur, U2, Elbow) and studded with singles like &quot;Precious&quot; and &quot;John (The Revelator),&quot; it topped the album charts in 18 countries and went multi-platinum and/or gold in 20 countries. Depeche Mode went on to play for more than two and a half million fans worldwide, and the DVD release Touring the Angel: Live in Milan (2006) captured one of the band's greatest shows. Sounds of the Universe, also made with the assistance of Hillier, arrived in early 2009 and debuted at number three in the U.S. The 2013 release of Delta Machine made for a trilogy of Hillier albums, while the album was mixed by longtime Depeche associate Flood. \n\n\n1981 - Speak &amp; Spell [UK]\n1982 - A Broken Frame [UK]\n1983 - Construction Time Again [UK]\n1984 - People Are People\n1984 - Some Great Reward\n1985 - The Singles 81--&gt;85\n1985 - Catching Up With Depeche Mode\n1986 - Black Celebration [UK]\n1986 - Black Celebration [US]\n1987 - Music for the Masses\n1988 - 101\n1990 - Violator\n1991 - Singles Box 1\n1991 - Singles Box 2\n1991 - Singles Box 3\n1993 - Songs of Faith and Devotion\n1993 - Songs of Faith and Devotion [Live]\n1997 - Ultra\n1998 - The Singles 81&gt;85\n1998 - The Singles 86&gt;98\n2001 - Exciter\n2004 - Remixes 81...04\n2004 - Singles Box 4\n2004 - Singles Box 5\n2004 - Singles Box 6\n2005 - Playing the Angel\n2006 - The Best of, Volume 1\n2009 - Sounds of the Universe\n2011 - Remixes 2. 81-11\n2013 - Delta Machine\n\n\nComplete album artwork and rip logs are also included. Enjoy!!!!!!!!!!!!!!!!!!!!","torrent":{"xt":"urn:btih:874abc68ec3e7b89ee212a14bcba0512c3a312e2","amp;dn":"Depeche+Mode+-+Discography+1981-2013+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"874abc68ec3e7b89ee212a14bcba0512c3a312e2","infoHashBuffer":{"type":"Buffer","data":[135,74,188,104,236,62,123,137,238,33,42,20,188,186,5,18,195,163,18,226]},"announce":[],"urlList":[]}}