{"title":"The Art of People (2016).epub Gooner","uid":15155658,"size":5845150,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8803dbbb3c5c39472ef3b818a6c18fc491cd9788&amp;dn=The+Art+of+People+%282016%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":91,"leechers":2,"uploader":"GoonerTPB","files":1,"time":1467298404,"description":"The Art of People - 11 Simple People Skills That Will Get You Everything You Want (2016).epub Gooner\r\n\r\nPublisher: Bantam USA (15 Mar. 2016)\r\nLanguage: English\r\nISBN-10: 0553419404\r\nISBN-13: 978-0553419405\r\n\r\nWhat does it take to win success and influence? Some people think that in today's hyper-competitive world, it's the tough, take-no-prisoners type who comes out on top. But in reality, argues New York Times bestselling author Dave Kerpen, it's actually those with the best &quot;people skills&quot; who win the day. Those who build the right relationships. Those who truly understand and connect with their colleagues, their customers, their partners. Those who can teach, lead, and inspire. \r\n\r\nIn a world where we are constantly connected, and social media has become the primary way we communicate, the key to getting ahead is being the person others like, respect, and trust. Because no matter who you are or what profession you're in, success is contingent less on what you can do for yourself, but on &quot;what other people are willing to do for&quot; you. Here, through 53 bite-sized, easy-to-execute, and often counter intuitive tips, you'll learn to master the 11 People Skills that will get you more of what you want at work, at home, and in life. For example, you ll learn: \r\n\r\n. The single most important question you can ever ask to win attention in a meeting\r\n\r\n. The one simple key to networking that nobody talks about\r\n\r\n. How to remain top of mind for thousands of people, everyday\r\n\r\n. Why it usually pays to be the one to give the bad news\r\n\r\n. How to blow off the right people\r\n\r\n. And why, when in doubt, buy him a Bonsai \r\n\r\nA book best described as &quot;How to Win Friends and Influence People&quot; for today's world, The Art of People shows how to charm and win over anyone to be more successful at work and outside of it.&quot;","torrent":{"xt":"urn:btih:8803dbbb3c5c39472ef3b818a6c18fc491cd9788","amp;dn":"The+Art+of+People+%282016%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8803dbbb3c5c39472ef3b818a6c18fc491cd9788","infoHashBuffer":{"type":"Buffer","data":[136,3,219,187,60,92,57,71,46,243,184,24,166,193,143,196,145,205,151,136]},"announce":[],"urlList":[]}}