{
  "title": "EASEUS Todo Backup Advanced Server 5.8 Retail + Keygen",
  "uid": 9015499,
  "size": 333935997,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:880f0398a1b9116296e4a1d96e7d00ada9cf8b97&amp;dn=EASEUS+Todo+Backup+Advanced+Server+5.8+Retail+%2B+Keygen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 41,
  "leechers": 0,
  "uploader": "trogl0",
  "files": 4,
  "time": 1381186193,
  "description": "EASEUS Todo Backup Advanced Server 5.8 Retail + Keygen\n\n================\n[Software INFO:]\n================\n\nEASEUS Todo Backup Advanced Server 5.8 Retail | 318.5 MB\n\nEaseUS Todo Backup Advanced Server is the Windows Server backup and disaster recovery for both physical and virtual Windows Server environments. It provides powerful server data backup &amp; recovery features such as fast system &amp; files backup, disaster recovery, Exchange/SQL Server database backup &amp; recovery, advanced backup scheduler and universal restore. It will simplify both basic and advanced server backup &amp; recovery management while minimizing server downtime as well as ensuring business continuity.\n\nFeatures\n- Easy backup system - back up entire system state, including the operation system and installed applications on-the-fly without interrupting Windows work.\n- Easy backup all files - network shared files, specified files &amp; folders and kinds of file types can be full or selectively backed up.\n- Reliable Exchange server database backup - easily restore Exchange database to the original location and save disk space with overwriting the original files for MS Exchange Server 2003, 2007 database. New!\n- Reliable SQL server database backup - full back up SQL database and log without interrupting MS SQL Server running. New!\n- Comprehensive disk and file differential backup - only capture the changes since the last full disk/partition or file backup to save disk space. New!\n- Advanced disk and file incremental backup - only backup the changes of your files since last disk/partition or file backup and save the storage space.\n- Multiple backup storage and double protect server - back up the system or files to a local hard drive, external hard drive, USB drive, CD/DVD or remote FTP server for double protection if disaster occurs.\n- Disk and partition clone - clone or transfer all the data on a hard disk, partition or dynamic volume to another. Clone disk is especially useful to upgrade your hard drive to a new one without reinstalling operating systems and applications.\n- Fast crashed system restore - backup the current operating system to a safe place and fast recover to its previous healthy working state in case of system crash.\n- Back up to FTP server for double protection - backup operating system and files to remote FTP server and double protect your data with immediate offsite backup.\n- Universal restore - restore the system including files, applications and settings to new and dissimilar hardware in minutes for system migration or hardware replacement.\n- Explore backup image file - explore, copy and restore files &amp; folders directly from backup image in Windows Explorer.\n- Delete old images - automatically delete/overwrite old images based on versions or days to save disk space according to your own settings.\n- WinPE recovery support - fast and easy to recover system in case of system crash.\n- Conveniently install program without system rebooting. New!\n- Script (Pre and Post Command) function - define commands (scripts) to execute the commands after or before backup tasks.\n- Better support Windows Server 2000/2003/2008 and Windows 2000/XP/Vista/7.\n- Free technical support - provide free technical support for all products.\n\n\nOS : Windows Server 2000, 2003, 2008, 2012, Windows SBS 2003, 2008, 2011 &amp; Windows 8, 7, Vista, XP, 2000\nLanguage : English\n\nHome Page - http://www.todo-backup.com/\n\n================\n[INSTALL NOTES]\n================\n\nStep 1: Please use 7Zip/WinRAR/Universal Extractor to EXTRACT FILES.\nStep 2: run the setup\nStep 3: Use the key generator to generate a valid serial.\n",
  "parsed": {
    "xt": "urn:btih:880f0398a1b9116296e4a1d96e7d00ada9cf8b97",
    "dn": "EASEUS Todo Backup Advanced Server 5.8 Retail   Keygen",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "880f0398a1b9116296e4a1d96e7d00ada9cf8b97",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        136,
        15,
        3,
        152,
        161,
        185,
        17,
        98,
        150,
        228,
        161,
        217,
        110,
        125,
        0,
        173,
        169,
        207,
        139,
        151
      ]
    },
    "name": "EASEUS Todo Backup Advanced Server 5.8 Retail   Keygen",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 21,
  "peers": 19,
  "last_updated": "2016-12-27T06:02:39.449Z"
}