{
  "title": "UDEMY HTML5 AND CSS3 CREATE A WEBSITE IN HTML CSS AND PHP TUTORI",
  "uid": 12064094,
  "size": 1302672814,
  "categoryP": "other",
  "categoryS": "other",
  "magnet": "?xt=urn:btih:88c9e89b55f55f875cd0656202eb5155f8787a60&amp;dn=UDEMY+HTML5+AND+CSS3+CREATE+A+WEBSITE+IN+HTML+CSS+AND+PHP+TUTORI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 59,
  "leechers": 15,
  "uploader": "RandalPaul",
  "files": 98,
  "time": 1435349777,
  "description": "UDEMY HTML5 AND CSS3 CREATE A WEBSITE IN HTML CSS AND PHP TUTORIAL\n\nJoin over 1300 students who are currently learning\nHTML5, CSS, Bootstrap and Webpage Animation in\nthis course\n\nHTML5 and CSS3 can be a little intimidating; with\ntheir ever-growing functionality. But... No More!\n\nBy the time you have finished this course you will have built a\nHTML5 page with CSS from scratch; built a Bootstrap webpage and\ncreated Animation into your page using HTML and CSS\n\nWhy spend time going through theory after theory after theory?\nWhy not just get to it; get creating a HTML page. Get to the\nactual good stuff..That is what this course is all about. This\ncourse is aimed at people who want to get started with the\ncreating pages now and then follow up with some\ntheory just to re-inforce what you have already\nlearnt and created\n\nYou will start with HTML5; follow along my step by\nstep lectures and create your first HTML5 page. Next\nyou will learn how to add CSS styling to that page\nand style sections; including learning how to use\nfloat, add shadow, create great looking menus\n\nOnce you've finished your first HTML page you will more onto\nhow to create a Bootstrap page. Its so easy you hardly have to\nenter any code... You will learn by following along; how to\nquickly and easily create the base Bootstrap page; how to add\nelements and then add your own custom CSS\n\nOnce completed, its time to learn about animation\nin HTML5 and CSS3. Yes; you can animate elements on\nyour page just with HTML5 and CSS3!!! No need for\nJavascript, PhP or any other.. You will learn by\nfollowing along how to add and create animation\n\nBy the end of this course you will have built HTML5\npages with CSS; a Bootstrap page AND added your\nanimation. So easy your granny could do it\n\nSo, are you ready to create a webpage? If so; this is what we\nwill be doing: * Follow along example of HTML5 and CSS webpage\n* Now includes follow along example of Bootstrap webpage\n* Create some webpages\n* Add styling using CSS\n* Learn some great HTML based annimation techniques\n* Gain what you need to create your webpage\n* Create a Mobile Responsive website with Bootstrap\n* Add animation to your webpage\n\nAnd when you have completed your own page after\ntaking this course, you can share it with us all\n\n8th June 2015\n\nI've just added a new section and 10 new lectures; teaching by\nexample how to use Bootstrap to create a mobile responsive\nwebsite. By the end of these lectures you too will be able to\nreproduce the Bootstrap page\n\n17th June 2015\n\nAnimation in Webpages has come a long way and to\nshow how it can be done I have added a new section\nto this course on animation\n\n20th Just 2015\n\nI've just added a new section; section 9 which in how to create\na simple contact us page using HTML, CSS3 and PHP",
  "parsed": {
    "xt": "urn:btih:88c9e89b55f55f875cd0656202eb5155f8787a60",
    "dn": "UDEMY HTML5 AND CSS3 CREATE A WEBSITE IN HTML CSS AND PHP TUTORI",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "88c9e89b55f55f875cd0656202eb5155f8787a60",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        136,
        201,
        232,
        155,
        85,
        245,
        95,
        135,
        92,
        208,
        101,
        98,
        2,
        235,
        81,
        85,
        248,
        120,
        122,
        96
      ]
    },
    "name": "UDEMY HTML5 AND CSS3 CREATE A WEBSITE IN HTML CSS AND PHP TUTORI",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 50,
  "peers": 50,
  "last_updated": "2016-12-27T06:07:40.468Z"
}