{
  "title": "ESET SMART SECURITY 7 x32x64 [HYPERDRIVE25]",
  "uid": 9560172,
  "size": 100519685,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:8930f074afaeb0fe254f0e229917dd94ef63a063&amp;dn=ESET+SMART+SECURITY+7+x32x64+%5BHYPERDRIVE25%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 61,
  "leechers": 6,
  "uploader": "Hyperdrive25",
  "files": -1,
  "time": 1391409667,
  "description": "                    ESET SMART SECURITY 7 x32 x64 [HYPERDRIVE25]\n                    ============================================  \nOur latest Internet security looking after your security. Connect securely on social networks, browse the internet or just play.\n\nAntivirus, Antispyware, Anti-Phishing, Personal Firewall, Antispam &amp; Antitheft  \nSafer online begins with our proven Antivirus and Antispyware. Inside you find a number of unique anti-malware technologies.\n\nFoiling web browser attacks is a job for Exploit Blocker. Vulnerability Shield closes common weaknesses in the network.\n\n\nAnti-Theft - In case you lose your device, don't lose your head. There's hope. Through our Anti-Theft online interface start searching for it.\nTrack its position, view webcam snapshots and send a message to the finder. All this to give you the clues so you can re-unite.\n\n\nGamer Mode - Small System Footprint lets you stay connected without slowdowns. Do away with distractions with Gamer Mode as you run programs in full screen. \n\nParental Control- Keep Kids Safe Online. Show them only the safe side of the Internet. With Parental Control, block over 20 website categories or add your own\n\n\nSocial Media - Scanner Stay protected while using social media. Decide which information is visible to public, and make changes to your profile you see fit.\nOn Facebook, protect you and your friend's timeline messages and newsfeed against malware. On Twitter, protect your profile and posts, as well as those you follow against malicious links.\n\nMore Features-  Advanced Memory Scanner,  Vulnerability Shield &amp;  Device Control\n\n\n\nINSTALL NOTES: Extract ESSx32x64[Hyperdrive25] and run either the 32bit or 64bit\ninstaller.\n\n[OFFLINE METHOD]\nThen boot computer in SAFE MODE(use msconfig), extract the ESET Purefix v2.03 Activator and run it in SAFE MODE. A message should appear saying the product is activated. Then reboot your computer in NORMAL MODE(use msconfig). ESET is now activated for life. \n\n[ONLINE METHOD]\nGo into the TNOD Folder, and extract the contents if the installer and run it.\nThe application will find the key and install it for you. The process is automatic.\nWhen the key expires eventually, TNOD will find and install another one automatically. You can also hunt for keys manually using the TNOD interface[optional].\n\nN.B: You cannot use both the purefix and tnod at the same time.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
  "parsed": {
    "xt": "urn:btih:8930f074afaeb0fe254f0e229917dd94ef63a063",
    "dn": "ESET SMART SECURITY 7 x32x64 [HYPERDRIVE25]",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "8930f074afaeb0fe254f0e229917dd94ef63a063",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        137,
        48,
        240,
        116,
        175,
        174,
        176,
        254,
        37,
        79,
        14,
        34,
        153,
        23,
        221,
        148,
        239,
        99,
        160,
        99
      ]
    },
    "name": "ESET SMART SECURITY 7 x32x64 [HYPERDRIVE25]",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 67,
  "peers": 28,
  "last_updated": "2016-12-25T07:00:39.594Z"
}