{"title":"Ultimate Spider Man (Spiderman) (Direct Play) (Full Game)","uid":6835192,"size":904813398,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:89526fa3e1fb76135a780a2fde67f94f8cce19b5&amp;dn=Ultimate+Spider+Man+%28Spiderman%29+%28Direct+Play%29+%28Full+Game%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":138,"leechers":12,"uploader":"FuCtUpPuNk","files":6,"time":1322003439,"description":"INSTALLATION\n1. Using 7-zip OR Winrar, Extract The File &quot;Ultimate Spider-Man.7z&quot;\nRight Click/7-Zip/Extract Files\nor \nRight Click/Winrar Extract Files\n\n2. Run &quot;USM.exe&quot; to start the game\n\n3. Play and have fun\n------------------------\n------------------------\n------------------------\n\nPLOT:\nThe game begins with a recap of Spider-Man's (Peter Parker) first fight with Venom (Eddie Brock) before he disappeared. Spider-Man fights Venom on the high school football field on a rainy night, before spanning to the middle of a street where Venom was believed to be killed by a downed, live power line. Three months later, Parker has resumed his normal life and has forgotten about Venom. After stopping Shocker, Spider-Man ends up in a race against Human Torch. Meanwhile, Eddie, who is actually alive, has been feeding on people randomly in a nearby park and proves his strength in a fight with Wolverine into a bar and then into a next-door building.\nAfter a fight with the R.H.I.N.O., Spider-Man gets his first foreshadowing of Venom returning when his Spider-Sense overloads. That night, Silver Sable and her Wild Pack attack Venom, who easily escapes. During a field trip to the Metropolitan Museum of Art, Peter gets his &quot;Eddie headaches&quot; again and fights his former friend on the roof. However, Venom is later captured by Silver Sable. Kept imprisoned in an energy cage, Bolivar Trask and Adrian Toomes convince Eddie to test the suit for them as they knew Eddie and Peter's parents. His first test is to battle the recently escaped Electro where they fight over a knocked out Spider-Man in Times Square. Venom will not let Electro kill Spider-Man and ends up fighting and defeating him. Before Venom can eliminate an unconscious Spider-Man, S.H.I.E.L.D. interferes and Venom makes his escape. Nick Fury wakes up Spider-Man as S.H.I.E.L.D. Agents arrest Electro. Venom returns to Trask where he reveals to Silver Sable that Peter Parker is Spider-Man. He then transforms and is chased away by the Wild Pack.\nMeanwhile, a mercenary who calls himself the Beetle attacks New York by freeing the Green Goblin from his prison. Spider-Man pursues the Beetle after he steals a vial containing a sample of Sandman. After a brief fight, Spider-Man loses him during the battle. When asking the nearby people if they have seen the Beetle pass by, they point to the Latverian Embassy. Later on, Fury visits Peter at the top of the Daily Bugle warning him not to go to the Latverian Embassy. After Peter leaves, Fury tells Sharon Carter that Peter will do the opposite anyway. When Spider-Man ends up outside of the Latverian Embassy, Green Goblin emerges and Spider-Man pursues him to the U.N. building. After being defeated, Green Goblin is taken into S.H.I.E.L.D. custody by Sharon Carter and some S.H.I.E.L.D. agents. Beetle is later dispatched to collect a sample of the Venom suit. Venom eventually pursues, fights, and defeats him.\nWhile walking through town, Silver Sable fires a tranquilizer at Peter and tries to bring him to Trask. Peter awakens and they fight above the Queensboro Bridge before Venom appears and knocks Sable out. Peter ends up changing into Spider-Man and goes after Venom. Spider-Man and Venom fight but both go down due to Spider-Man knocking Eddie out and the tranquilizer that Silver Sable fired at Peter takes effect. Eddie awakens inside Trask Industries hearing Peter screaming as Toomes injects him with their own makeshift sample of the Venom suit, transforming him into Carnage. After a fight, Venom then absorbs Carnage and spits Peter out. The combination of the Carnage suit and the leftover Venom samples in Peter's blood, Eddie gains complete control over the suit. Bolivar Trask finally gives Peter files on their parents but takes them while trying to flee from an angry Venom. Venom is eventually defeated but escapes from S.H.I.E.L.D. authorities.\nAs S.H.I.E.L.D. arrives, Peter reads the files and discovers that the reason for their parents' plane crash was due to Eddie Brock, Sr., trying on the Venom suit onboard. There were only three survivors and one of the witnesses was Peter's mother who died in the ambulance. When Peter tells Fury that Eddie must see these files, Fury tells him that Eddie escaped. Later, a cutscene shows Eddie on a small prison island where Trask has been imprisoned. Eddie claims that he cannot believe that &quot;after all the things you did, all the things you made me do; that after all of that, all you got was three years in a golf course prison.&quot; After stating this, Eddie transforms into Venom, and proceeds to kill Trask. Then, the game cuts to a scene showing Peter and Mary-Jane sitting atop a warehouse roof. He tells Mary-Jane that he does not know if he is scared of, or for, Eddie, who Peter knows is out there somewhere. She replies by telling him not to worry about it, and that while Eddie was not there, she is. The two move closer to each other, and Peter puts his arm around her. The final cutscene shows Venom standing on the corner of a tall building with the top of his suit open. After showing Eddie's eyes open, the suit fully envelops him. He roars and proceeds to run and jump off the building.\n\nBOSSES:\nThe player battles the following bosses (in this order) as Spider-Man, unless otherwise noted:\nVenom (as Peter Parker)\nShocker\nWolverine (as Venom)\nJohnny Storm/Human Torch (race, not a real boss)\nRhino\nVenom (2nd time)\nElectro (as Venom)\nBeetle\nSilver Sable (as Venom)\nGreen Goblin\nBeetle (2nd time) (as Venom)\nSilver Sable (2nd time, as Peter Parker)\nVenom (3rd time)\nCarnage (as Venom)\n(Final Boss) Venom, with both symbiotes (4th time)\n\nGAMEPLAY:\nIn Ultimate Spider-Man, the player can experience a free-roaming city environment that covers Manhattan and Queens. The player starts in story-mode where the game automatically switches between Spider-Man and Venom. Spider-Man travels by web swinging, but the player must shoot a web at an actual building to swing, much like in the previous game, Spider-Man 2. Spider-Man uses acrobatic attacks. Venom travels by using his symbiote to pull himself and by performing massive jumps. Venom attacks using his claws and tendrils. Venom can also throw cars at targets and perform much more brutal attacks, including eating people in order to gain health.\nAs the game progresses, Parker/Spider-Man and the player will have certain &quot;City Goals&quot; to accomplish in order to continue the storyline. There are additional activities throughout the game such as finding secret tokens, landmark tokens, comic book covers, and competing in trick races.\nSpider-Man plays similarly to his Spider-Man 2 incarnation, using web shots as his main method of transportation and combat, while Venom has to resort to jumping for long distances. Venom's attacks are also generally stronger than Spider-Man's. Venom (like Spider-Man) can also scale buildings. Venom (as previously stated) can also leech life from enemies and civilians. The player has to do this constantly, as Venom's health is continuously depleting, even when he is not being attacked (the suit is feeding on Eddie Brock, so Eddie uses other people to feed it instead).\n\n-------------------------------------------------------------------------------------------\n-------------------------------------------------------------------------------------------\nHELP ME SEED MY LOW-SEEDED TORRENTS SO I CAN UPLOAD MORE AND NOT WORRY ABOUT THE OLD ONES!\n-------------------------------------------------------------------------------------------\n-------------------------------------------------------------------------------------------\n\nDon't forget to snag a copy of my Land of the Dead torrent (you can play it online).\n\n\nI HAVE A FEW ONLINE PLAYABLE TORRENTS SO FAR:\nLand of the Dead\nPostal 1 and Postal 2 Share The Pain (All Mods)\nSniper Elite\nSerious Sam: The First and Second Encounter\nNexuiz\nall doom, heretic sotsr, hexen + ddc, n similar stuff (52 games)    NOTE: This Requires a mod to play online (skulltag), it's free, google it\nDoom Collection (all the older doom games)  NOTE: This Requires a mod to play online (skulltag), it's free, google it\nOTHERS CAN MOST LIKELY BE PLAYED VIA HAMACHI\n\n\nDOWNLOAD ALL MY TORRENTS HERE:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/FuCtUpPuNk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/FuCtUpPuNk&lt;/a&gt;","torrent":{"xt":"urn:btih:89526fa3e1fb76135a780a2fde67f94f8cce19b5","amp;dn":"Ultimate+Spider+Man+%28Spiderman%29+%28Direct+Play%29+%28Full+Game%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89526fa3e1fb76135a780a2fde67f94f8cce19b5","infoHashBuffer":{"type":"Buffer","data":[137,82,111,163,225,251,118,19,90,120,10,47,222,103,249,79,140,206,25,181]},"announce":[],"urlList":[]}}