{
  "title": "Kerbal Space Program 1.0.2 Windows",
  "uid": 11891683,
  "size": 463678932,
  "categoryP": "games",
  "categoryS": "pc",
  "magnet": "?xt=urn:btih:8b1d2f95f7ce6a9a1dcf47510693a2d8a256fd2c&amp;dn=Kerbal+Space+Program+1.0.2+Windows&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 117,
  "leechers": 2,
  "uploader": "fobertaty",
  "files": 1,
  "time": 1431012972,
  "description": "Kerbal Space Program is a multi-genre game where players create their own space program.\n\nIn KSP, you must build space-worthy craft, capable of flying your crew out into space, without killing them. At your disposal is a collection of parts, which must be assembled to create a functional ship. Each part has its own function and will affect the way a ship flies (or doesn't). So strap yourself in, and get ready to try some Rocket Science!\n\nThe game is being built first as an open sandbox, you're free to build anything you can think of, and fly it wherever you want, even into orbit and out to other planets and moons throughout the Kerbal Solar System. The first draft of the career mode is also available now, it is still in development, so expect more features!\n\nThe game offers three gameplay modes: Sandbox, in which you are free to build anything you can think of; Science Mode, which lets you perform Scientific experiments to advance the knowledge of Kerbalkind and further the available technology; and Career Mode, in which you must manage every aspect of your Space Program, including administration strategies, Crew Management, Reputation, as well as taking up Contracts to earn Funds and upgrade your Space Center Facilities (or repair them).\n\nAdd to this the ability to capture asteroids (a feature done in collaboration with NASA), Mining for resources out across the furthest reaches of the Solar System, Constructing Bases and Space Stations in and around other worlds; plus literally thousands of mods from a huge active modding community, all add up into the award-winning game that has taken the space sim genre by storm.\n\nP.s. This is little bug fix, changelog:\nv1.0.2 ==================================================\nBug Fixes and Tweaks:\nThermal:\n* Fixed ships potentially overheating when splashed down.\nParts\n* Small tweak to Mk16 parachute drag",
  "parsed": {
    "xt": "urn:btih:8b1d2f95f7ce6a9a1dcf47510693a2d8a256fd2c",
    "dn": "Kerbal Space Program 1.0.2 Windows",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "8b1d2f95f7ce6a9a1dcf47510693a2d8a256fd2c",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        139,
        29,
        47,
        149,
        247,
        206,
        106,
        154,
        29,
        207,
        71,
        81,
        6,
        147,
        162,
        216,
        162,
        86,
        253,
        44
      ]
    },
    "name": "Kerbal Space Program 1.0.2 Windows",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 119,
  "peers": 1,
  "last_updated": "2016-12-25T07:12:47.707Z"
}