{
  "title": "Adobe InDesign CC 2015 11.3.0.034 Multilingual(x86x64)-=TEAM OS=",
  "uid": 13827325,
  "size": 1521103116,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:8b27d70a7eaab8fd29eacdd189e69ae60b422bf5&amp;dn=Adobe+InDesign+CC+2015+11.3.0.034+Multilingual%28x86x64%29-%3DTEAM+OS%3D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 58,
  "leechers": 9,
  "uploader": "OnlyByTheRain",
  "files": 3,
  "time": 1457703858,
  "description": "[B]Adobe InDesign CC 2015 11.3.0.034 Multilingual[/B]\r\n\r\n[img]https://dump.bz/storage-1/0615/dkCLw7idGRzQLzxkhKU18PYjOEmszhVN.jpg[/img]\r\n\r\n[b]InDesign CC. All new in 2015. Craft elegant layouts at your desk or on the go. The industry-leading page design and layout toolset now helps you work faster and smarter, connecting your desktop and mobile apps with all your creative assets, so you can make beautiful pages for print or digital no matter where you are.\r\n\r\nPolished pages, faster than ever.\r\nCreate production-quality page designs and layouts on your mobile devices as well as your desktop. And get immediate access to all your assets — including Adobe Stock images — from right inside InDesign. See how the latest release helps you go from initial comp to finished page layout with incredible speed and precision.\r\n\r\nAccess all your InDesign assets anywhere with CreativeSync.\r\nAdobe CreativeSync keeps everything you need up to date and at your fingertips across your desktop, web and mobile apps. It automatically syncs your shapes, colors, graphics, character and paragraph styles, Adobe Stock assets, settings, metadata and more. It also powers your Creative Cloud Libraries, giving you instant access to your favorite assets right from within InDesign. With CreativeSync, you can start your project in any app on any device, pick it up where you left off and finish it on your desktop.\r\n\r\nMillions of high-quality images. Right inside InDesign.\r\nFind the perfect photo or graphic to jump-start your next project and make it amazing. The new Adobe Stock service offers 40 million curated, royalty-free assets that are all available from InDesign CC in just a few clicks. And Creative Cloud members get special pricing — 40% off Adobe Stock when you add it to your membership. It's the industry's best value.\r\n\r\nWhat's new in Adobe InDesign CC 2015:\r\n\r\nEdit once, update everywhere\r\nAssets in Creative Cloud Libraries can now be linked so that when a change is made, you and your team members have the option of updating the asset across any InDesign, Illustrator or Photoshop projects where it's used.\r\n\r\nIntegrated with Adobe Comp CC\r\nCreate layouts for print, web or mobile anywhere on your iPad. Pull creative assets into Comp from your or your team’s shared Creative Cloud Libraries, then instantly send your layouts to InDesign. All your text, images and graphics are live and fully editable.\r\n\r\nPlace images into tables\r\nNow, along with text, you can add graphics directly into tables and it's quick and easy to do. Simply use the Place Gun or drag and drop images from Finder/Explorer or the Content Collector.\r\n\r\nEasily publish documents online\r\nPublish Online (Preview) lets you effortlessly publish and distribute documents online where they can be viewed without the need for a plug-in. Plus, you can include buttons, slideshows, animation, audio and video.\r\n\r\nFind the perfect image or graphic, fast\r\nThe new Adobe Stock marketplace lets you find, license and manage royalty-free images and videos from within InDesign CC. Select from 40 million assets, save your selection to your Creative Cloud Libraries and then drag it into your project to use.\r\n\r\nMercury Performance System advancements\r\nWork more than twice as fast zooming in and out, scrolling with a mouse wheel or paging up and down complex documents. Page thumbnails redraw more quickly when editing, too.\r\n\r\nAdd borders and shading to paragraphs\r\nQuickly and easily add borders and shading to paragraphs without manual workarounds. Highlights adjust automatically as you edit text, even if it flows across columns. Plus, you have controls for offsets and more.\r\n\r\nMore Acrobat PDF defaults\r\nNew options in the export to PDF print dialog box give you the ability to set the default view settings.\r\n\r\nSystem Requirements:\r\n\r\nWindows:\r\n- Intel Pentium 4 or AMD Athlon 64 processor\r\n- Microsoft Windows 7 with Service Pack 1, Windows 8, or Windows 8.1\r\n- 2 GB of RAM (8 GB recommended)\r\n- 2.6 GB of available hard-disk space for installation; additional free space required during installation (cannot install on removable flash storage devices)\r\n- 1024 x 768 display (1280 x 800 recommended) with 32-bit video card; supports HiDPI display\r\n- Adobe® Flash® Player 10 software required to export SWF files\r\n- Internet connection and registration are necessary for required software activation, validation of subscriptions, and access to online services.*[/b]",
  "parsed": {
    "xt": "urn:btih:8b27d70a7eaab8fd29eacdd189e69ae60b422bf5",
    "dn": "Adobe InDesign CC 2015 11.3.0.034 Multilingual(x86x64)-=TEAM OS=",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "8b27d70a7eaab8fd29eacdd189e69ae60b422bf5",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        139,
        39,
        215,
        10,
        126,
        170,
        184,
        253,
        41,
        234,
        205,
        209,
        137,
        230,
        154,
        230,
        11,
        66,
        43,
        245
      ]
    },
    "name": "Adobe InDesign CC 2015 11.3.0.034 Multilingual(x86x64)-=TEAM OS=",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 67,
  "peers": 170,
  "last_updated": "2016-12-25T07:13:07.765Z"
}