{
  "title": "Skill-Building And Scroll Saw ,Carving Techniques Books  Collect",
  "uid": 11818547,
  "size": 1721122770,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:8b4f6ad7fa8adb0b37a6b07169f437eb850964a6&amp;dn=Skill-Building+And+Scroll+Saw+%2CCarving+Techniques+Books++Collect&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 64,
  "leechers": 10,
  "uploader": "MANTESH",
  "files": 68,
  "time": 1429185064,
  "description": " &lt;a href=&quot;http://s26.postimg.org/ph4i3ptop/Wooden_Boxes_Skill_Building_Scroll_Saw_Techn.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://s26.postimg.org/ph4i3ptop/Wooden_Boxes_Skill_Building_Scroll_Saw_Techn.jpg&lt;/a&gt;\n\n\n\n\nWooden Boxes: Skill-Building &amp; Scroll Saw Techniques,Patterns and Instructions and Detailed Plans of Easy-to-Make Projects - Mantesh\n\n1. Wooden Boxes: Skill-Building Techniques for Seven Unique Projects - Dennis Lee Zongker \n2. Creating Wooden Boxes on the Scroll Saw: Patterns and Instructions for Jewelry, Music, and Other Keepsake Boxes (The Best of Scroll Saw Woodworking &amp; Cra) - by Scroll Saw Woodworking &amp; Crafts Magazine \n3. New Masters of the Wooden Box: Expanding the Boundaries of Box Making (New Masters Series) -  Oscar P. Fitzgerald \n4. Custom Wooden Boxes for the Scroll Saw: Step-By-Step Instructions and Detailed Plans for 30 Plus Innovative Projects - Diana Thompson \n5. Creative Wooden Boxes from the Scroll Saw: 28 Useful &amp; Surprisingly Easy-to-Make Projects - Carole Rothman -\n6. Custom Wooden Music Boxes for the Scroll Saw: Over 45 Projects from the Berry Basket Collection - Rick &amp; Karen Longabaugh \n7. Multi-Use Collapsible Basket Patterns: Over 100 Designs for the Scroll Saw - Rick Longabaugh, Karen Longabaugh \n8. Wooden Bowls from the Scroll Saw: 28 Useful &amp; Surprisingly Easy-to-Make Projects (Scroll Saw Woodworking &amp; Crafts Book) - Carole Rothman \n9. Box-Making Projects for the Scroll Saw: 30 Woodworking Projects That Are Surprisingly Easy to Make - Gary Mackay - Mantesh\n10. Super Simple Scroll Saw Clocks: 40 Designs You Can Make - John A. Nelson \n11. Wildlife Intarsia: A Step-by-Step Guide to Making 3-Dimensional Wooden Portraits - Judy Gale Roberts, Jerry Booher \n12. Easy-to-Make Wooden Sundials - Milton Stoneman \n13. Making Wood Trucks &amp; Construction Vehicles - Reg Martin \n14. Crafting Wooden Lamps: 24 Brilliant Weekend Projects - Ken Burton \n15. Building Wooden Machines: Gears &amp; Gadgets for the Adventurous Woodworker - 2012 - Alan Bridgewater, Gill Bridgewater \n16. The New Scroll Saw Handbook - Patrick Spielman \n17. Scroll Saw Fretwork Patterns - Patrick Spielman, James Reidle \n18. Scroll Saw Pictures: An Illustrated Guide to Creating Scroll Saw Art. over 70 Patterns (Schiffer Book for Woodworkers) - Frank Pozsgai , Douglas Congdon-Martin \n19. The Pattern Companion: Scroll Saw - Dirk Boelman , Kerry Shirts , Patrick Spielman\n20. Zodiac Puzzles for Scroll Saw Woodworking: 30 Projects from the Eastern and Western Calendars (Scroll Saw Woodworking &amp; Crafts Book) - Judy Peterson , Dave Peterson \n21. North American Wildlife Patterns for the Scroll Saw: 61 Captivating Designs for Moose, Bear, Eagles, Deer and More - Lora S. Irish \n22. Animal Portraits in Wood: Crafting 16 Artistic Mosaics with Your Scroll Saw - Neal Moore \n23. Advanced Scroll Saw Clocks: Measured Drawings for Five Antique Samples - John Nelson \n24. Holiday Ornaments for the Scroll Saw: Over 300 Beautiful Patterns from the &quot;Berry Basket Collection&quot; - Rick Longabaugh , Karen Longabaugh \n25. 50 Easy Weekend Scroll Saw Projects - John A. Nelson\n26. 3D Patterns for the Scroll Saw: Time Saving Tips and Ready-to-cut Patterns for 45 Unique Projects (Scroll Saw Project Books) - Diana Thompson \n27. Southwest Scroll Saw Patterns - Patrick Spielman , Dan Kihl \n28. Big Book Of Scroll Saw Projects and Techniques - John Nelson, Karen Longabaugh, Rick Hutcheson, Gary MacKay\n29. Scroll Saw for the first time - Dirk Boelman \n30. Fantasy &amp; Legend Scroll Saw Puzzles - Judy Peterson, Dave Peterson\n31. Seashore and Nautical Patterns for the Scroll Saw - Hofferth Williamm.\n32. Artistic Wildlife Projects for the Scroll Saw - Marilyn Carmin\n33. Compound Christmas Ornaments for the Scroll Saw: Easy-to-Make and Fun-to-Give Projects for the Holidays - Diana Thompson\n34. The Art Of The Scroll Saw: Award Winning Designs - Patrick Spielman \n35. Scroll Saw Basketweave Projects - John Nelson, William Guimond\n36. Decorative &amp; Ornamental Scroll Saw Patterns (Woodworking) - Patrick E. Spielman, Dirk Boelman\n37. Scroll Saw Country Patterns - Patrick Spielman; James Reidle\n38. Fun Easy Scroll Saw Projects - Patrick Spielman\n39. Victorian Scroll Saw Patterns - Patrick Spielman \n40. 3D Scroll Saw Patterns &amp; Techniques - Henry Berns, Henry Berro\n41. Scroll Saw Fretwork Techniques and Projects - Patrick R. Spielman, James Reidle\n42. Classic Fretwork Scroll Saw Patterns - Patrick Spielman, James Reidle\n43. Inspirational Scroll Saw Projects: Ready to Use Patterns - John A. Nelson\n44. Ornamental Scroll Saw Projects - Frank Pozsgai\n45. Making Wooden Baskets on Your Scroll Saw - John A. Nelson\n46. Folk Toys: Patterns and Projects for the Scroll Saw - Ken Folk \n47. Scroll Saw by Land, Sea and Air: 46 Ready-to-cut Patterns for Trains, Ships, Planes and Cars - Vernon Brown\n48. Marine Life Patterns for the Scroll Saw - Dale Terrain\n49. Scroll Saw Mosaics: Segmentation Techniques and Patterns for 30 Brilliant Scenes - Frank Droege\n50. Scroll Saw Toys and Vehicles: A Complete Technique and Project Pattern Manual - Stan Graves \n51. Wildlife Collector Plates for the Scroll Saw: Over 60 Patterns from The Berry Basket Collection - Rick Longabaugh, Karen Longabaugh\n52. The Wood Stash Project Book: 18 Ideas &amp; Designs - Kerry Pierce\n53. Chip Carving: Expert Techniques and 50 All-Time Favorite Projects (The Best of Woodcarving Illustrated) - Editors of Woodcarving Illustrated\n54. Scroll saw Scandinavian patterns &amp; projects - Patrick E Spielman; Gosta Dahlqvist\n55. Popular Mechanics Workshop: Scroll Saw Fundamentals: The Complete Guide - Rick Peters\n56. The Jig Saw and Band Saw - Over 75 Band, Jig Saw Opns. Desc., Illus. \n57. The Band Saw And Jig Saw - Their Use and Appln. - Walker-Turner Corp.\n58. Building Beautiful Boxes with Your Band Saw - Lois Ventura \n59. The Ultimate Band Saw Box Book - Donna LaChance Menke \n60. Sculpted Band Saw Boxes: Design, Inspiration &amp; Construction - Lois Ventura\n61. Woodburning Project &amp; Pattern Treasury Create Your Own Pyrography Art with 75 Mix-and-Match Designs",
  "parsed": {
    "xt": "urn:btih:8b4f6ad7fa8adb0b37a6b07169f437eb850964a6",
    "dn": "Skill-Building And Scroll Saw ,Carving Techniques Books  Collect",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "8b4f6ad7fa8adb0b37a6b07169f437eb850964a6",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        139,
        79,
        106,
        215,
        250,
        138,
        219,
        11,
        55,
        166,
        176,
        113,
        105,
        244,
        55,
        235,
        133,
        9,
        100,
        166
      ]
    },
    "name": "Skill-Building And Scroll Saw ,Carving Techniques Books  Collect",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 74,
  "peers": 0,
  "last_updated": "2016-12-25T07:14:30.041Z"
}