{
  "title": "The Cat Empire - Studio Discography 2002 - 2010",
  "uid": 6225010,
  "size": 558664678,
  "categoryP": "audio",
  "categoryS": "music",
  "magnet": "?xt=urn:btih:8d29190251f418f864b696629d6b61fbf29a0cac&amp;dn=The+Cat+Empire+-+Studio+Discography+2002+-+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 47,
  "leechers": 10,
  "uploader": "piratetorrent1989",
  "files": 73,
  "time": 1299482672,
  "description": "The Cat Empire are an Australian ska band from Melbourne, Australia. Currently, the Cat Empire is composed of Felix Riebl (percussion and vocals), Harry James Angus (trumpet and vocals), Ollie McGill (keyboard and backing vocals), Ryan Monro (bass and backing vocals), Will Hull-Brown (drums) and Jamshid &quot;Jumps&quot; Khadiwhala (decks, percussion). They are also commonly backed by the Empire Horns, a brass duo, and have recurring guest musicians.\n\nThey met when well-known Melbourne jazz identity Steve Sedergreen decided to form, mentor and develop a group of very talented young musicians from different schools and backgrounds. The band, called 'Jazz Cat', was a nine-piece and had its debut at the Manly Jazz Festival in Sydney in 1999. They gigged around Melbourne's jazz scene in clubs like Dizzy's (Sedergreen was a part owner of this club at this time). The Cat Empire, originally a three-piece, grew out of Jazz Cat - for a few months the two groups were performing alternate Thursdays at Dizzy's. Their sound is often described as a fusion of jazz, ska, funk and rock with heavy Latin influences. The band has toured extensively throughout Australia, the US, Canada and Europe and has released four distinct albums with the first two reaching double platinum status and the third receiving an ARIA Music Award for best world album. Their fourth album, So Many Nights, was released on 22 September 2007. Their song, &quot;Sly&quot;, was featured on EA Sports' FIFA 08 Soundtrack and has sold 3 million copies worldwide.\n\nThe band's name was taken from the title of a drawing by Felix Riebl's younger brother, Max, and its distinctive cat's eye icon, which is also known as &quot;Pablo&quot;, was created by Ian McGill, Ollie McGill's father.\n\nAlbums included:\n\n    * The Sun (2002)\n    * The Cat Empire (2003)\n    * Two Shoes (2005)\n    * Cities: The Cat Empire Project (2006)\n    * So Many Nights (2007)\n    * Cinema (2010)\n",
  "parsed": {
    "xt": "urn:btih:8d29190251f418f864b696629d6b61fbf29a0cac",
    "dn": "The Cat Empire - Studio Discography 2002 - 2010",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "8d29190251f418f864b696629d6b61fbf29a0cac",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        141,
        41,
        25,
        2,
        81,
        244,
        24,
        248,
        100,
        182,
        150,
        98,
        157,
        107,
        97,
        251,
        242,
        154,
        12,
        172
      ]
    },
    "name": "The Cat Empire - Studio Discography 2002 - 2010",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 16,
  "peers": 66,
  "last_updated": "2016-12-27T06:37:08.149Z"
}