{
  "title": "Alien Skin Exposure v7.0.1.83 Revision 26871 (Mac OSX) {B@tman}",
  "uid": 11678673,
  "size": 168277590,
  "categoryP": "applications",
  "categoryS": "mac",
  "magnet": "?xt=urn:btih:8d96c20cd7475f35584c4e09c92ed11af002bc01&amp;dn=Alien+Skin+Exposure+v7.0.1.83+Revision+26871+%28Mac+OSX%29+%7BB%40tman%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 51,
  "leechers": 2,
  "uploader": "AliPK",
  "files": 5,
  "time": 1422983102,
  "description": "Alien Skin Exposure v7.0.1.83 Revision 26871 (Mac OSX) {B@tman}\n\n\n\nDescription:-\n\nNow with non-destructive RAW editing, rapid file browsing and a slew of new film emulation presets and textures, Exposure 7 brings even more of the organic warmth and artistry of analog photography to the world of digital. Borne from more than a decade of research and input from industry-leading photographers around the globe, Exposure 7 provides you with a platform to instill your images with the subtle nuances and analog beauty of film photography. With Exposure 7, your photo will look hand-crafted, not computer-generated.\n\nAll the Creative Tools of the Film World\n\nWe explored the entire history of analog photography to bring back diverse tools, from discontinued films to dark room tricks, covering both color and black &amp; white. These techniques give you new ways to think about your art, express yourself, and stand out from people using typical digital tools.\n\nExposure's presets give you hundreds of starting points for developing complex styles. You'll find nostalgic favorites like Kodachrome and Polaroid, plus obscure ones like Panatomic-X.\n\nNuances Matter\n\nIn a single Exposure preset, many small effects work together to achieve a coherent look. For instance, realistic grain clumps together and is stronger in the midtones. The results feel real, even when the effect is not intense. Some Exposure looks are so subtle that people won't consciously realize you altered your photo.\n\nTo discover all the subtle details, our research included test shoots with films that were still available. For discontinued films we relied on photo archives and the professionals who created them. The anthropology of learning from film photographers was as important as the chemistry and math.\n\nDevelop Your Style\n\nExposure's presets are beautiful and diverse, but they are just starting points for your own unique style. If you discover a preset that sparks an idea, it's easy to mold it to fit your needs. Save your new look as a preset with a name, category, and even include notes. Later, you can apply it to a photo (or batches of photos) with a single click.\n\nThe Right Looks in a Flash\n\nChoosing your look is the focus of Exposure, so the preset browser now uses thumbnails for a more visual experience. You can quickly filter by categories like Black &amp; White or Color. Find specific looks with fast searching by name or description. In Exposure 6 you can tag your favorites so you can get back to them later. Your most recently applied effects are automatically remembered too.\n\nFocus on What's Important\n\nExposure's updated user interface lets you work with fewer distractions. The darker theme helps you focus on your image and matches other tools in a professional workflow. The new Lightroom-style collapsible panels allow you to see only the controls you care about. Tools that get out of the way provide more space for your photo.\n\nA World of Creative Textures\n\nExposure 6 has even more texture overlays that add creative details for vintage or Lo-Fi looks. You can now separately control light leaks, borders, and dust &amp; scratches. The new randomize button helps you quickly explore similar textures.\n\nHost Requirements:-\n\n- Adobe Photoshop CS6 or newer\n- Adobe Lightroom 5 or newer\n- Apple Aperture 3 or later",
  "parsed": {
    "xt": "urn:btih:8d96c20cd7475f35584c4e09c92ed11af002bc01",
    "dn": "Alien Skin Exposure v7.0.1.83 Revision 26871 (Mac OSX) {B@tman}",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "8d96c20cd7475f35584c4e09c92ed11af002bc01",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        141,
        150,
        194,
        12,
        215,
        71,
        95,
        53,
        88,
        76,
        78,
        9,
        201,
        46,
        209,
        26,
        240,
        2,
        188,
        1
      ]
    },
    "name": "Alien Skin Exposure v7.0.1.83 Revision 26871 (Mac OSX) {B@tman}",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 53,
  "peers": 33,
  "last_updated": "2016-12-25T07:29:41.068Z"
}