{
  "title": "Adobe After Effects CC 2015.3 13.8.0 (x64) Portable [SadeemPC]",
  "uid": 15539515,
  "size": 944910269,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:8e460b361f93b78e8b751f3a2514be19f2db0202&amp;dn=Adobe+After+Effects+CC+2015.3+13.8.0+%28x64%29+Portable+%5BSadeemPC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 42,
  "leechers": 4,
  "uploader": "SadeemPC",
  "files": 1,
  "time": 1470911369,
  "description": "Adobe After Effects CC 2015.3 v13.8.1 Multilingual (x64)\r\n\r\nAfter Effects CC. All new in 2015. Create incredible motion graphics and visual effects. The industry-standard motion graphics and visual effects toolset now brings you better ways to work, connecting your desktop and mobile apps with all your creative assets, so you can create your most stunning visuals yet.\r\n\r\nWhat's new in Adobe After Effects CC 2015.3:\r\nEnhanced video and audio playback:\r\nAfter Effects CC 2015.3 (13.8) uses a new playback architecture to deliver real-time playback of cached frames with synced audio. The new architecture is shared with other Adobe applications, like Premiere Pro and Audition.\r\n\r\nEffect rendering on the GPU:\r\nThe Lumetri Color, Gaussian Blur, and Sharpen effects can now render using your computerâ™s GPU. This improves rendering performance for these effects by 2x-4x over rendering using only the CPU (depending on the frame being rendered and the speed of your GPU). GPU effect rendering is controlled via the new Video Rendering and Effects option in the Project Settings dialog.\r\n\r\nPerformance improvements:\r\nMany small changes under the hood include faster import and caching of image sequences, asynchronous drawing of viewer panels, faster opening of large projects, improved expression caching, and more.\r\n\r\nAdditional native format support:\r\nApple ProRes QuickTime files can be decoded on Windows without needing QuickTime installed on the system. RED camera raw file decoding now supports RED Scarlet-W, Raven, and Weapon cameras, including 8K .r3d footage.\r\n\r\nLumetri Color effect improvements:\r\nThe Lumetri Color effect can now render using your computerâ™s GPU, and includes new HSL Secondary controls and new SpeedLooks presets.\r\n\r\nGaussian Blur effect improvements:\r\nThe Gaussian Blur effect has been updated to a new version. The Repeat Edge Pixels option from the Fast Blur effect has been added, and the effect can now render using your computerâ™s GPU. This version of Gaussian Blur replaces both the previous Gaussian Blur (Legacy) effect and the Fast Blur effect, which are still available but have been moved to the Obsolete category.\r\n\r\nAdd compositions to Adobe Media Encoder with render settings:\r\nYou can now send compositions from the Render Queue to the Adobe Media Encoder queue with the options you choose in the Render Settings dialog. When you click the new Queue in AME button in the Render Queue panel, queued render items are added to Adobe Media Encoder. Compositions will be rendered by Adobe Media Encoder with the render settings you chose in After Effects.\r\n\r\nIn a portable Assembly is Adobe Character Animator 1.0.4 with English interface.\r\nInterface languages: English, Spanish, Italian, German, Russian, French.\r\n\r\nWhat's New ? \nhttps://helpx.adobe.com/after-effects/using/whats-new.html",
  "parsed": {
    "xt": "urn:btih:8e460b361f93b78e8b751f3a2514be19f2db0202",
    "dn": "Adobe After Effects CC 2015.3 13.8.0 (x64) Portable [SadeemPC]",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "8e460b361f93b78e8b751f3a2514be19f2db0202",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        142,
        70,
        11,
        54,
        31,
        147,
        183,
        142,
        139,
        117,
        31,
        58,
        37,
        20,
        190,
        25,
        242,
        219,
        2,
        2
      ]
    },
    "name": "Adobe After Effects CC 2015.3 13.8.0 (x64) Portable [SadeemPC]",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 90,
  "peers": 162,
  "last_updated": "2016-12-27T06:43:59.426Z"
}