{"title":"Avadon 3: The Warborn (GOG)","uid":15828540,"size":189980872,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8e597e986fe63e2ec92ed8892a2a611fdda59c92&amp;dn=Avadon+3%3A+The+Warborn+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":36,"leechers":0,"uploader":"dauphong","files":4,"time":1473886886,"description":"\nAbout This Game\r\nAvadon 3: The Warborn is a huge, old-school, indie fantasy role-playing adventure, the conclusion of the epic Avadon trilogy. You are a Hand of Avadon, warrior and spy, judge and executioner, with nearly unlimited power to fight the enemies of your homeland. Your word is Law. However, your lands have been invaded. Barbarians and monsters are rampaging through your home, and you are the only one who has a way to stop them.\r\n\r\nAvadon 3: The Warborn is an epic, retro adventure in an enormous and unique world. Choose from five different character classes, each with dozens of unique spells and abilities. Explore cunning dungeons, hunt for hundreds of magical artifacts, and pass judgment on your enemies (or just people you don’t like). Avadon 3 features many different endings. Will you save your people or betray them? Follow orders or claw for more power? We leave those decisions for you.\r\nKey Features:\r\n\r\n    Epic fantasy role-playing adventure in an enormous and unique world.\r\n    Many different endings. Will you be loyal to your leaders or switch sides and bring them down? The choice is yours!\r\n    Five different character classes, with dozens of unique spells and abilities.\r\n    Experience an exciting story, with fascinating characters, tough decisions, and many twists and turns.\r\n    Dozens of side quests, dungeons, and secrets to discover.\r\n    Hundreds of magical items to find. Use powerful crystals to make your artifacts even more powerful.\r\n    Huge adventure with lots of replay value. Experience with earlier games is entirely unnecessary to enjoy Avadon 3.\r\n\r\nSystem Requirements\r\nWindows\r\nMac OS X\r\n\r\n    Minimum:\r\n        OS: Vista\r\n        Processor: 800 MhZ processor\r\n        Memory: 512 MB RAM\r\n        Graphics: OpenGL-compatible\r\n        Storage: 500 MB available space","torrent":{"xt":"urn:btih:8e597e986fe63e2ec92ed8892a2a611fdda59c92","amp;dn":"Avadon+3%3A+The+Warborn+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e597e986fe63e2ec92ed8892a2a611fdda59c92","infoHashBuffer":{"type":"Buffer","data":[142,89,126,152,111,230,62,46,201,46,216,137,42,42,97,31,221,165,156,146]},"announce":[],"urlList":[]}}