{"title":"HunieCam Studio v1.0.2 [Closed]","uid":14220490,"size":103521043,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8ecb777abadc360285d8368f3f146d27dfed38c5&amp;dn=HunieCam+Studio+v1.0.2+%5BClosed%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":41,"leechers":1,"uploader":"F95","files":1,"time":1460037671,"description":"Courtesy Warning: The sexual themes in this game are mostly for fun/humor and don't make for particularly great fapping material. \r\n\r\nIn HunieCam Studio players take control of a sleazy cam girl operation. Rake in stacks of filthy internet money and attract as many disgusting fans as you can in this fast paced, click happy and thoroughly perverted take on the business tycoon / management sim genre!\r\n\r\nRecruit cam models from an eclectic cast of cuties who have probably made some poor life choices. Manage your girls' daily errands/activities to keep them stress-free and productive. Invest in various aspects of your business to improve functions and expand operations. Optimize your cam shows by promoting girls who match popular trends/fetishes. Abandon your morals and disappoint everybody who cares about you! \r\nFeatures:\r\n\r\n-Up to 18 unique cam girls covering a wide variety of perverse preferences! \r\n-Send your models to the strip club to increase their talent, the photo studio for more exposure, the day spa to relax a bit, etc... \r\n-Analyze important stats on your fans and performers to maximize revenue! \r\n-Purchase sex toys and other kinky accessories to aid the girls' performances and boost viewership! \r\n-Promote your studio on other adult sites and fetish communities all over the web! \r\n-Contract up to six horrific STDs including chlamydia, syphilis and gonorrhea! \r\n-A massive wardrobe of over 140 hot new outfits and hairstyles to unlock! \r\n-Grow to become a hugely popular cam site and earn some DOPE ass dick trophies!\r\n\r\n\r\n\r\nChangelog:\r\n\r\nRock Hard Mode (v1.0.2)\r\n\r\nI noticed that some of you guys are very good at the game and earned the diamond trophy on your 2nd or 3rd time through. So, I just pushed an update adding a new hard mode. As long as you have earned the gold trophy or better you can start a new game file in &quot;Rock Hard Mode&quot; and that difficulty should be more suitable to your skill level. \r\n\r\nI also made a few minor balance tweaks to the normal difficulty and spread out the amount of tokens you earn so you get more for playing in hard mode.\r\n\r\n\r\n\r\nInstructions:\r\n1- Extract to desired location.\r\n2- Click on HunieCamStudio.exe to start playing.\r\n\r\nSystem Requirements\r\nMINIMUM: \r\nOS: Windows XP (SP2)+ \r\nProcessor: 1.2 GHz \r\nMemory: 2 GB RAM \r\nGraphics: DirectX® 9 Compatible Graphics Card \r\nDirectX: Version 9.0a \r\nStorage: 1 GB available space","torrent":{"xt":"urn:btih:8ecb777abadc360285d8368f3f146d27dfed38c5","amp;dn":"HunieCam+Studio+v1.0.2+%5BClosed%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ecb777abadc360285d8368f3f146d27dfed38c5","infoHashBuffer":{"type":"Buffer","data":[142,203,119,122,186,220,54,2,133,216,54,143,63,20,109,39,223,237,56,197]},"announce":[],"urlList":[]}}