{"title":"Symantec Endpoint Protection Win64 12.1.4 (English) ","uid":9685531,"size":306268384,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8f413a4675fdd16eca86e5503e0bc1f414fd73ff&amp;dn=Symantec+Endpoint+Protection+Win64+12.1.4+%28English%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":47,"leechers":0,"uploader":"NickeNyfiken66","files":-1,"time":1393758853,"description":"&gt;&gt;&gt; NickeNyfiken66 &lt;&lt;&lt;\n\nP  R  E  S  E  N  T  S\n\n\nSymantec Endpoint Protection Win64 12.1.4 (English) \n\n\n\nSymantec Endpoint Protection\nIt's time to move beyond antivirus with layered protection at the endpoint. Symantec Endpoint Protection 12.1.4 brings unrivaled security and blazing performance across physical and virtual systems and is equipped to protect the latest operating systems achieving maximum performance and advanced protection.\n\n\nSymantec Insight technology reduces antivirus scans while SONAR stops cyber-criminals and zero-day attacks. Only Symantec Endpoint Protection 12.1.4 provides the security you need through a single, high-powered agent, for the fastest, most-effective protection available.\n\n\n\nNew Features\n\nSupport for the latest operating system Effectively protects your Mac OS X 10.9 (Mavericks) and Windows 8.1.\n\n\nIPS &amp; AV layered protection for Mac Provides unrivaled security with a single, high-powered agent that integrates both IPS and antivirus for Mac users.\n\n\nFast Path feature Allows you to identify critical events almost in real-time to create the fastest, most effective solution available.\nSeamless console experience Eliminates confusion between Mac and Windows.\n\n\nKey Features\n\nUnrivaled Security. Blazing Performance. Built for Virtual Environments.\nSymantec Endpoint Protection is built on multiple layers of protection, including Symantec Insight and SONAR both of which provide protection against new and unknown threats. \n\nBuilt for virtual environments, it can integrate with VMware vShield Endpoint for dramatically improved performance. Symantec Endpoint Protection 12.1.4 includes the latest features for improved security, performance and management.\n\n","torrent":{"xt":"urn:btih:8f413a4675fdd16eca86e5503e0bc1f414fd73ff","amp;dn":"Symantec+Endpoint+Protection+Win64+12.1.4+%28English%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f413a4675fdd16eca86e5503e0bc1f414fd73ff","infoHashBuffer":{"type":"Buffer","data":[143,65,58,70,117,253,209,110,202,134,229,80,62,11,193,244,20,253,115,255]},"announce":[],"urlList":[]}}