{
  "title": "WinRAR x64 (64 bit) v5.20 + KeyReg [ChattChitto RG]",
  "uid": 11676945,
  "size": 7362505,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:908f1ae9075c16f78c7f477e4a5f7d1f53586a4f&amp;dn=WinRAR+x64+%2864+bit%29+v5.20+%2B+KeyReg+%5BChattChitto+RG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 53,
  "leechers": 1,
  "uploader": "ChattChitto",
  "files": 3,
  "time": 1422909976,
  "description": "WinRAR x64 (64 bit) v5.20 + KeyReg\n\n.exe File Format (Setup File - KeyReg - Instructions)\n\n***********************************************************************************\n\nWinRAR x64 (64 bit) v5.20\n\nHomePage: http://www.rarlab.com/rar_archiver.htm\n\n\nWinRAR The WinRAR application was developed to be a powerful compression tool with many integrated additional functions to help you organize your compressed archives.\nWinRAR puts you ahead of the crowd when it comes to compression. By consistently creating smaller archives, WinRAR is often faster than the competition. This will save you disc space, transmission costs AND valuable working time as well.\nWinRAR supports all popular compression formats (RAR, ZIP, CAB, ARJ, LZH, ACE, TAR, GZip, UUE, ISO, BZIP2, Z and 7-Zip).\nWinRAR is ideal for multimedia files. WinRAR automatically recognizes and selects the best compression method. The special compression algorithm compresses multimedia files, executables and object libraries particularly well.\nWinRAR allows you to split archives into separate volumes easily, making it possible to save them on several disks for example.\nWinRAR is also ideal, if you are sending data through the web. Its 128 bit password encryption and its authenticated signature technology will give you the peace of mind you have been looking for.\n\n\nFeatures:\n==========\n-WinRAR introduces an original compression algorithm. It provides high compression ratios on executable files, object libraries, large text files, etc.\n-WinRAR offers an optional compression algorithm highly optimized for multimedia data.\n-WinRAR supports files and archives up to 9,223,372,036,854,775,807 bytes in size, about 9000PB. The number of archived files is unlimited for all practical purposes.\n-WinRAR provides complete support for RAR and ZIP 2.0 archives and is able to unpack CAB, ARJ, LZH, TAR, GZ, ACE, UUE, BZ2, JAR, ISO, Z, 7Z archives.\n-WinRAR supports NTFS file security and data streams.\n-WinRAR offers both a classic interactive Windows interface and the command line interface.\n-WinRAR provides functionality for creating a 'solid' archive, which can raise the compression ratio by 10% - 50% over more common methods, particularly when packing large numbers of small files.\n-WinRAR offers the ability to create and change SFX archives using default and external SFX modules.\n-WinRAR offers the ability to create a multi-volume archive as SFX.\n-WinRAR offers a number of service functions, such as setting a password, adding archive and file comments. Even physically damaged archives may be repaired and an archive may be locked to prevent further changes.\n\n***********************************************************************************\n\n\nTested And Working...\nScanned (With Kaspersky) And 100% Clean.\n\n(If You Found Something &quot;Un-Clean&quot; In Any Of My Torrents, Consider That It May Be A False Positive(Alert) And If you Are Sure Please Report It To Me So I Would Remove It)\n\n[Please Leave A Comment Confirming This Pack]",
  "parsed": {
    "xt": "urn:btih:908f1ae9075c16f78c7f477e4a5f7d1f53586a4f",
    "dn": "WinRAR x64 (64 bit) v5.20   KeyReg [ChattChitto RG]",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "908f1ae9075c16f78c7f477e4a5f7d1f53586a4f",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        144,
        143,
        26,
        233,
        7,
        92,
        22,
        247,
        140,
        127,
        71,
        126,
        74,
        95,
        125,
        31,
        83,
        88,
        106,
        79
      ]
    },
    "name": "WinRAR x64 (64 bit) v5.20   KeyReg [ChattChitto RG]",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 54,
  "peers": 7,
  "last_updated": "2016-12-25T07:48:30.621Z"
}