{
  "title": "Watch.Dogs.Repack-R.G.Mechanics",
  "uid": 10617666,
  "size": 14683682990,
  "categoryP": "games",
  "categoryS": "pc",
  "magnet": "?xt=urn:btih:90ba09064f25c6efeaad5c90668a43f31666958e&amp;dn=Watch.Dogs.Repack-R.G.Mechanics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 940,
  "leechers": 240,
  "uploader": "Taker009",
  "files": -1,
  "time": 1406141240,
  "description": "Watch.Dogs.Repack-R.G.Mechanics\n\n\n\n\n\nRelease Info:\n\nYear: 2014\nGenre: Action (Shooter) / 3D / 3rd Person / Stealth\nDeveloper: Ubisoft\nPublisher: Ubisoft\nPublication Type: RePack\nGame Language: Eng |Rus\nVoiceLanguage: Eng |Rus\nCrack: RELOADED\n\n\n\nSystem Requirements:\n\nOperating System: Windows Vista (SP2), Windows 7 (SP1) or Windows 8 (Please note that we only support 64 bit OSs.)\nProcessor: Intel Core 2 Quad Q8400 @ 2.66Ghz or AMD Phenom II X4 940 @ 3.0Ghz\nMemory: 6 GB\nVideo: 1GB compatible with DirectX 11 (Nvidia Geforce GTX 460 or AMD Radeon HD 5770)\nSound Card: Sound device compatible with DirectXÂ® 9.0\nFree space on hard disk: 14 GB\n\nGame information:\n\nAll related to each other. We depend on high-tech novelties of\nthe market, because only through them know what's going on in\nthe world. But progress has a dark side. Our every action leaves\na trace: every step we take, every stop, all that we like or dislike.\nAnd it's not just us. Megacities are enmeshed in digital networks.\nUrban infrastructure is controlled and operated by a complex system.\nIn Watch_DogsChikago submits Central Operating System (ctOS),\nnamely it contains information on all residents. And anyone who\ngets access to it, will gain control over the city.\nAiden Pierce - a prominent hacker with a criminal record,\nwhose actions have caused the tragedy. To avenge his family,\nhe goes on the warpath - and you with it. Aiden is able to hack\nand use everything that is connected to the city information\nnetwork - all that surrounds it. Access to security cameras,\nloading personal data, tracking the location of people,\nmanagement of traffic lights and public transport ...\nChicago itself becomes your weapon.\nYou just need to learn how to use it.\n\nGame Features:\n\nHacked CITY\n\nWatch_Dogs events occur in carefully recreated Chicago,\nwhose life can be controlled by a conventional smartphone.\nSwitch the lights to the pursuers were stuck in a traffic jam.\nHold the departing train and jump into it to break away from the\nchase. Spread the bridges to close the door. In a city where\neverything is connected, Central Operating System will be your assistant.\n\nSTREET JUSTICE\n\nChicago has its own laws. Here respond to violence with violence,\nand you have enough strength and skill to adopt rules. Melee and\nshooting real as ever - realistic physics game will give odds to\nmany representatives of the genre. Mix and match the shooting\nand hacking to gain an advantage in any situation. Local streets\nare designed so that you can implement your own plan of attack.\nIn the top picture you'll have a more than 30 types of weapons.\n\nRACE at high speed\n\nIn this paper, the game participated studio Ubisoft Reflection -\ncreators of the series Driver. Move to Chicago can be behind the\nwheel of over 65 different vehicles. Each of them is carefully\nmodeled and behaves on the road most authentic.\n\nEverything is under control\n\nAt the heart of Watch_Dogs is a brand new, specially developed\ntechnology. You will enjoy incredible graphics and authentic\nrealism, your actions will affect the course of history and\nhuman life, and the consequences of decisions will diverge\nin a virtual world like ripples in the water.\n\nFREEDOM OF MOVEMENT\n\nIn Watch_Dogs you can not only use the city's operating system\nfor their own benefit, but also for yourself the street.\nCut the way through the building or climb on\nthe roof to hunt down the target.\n\n&quot;Seamless&quot; MULTIPLAYER\n\nNew level of interaction, cooperation and confrontation is\nachieved thanks to a new system of organization of the\nmultiplayer that combines single-player and multiplayer\ngame together. No menus, no loading screens - only\nsituational multiplayer shooter in an open world.\n\nKeep in touch and play ANEW\n\nTreat yourself to an unforgettable experience with a helper\napplication that extends the capabilities of the console.\nThe innovative mobile platform will allow you to stay in\ntouch with friends, even outside the home. Watch_Dogs helper\napplication gives you access to the possibility of using a\ndual screen that allows you to play anytime, anywhere.\n\n\n\nRepack Features:\n\nWatch_Dogs\nIncludes Update v1.03.471\nDo not cut / recoded\nAbility to select a combination of text and voice\nAbility to download only the necessary voiceovers\n\nAdditions:\n\nThe Palace Pack\nSignature Shot Pack\nBreakthrough Pack\nExclusive Missions\nUntouchables Pack\nCyberpunk Pack\nDedsec Shadow Pack\nBlume Agent Pack\nClub Justive Pack\nR-33B gun\nMP-412 gun",
  "parsed": {
    "xt": "urn:btih:90ba09064f25c6efeaad5c90668a43f31666958e",
    "dn": "Watch.Dogs.Repack-R.G.Mechanics",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "90ba09064f25c6efeaad5c90668a43f31666958e",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        144,
        186,
        9,
        6,
        79,
        37,
        198,
        239,
        234,
        173,
        92,
        144,
        102,
        138,
        67,
        243,
        22,
        102,
        149,
        142
      ]
    },
    "name": "Watch.Dogs.Repack-R.G.Mechanics",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 1180,
  "peers": 152,
  "last_updated": "2016-12-25T07:49:50.834Z"
}