{
  "title": "Gil Scott-Heron &amp; Jamie xx - We're New Here (2011) 320",
  "uid": 6297193,
  "size": 89581510,
  "categoryP": "audio",
  "categoryS": "music",
  "magnet": "?xt=urn:btih:918e666288b56573c5bc19b70188672ffc1ab10a&amp;dn=Gil+Scott-Heron+%26+Jamie+xx+-+We%5C%27re+New+Here+%282011%29+320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 61,
  "leechers": 1,
  "uploader": "vtwin88cube",
  "files": -1,
  "time": 1302037834,
  "description": "Gil Scott-Heron &amp; Jamie xx\nWe're New Here (2011)\n\n\n\nGil Scott-Heron--\n\nOne of the most important progenitors of rap music, Gil Scott-Heron's aggressive, no-nonsense street poetry inspired a legion of intelligent rappers while his engaging songwriting skills placed him square in the R&amp;B charts later in his career, backed by increasingly contemporary production courtesy of Malcolm Cecil and Nile Rodgers (of Chic). Born in Chicago but transplanted to Tennessee for his early years, Scott-Heron spent most of his high-school years in the Bronx, where he learned firsthand many of the experiences that later made up his songwriting material. He had begun writing before reaching his teenage years, however, and completed his first volume of poetry at the age of 13. Though he attended college in Pennsylvania, he dropped out after one year to concentrate on his writing career and earned plaudits for his novel, The Vulture. Encouraged at the end of the '60s to begin recording by legendary jazz producer Bob Thiele -- who had worked with every major jazz great from Louis Armstrong to John Coltrane -- Scott-Heron released his 1970 debut, Small Talk at 125th and Lenox, inspired by a volume of poetry of the same name. With Thiele's Flying Dutchman Records until the mid-'70s, he signed to Arista soon after and found success on the R&amp;B charts. Though his jazz-based work of the early '70s was tempered by a slicker disco-inspired production, Scott-Heron's message was as clear as ever on the Top 30 single &quot;Johannesburg&quot; and the number 15 hit &quot;Angel Dust.&quot; Silent for almost a decade, after the release of his 1984 single &quot;Re-Ron,&quot; the proto-rapper returned to recording in the mid-'90s with a message for the gangsta rappers who had come in his wake; Scott-Heron's 1994 album Spirits began with &quot;Message to the Messengers,&quot; pointed squarely at the rappers whose influence -- positive or negative -- meant much to the children of the 1990s.\n\n\nJamie xx--\n\nJamie xx is the bashful beatmaker of lo-fi Mercury Music Prize winners the xx, who carved out a name for himself outside the band thanks to a host of critically acclaimed post-garage/dubstep remixes. Born Jamie Smith in Putney, London, he began his musical career playing the drums, but after realizing he couldn't use his innovation skills on the instrument, he instead turned to the '80s Media Production Centre, which programmed his computer-based sounds onto electronic percussion pads, allowing him to play both live and in the studio. In 2008, he teamed up with former school friends Oliver Sims, Romy Madley Croft, and Baria Qureshi to form the xx, who signed to XL subsidiary Young Turks a year later, and went on to record one of the most well-received albums of the decade with their self-titled debut. As well as reworking his own band's tracks, he also became a sought-after remixer for a number of pop artists including Adele, Jack PeÃƒÂ±ate, and Florence + the Machine. His atmospheric version of the latter's &quot;You've Got the Love&quot; sparked the interest of XL boss Richard Russell, who asked him to remix rap pioneer Gil Scott-Heron's most recent album, I'm New Here, which was retitled We're New Here on its release. Smith also released a solo single, &quot;Far Nearer,&quot; performed a series of DJ sets across Europe, and worked with Drake on his new album, Take Care, while the rest of the xx took a break at the end of 2010. \n\n\nChannels:\t\t2 (Stereo)\nSample Rate:\t\t44.1 KHz\nSample Size:\t\t16 bit\nBit Rate:\t\t320 kbps\n\nAudio Quality:\t\tVery High (Lossy)\nEncoder Settings:\tConstant Bit Rate 320 kbps (Insane)\nContains:\t\tAlbum Art, ID Tag [ID3v2.3 (ANSI) &amp; ID3v1.1]\nM3U Playlist:\t\tYes\n\nFormat:\t\t\tMp3\nGenre:\t\t\tElectronic\t\t\nLabel:\t\t\tXL Recordings\n\nTrack List:\n\n\n01.I'm New Here\n02.Home\n03.I've Been Me (Interlude)\n04.Running\n05.My Cloud\n06.Certain Things (Interlude)\n07.The Crutch\n08.Ur Soul And Mine\n09.Parents (Interlude)\n10.Piano Player\n11.NY Is Killing Me\n12.Jazz (Interlude)\n13.I'll Take Care Of You\n\n\n\n\n\n\n            ****Support the artists &amp; buy it if you like it.****\n\n                \n\n               ****Enjoy &amp; please don't forget to seed!****\n\n\n\n\n\n",
  "parsed": {
    "xt": "urn:btih:918e666288b56573c5bc19b70188672ffc1ab10a",
    "dn": "Gil Scott-Heron & Jamie xx - We\\'re New Here (2011) 320",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "918e666288b56573c5bc19b70188672ffc1ab10a",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        145,
        142,
        102,
        98,
        136,
        181,
        101,
        115,
        197,
        188,
        25,
        183,
        1,
        136,
        103,
        47,
        252,
        26,
        177,
        10
      ]
    },
    "name": "Gil Scott-Heron & Jamie xx - We\\'re New Here (2011) 320",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 62,
  "peers": 17,
  "last_updated": "2016-12-25T07:55:25.806Z"
}