{"title":"Friedrich Nietzsche - Philosophical Works (28 books)","uid":9386147,"size":138138030,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:91a856cd6dc84a066aac469fe464ebb03b44db5d&amp;dn=Friedrich+Nietzsche+-+Philosophical+Works+%2828+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":42,"leechers":2,"uploader":"workerbee","files":-1,"time":1387759923,"description":"\nFRIEDRICH NIETZSCHE (1844-1900) was a German philologist, philosopher, cultural critic, poet and composer.  He is one of the most influential of all modern thinkers, inspiring leading figures in all walks of cultural life, including dancers, poets, novelists, painters, psychologists, philosophers, sociologists and social revolutionaries.\n\nEvery major work is featured in this collection, many in multiple translations and in modern critical editions, as well as several important anthologies.  I have excluded older translations, notably Oscar Levy's edition of Nietzsche's works (1909-1913) which has long since been superceded and is easily available at the Internet Archive and elsewhere for the few that may still be interested.\n\nAll the books, many of which are posted here for the first time, feature contents in bookmarks, accurate pagination, and cover art.  Some older scans have been cleaned up and rendered significantly more user-friendly.\n\nI hope you enjoy this collection as much as I enjoyed compiling and editing it.  I hope to update it as new materials become available.\n\n\nMost of the following books are PDFs, although there are 9 in EPUB format and indicated as such:\n\n* THE ANTI-CHRIST, ECCE HOMO, TWILIGHT OF THE IDOLS &amp; OTHER WRITINGS (Cambridge University Press,  2005).  Translated by Judith Norman.\n\n* THE BASIC WRITINGS OF NIETZSCHE (Modern Library, 2000).  Translated and edited by Walter Kaufmann, with an Introduction by Peter Gay. -- EPUB\n\n* BEYOND GOOD AND EVIL (Oxford World's Classics, 1998).  Translated and edited by Marion Faber. -- EPUB\n\n* BEYOND GOOD AND EVIL (Penguin Classics, 2003).  Translated by R.J. Hollingdale with an Introduction by Michael Tanner. -- EPUB\n\n* BEYOND GOOD AND EVIL (Cambridge University Press, 2002).  Translated by Rolf-Peter Horstmann and Judith Norman.\n\n* BEYOND GOOD AND EVIL (Vintage, 1966).  Translated with commentary by Walter Kaufmann.\n\n* THE BIRTH OF TRAGEDY (Oxford World's Classics, 2000).  Translated with an Introduction and Notes by Douglas Smith. -- EPUB\n\n* THE BIRTH OF TRAGEDY &amp; OTHER WRITINGS (Cambridge University Press, 1999).  Edited by Raymond Geuss and Ronald Speirs; translated by Ronald Speirs.\n\n* DAYBREAK: Thoughts on the Prejudices of Morality (Cambridge University Press, 1997).  Edited by Maudemarie Clark and Brian Leiter; translated by R. J. Hollingdale.\n\n* ECCE HOMO (Penguin Classics, 1992).  Translated by R. J. Hollingdale. -- EPUB\n\n* ECCE HOMO (Oxford World's Classics, 2007).  Translated with an Introduction and Notes by Duncan Large.\n\n* THE GAY SCIENCE (Vintage, 1974).  Translated with commentary by Walter Kaufmann.\n\n* THE GAY SCIENCE (Cambridge University Press, 2001).  Edited by Bernard Williams; translated by Josefine Nauckhoff and Adrian Del Caro. -- PDF + EPUB\n\n* HUMAN, ALL TOO HUMAN (Cambridge University Press, 1996).  Translated by R. J. Hollingdale, with an Introduction by Richard Schacht.\n\n* A NIETZSCHE READER (Penguin, 2003).  Edited and translated by R. J. Hollingdale. -- EPUB\n\n* THE NIETZSCHE READER (Blackwell, 2006).  Edited by Keith Ansell-Pearson and Duncan Large.\n\n* ON THE ADVANTAGE AND DISADVANTAGE OF HISTORY FOR LIFE (Hackett, 1980).  Translated by Peter Preuss.\n\n* ON THE GENEALOGY OF MORALITY (Cambridge University Press, 2006).  Edited by Keith Ansell-Pearson; translated by Carol Diethe.\n\n* ON THE GENEALOGY OF MORALS (Richer Resources, 2009).  Translated by Ian Johnston.\n\n* ON THE GENEALOGY OF MORALS &amp; ECCE HOMO (Vintage, 1967).  Translated and edited with commentary by Walter Kaufmann.\n\n* PHILOSOPHY IN THE TRAGIC AGE OF THE GREEKS (Regnery, 1962).  Translated by Marianne Cowan.\n\n* THE PORTABLE NIETZSCHE (Penguin, 1976).  Selected and translated by Walter Kaufmann. -- EPUB\n\n* THUS SPOKE ZARATHUSTRA (Cambridge University Press, 2006).  Edited by Adrian Del Caro and Robert B. Pippin; translated by Adrian Del Caro.\n\n* THUS SPOKE ZARATHUSTRA (Penguin, 1978).  Translated with a Preface by Walter Kaufmann.\n\n* THUS SPOKE ZARATHUSTRA (Oxford World's Classics, 2005).  Translated with an Introduction and Notes by Graham Parkes. -- EPUB\n\n* UNTIMELY MEDITATIONS (Cambridge University Press, 1997).  Edited by Daniel Breazeale; translated by R. J. Hollingdale.\n\n* THE WILL TO POWER (Random House, 1967).  Translated by Walter Kaufmann and R. J. Hollingdale.\n\n* WRITINGS FROM THE LATE NOTEBOOKS (Cambridge University Press, 2003).  Edited by Rudiger Bittner; translated by Kate Sturge.\n\n====================\n\nAdditional Notes: For an PDF of Kaufmann's PORTABLE NIETZSCHE collection, see:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/7881592/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/7881592/&lt;/a&gt;\n\nAnd for those who may be unaware that Nietzsche was also an amateur composer, an interesting 2-CD anthology of his music can be found here:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/7046877/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/7046877/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:91a856cd6dc84a066aac469fe464ebb03b44db5d","amp;dn":"Friedrich+Nietzsche+-+Philosophical+Works+%2828+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91a856cd6dc84a066aac469fe464ebb03b44db5d","infoHashBuffer":{"type":"Buffer","data":[145,168,86,205,109,200,74,6,106,172,70,159,228,100,235,176,59,68,219,93]},"announce":[],"urlList":[]}}