{
  "title": "Business Model Generation by Osterwalder and Pigneur  2010 [Qwer",
  "uid": 7948164,
  "size": 37288938,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:92481a1bf97348da8e2d9ea4b455fc6ab75ce211&amp;dn=Business+Model+Generation+by+Osterwalder+and+Pigneur++2010+%5BQwer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 53,
  "leechers": 2,
  "uploader": "KatQwerty",
  "files": 3,
  "time": 1356189973,
  "description": "Business Model Generation is a handbook for visionaries, game changers, and challengers striving to defy outmoded business models and design tomorrow's enterprises. If your organization needs to adapt to harsh new realities, but you don't yet have a strategy that will get you out in front of your competitors, you need Business Model Generation.\n \n \nCo-created by 470 &quot;Business Model Canvas&quot; practitioners from 45 countries, the book features a beautiful, highly visual, 4-color design that takes powerful strategic ideas and tools, and makes them easy to implement in your organization. It explains the most common Business Model patterns, based on concepts from leading business thinkers, and helps you reinterpret them for your own context. You will learn how to systematically understand, design, and implement a game-changing business model--or analyze and renovate an old one. Along the way, you'll understand at a much deeper level your customers, distribution channels, partners, revenue streams, costs, and your core value proposition.\n \n \nBusiness Model Generation features practical innovation techniques used today by leading consultants and companies worldwide, including 3M, Ericsson, Capgemini, Deloitte, and others. Designed for doers, it is for those ready to abandon outmoded thinking and embrace new models of value creation: for executives, consultants, entrepreneurs, and leaders of all organizations. If you're ready to change the rules, you belong to &quot;the business model generation!&quot;\n ",
  "parsed": {
    "xt": "urn:btih:92481a1bf97348da8e2d9ea4b455fc6ab75ce211",
    "dn": "Business Model Generation by Osterwalder and Pigneur  2010 [Qwer",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "92481a1bf97348da8e2d9ea4b455fc6ab75ce211",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        146,
        72,
        26,
        27,
        249,
        115,
        72,
        218,
        142,
        45,
        158,
        164,
        180,
        85,
        252,
        106,
        183,
        92,
        226,
        17
      ]
    },
    "name": "Business Model Generation by Osterwalder and Pigneur  2010 [Qwer",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 55,
  "peers": 0,
  "last_updated": "2016-12-25T07:59:42.532Z"
}