{
  "title": "Wondershare Filmora 6.8.2.0 Multilingual + Keys [4realtorrentz]",
  "uid": 13195964,
  "size": 111308016,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:96560e40ab831fb3a1a9eca8b94347b42b0f46b8&amp;dn=Wondershare+Filmora+6.8.2.0+Multilingual+%2B+Keys+%5B4realtorrentz%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 353,
  "leechers": 1,
  "uploader": "menin1",
  "files": 1,
  "time": 1452480348,
  "description": "Wondershare Filmora 6.8.2.0 Multilingual + Keys [4realtorrentz]\r\n\r\n\r\nWondershare Filmora, an easy-to-use video editor with all the video editing tools you need, enables you to create Hollywood-like home movies with titles, effects and transitions from all regular videos, audio and photos. Share instantly with family and friends with easy upload to YouTube,etc. Save videos to play on portable devices like iPhone, iPad, iPod, etc. or burn DVD for better video preservation. No matter its a wedding video, love movie, travel story, life documentary or party record, it is just so easy to turn it to a treasured home video and share it with everyone!\r\n\r\nEdit and Enhance Your Media Files\r\nEasily make perfect movies using your video clips (SD, HD, camcorder, records), audio and photos. See tech spec. for all supported formats.\r\nEdit and personalize videos/photos/audio with features like split, crop, trim, rotate, set fade in &amp; fade out, adjust duration, etc.\r\nTune all up with Contrast, Saturation, Brightness and Hue tools.\r\nOne click to record videos and voiceovers with a webcam and microphone.\r\nSpeed up, Slow down and voice change effects make audio/video editing fun.\r\nManage all your media sources including videos (also webcam), audio, images and color slides.\r\n\r\nEdit and Enhance Your Media Files\r\nTake your movie to the next level instantly with 50+ ready-to-use filter effects.\r\nAdd transitions between clips and apply motion effects to photos to bring still images to life.\r\nEasily achieve picture-in-picture (image/video overlay) tracks and customize with motion, effects and mask. New\r\nAdd stylish captions on your videos and photos with customizable font, color, etc. for better video meaning conveying.\r\nDrag and drop Intro/Credit clips for a great film.\r\n\r\nShare Your Videos with Family and Friends in a Snap\r\nDEVICES: Get optimized videos for playback on your portable devices like iPhone, iPad, PSP, iPod, Wii, Zune, etc.\r\nFORMATS: Save edited videos to local hard drive for further use in a variety of video formats.\r\nONLINE: Directly upload your video creation to YouTube, and share with more people onand Twitter.\r\nTV: Burn videos to DVD discs to play with DVD player or save as DVD folder or ISO image files to preserve videos in a better way.\r\n\r\nWhat's New:\r\n\r\n- New UI for rebranding\r\n- Smart thumbnail previews\r\n- New effects and categories\r\n- Adds the ability to archive project file for transferring between PCs and avoid media file missing;\r\n- Adds the ability to relocate missing media in saved project, resolved the issue of project unable to save in some cases;\r\n- Adds the ability to import Media directly from AVCHD camcorder and Mobile phone(iOS, Android)\r\n- Timeline UX optimization for resolving the too easy to cut clip into two parts when move clips on Timeline issue\r\n\r\nInsructions:\r\n\r\n1. Unpack and install\r\n2. Use given serial to register and any email\r\n3. Block all out going connections with firewall\r\n4. Done",
  "parsed": {
    "xt": "urn:btih:96560e40ab831fb3a1a9eca8b94347b42b0f46b8",
    "dn": "Wondershare Filmora 6.8.2.0 Multilingual   Keys [4realtorrentz]",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "96560e40ab831fb3a1a9eca8b94347b42b0f46b8",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        150,
        86,
        14,
        64,
        171,
        131,
        31,
        179,
        161,
        169,
        236,
        168,
        185,
        67,
        71,
        180,
        43,
        15,
        70,
        184
      ]
    },
    "name": "Wondershare Filmora 6.8.2.0 Multilingual   Keys [4realtorrentz]",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 354,
  "peers": 100,
  "last_updated": "2016-12-25T08:26:33.754Z"
}