{
  "title": "Einstein on the Road (2011) by Josef Eisinger",
  "uid": 15877014,
  "size": 5134038,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:965e8d4d3b7634311ee32079ad295c1a0f4f2c18&amp;dn=Einstein+on+the+Road+%282011%29+by+Josef+Eisinger&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 54,
  "leechers": 3,
  "uploader": "Dr.Soc",
  "files": 1,
  "time": 1474530320,
  "description": "Josef Eisinger, &quot;Einstein on the Road&quot; \r\n2011 | ISBN-10: 1616144602 | 280 pages | EPUB | 5 MB\r\n\r\nAt the height of his fame, Albert Einstein traveled throughout the world, from Japan to South America and many places in between. During these voyages, between 1922 and 1933, he was in the habit of keeping travel diaries in which he recorded his impressions of people and events, as well as his musings on everything from music and politics to quantum mechanics and psychoanalysis. These fascinating records\r\nare now here published in thier entirety, painting an engaging personal portrait of Einstein the man.\r\n\r\nThe author has created a vivid and entertaining narrative that brings Einstein’s voice to the fore. During Einstein’s travels far and wide, he meets with royalty, presidents, movie stars, and artists—Franklin and Eleanor Roosevelt, Winston Churchill, Charlie Chaplin, Fritz Kreisler, and Sinclair Lewis, as well as the most eminent scientists of the time, including Niels Bohr, Max Planck, Erwin Schrödinger, and Edwin Hubble.\r\n\r\nIn his travel entries, we read his candid impressions of the Far East during a long sea voyage to Japan (1922), where Einstein is welcomed with enormous enthusiasm, and steals the show at an imperial reception. He and Elsa visit and explore many Japanese cities, as well as Singapore, Sri Lanka, Hong Kong, Shanghai, Barcelona, Madrid, and Jerusalem, where Einstein cogitates on Zionism and sees it in action. \r\n\r\nIn 1931, the couple spends eight weeks in Pasadena, where Einstein enjoys fruitful interactions with scientists at Caltech and the Mount Wilson observatory. This portion of the diaries contains illuminating observations about America, science, and the Hollywood celebrities he encounters. He returns to Caltech two more times, and enjoys two extended sojourns in another academic sanctuary, Oxford University. Back at home in Berlin, his diary shows his deep involvement with the academic, social, and cultural life of the German capital, and with the politics of the Weimar Republic. He discusses books, dinner parties, plays, concerts, and sailing, but his greatest passion, apart from physics, is music; he is never happier than when playing chamber music, preferably Mozart—and he does so at every opportunity. \r\n\r\nA lifelong pacifist, he watches the rise of the Nazis with anxiety, and when Hitler gains control in 1933, he renounces pacifism and searches for a place of refuge. He finds it in Princeton, New Jersey, where he joins the newly created Institute for Advanced Study and becomes an American, never more to roam. \r\n\r\nFilled with memorable vignettes, this singular book provides a window into the thoughts and opinions of the twentieth century’s most celebrated scientist and allows us to share in his exhilarating experiences",
  "parsed": {
    "xt": "urn:btih:965e8d4d3b7634311ee32079ad295c1a0f4f2c18",
    "dn": "Einstein on the Road (2011) by Josef Eisinger",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "965e8d4d3b7634311ee32079ad295c1a0f4f2c18",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        150,
        94,
        141,
        77,
        59,
        118,
        52,
        49,
        30,
        227,
        32,
        121,
        173,
        41,
        92,
        26,
        15,
        79,
        44,
        24
      ]
    },
    "name": "Einstein on the Road (2011) by Josef Eisinger",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 57,
  "peers": 21,
  "last_updated": "2016-12-25T08:26:45.787Z"
}