{
  "title": "On Stalin's Team: Year of Living Dangerously in Soviet Politics",
  "uid": 15890779,
  "size": 3204430,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:974fb15e1aa3cd4f3779d06af70d320c756681ca&amp;dn=On+Stalin%27s+Team%3A+Year+of+Living+Dangerously+in+Soviet+Politics&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 37,
  "leechers": 2,
  "uploader": "marty14",
  "files": 1,
  "time": 1474739111,
  "description": "On Stalin's Team: The Year of Living Dangerously in Soviet Politics - Sheila Fitzpatrick [epub]\r\n\r\nStalin was the unchallenged dictator of the Soviet Union for so long that most historians have dismissed the officials surrounding him as mere yes-men and political window dressing. On Stalin's Team overturns this view, revealing that behind Stalin was a group of loyal men who formed a remarkably effective team with him from the late 1920s until his death in 1953.\r\n\r\nDrawing on extensive original research, Sheila Fitzpatrick provides the first in-depth account of this inner circle and their families, vividly describing how these dedicated comrades-in-arms not only worked closely with Stalin, whom they both feared and admired, but also constituted his social circle. Readers meet the wily security chief Beria, whom the rest of the team quickly had executed following Stalin's death; Stalin's number-two man, Molotov, who continued on the team even after his wife was arrested and exiled; the charismatic Ordzhonikidze, who ran the country's industry with entrepreneurial flair; Andreev, who traveled to provincial purges while listening to Beethoven on a portable gramophone; and Khrushchev, who finally disbanded the team four years after Stalin's death. Among the book's surprising findings are that Stalin almost always worked with the team on important issues and that after his death the team managed a brilliant transition to a reforming collective leadership.\r\n\r\nTaking readers from the cataclysms of the Great Purges and World War II to the paranoia of Stalin's final years, On Stalin's Team paints an entirely new picture of Stalin within his milieu--one that transforms our understanding of how the Soviet Union was ruled during much of its existence",
  "parsed": {
    "xt": "urn:btih:974fb15e1aa3cd4f3779d06af70d320c756681ca",
    "dn": "On Stalin's Team: Year of Living Dangerously in Soviet Politics",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "974fb15e1aa3cd4f3779d06af70d320c756681ca",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        151,
        79,
        177,
        94,
        26,
        163,
        205,
        79,
        55,
        121,
        208,
        106,
        247,
        13,
        50,
        12,
        117,
        102,
        129,
        202
      ]
    },
    "name": "On Stalin's Team: Year of Living Dangerously in Soviet Politics",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 14,
  "peers": 15,
  "last_updated": "2016-12-27T07:42:51.206Z"
}