{"title":"The.Lord.of.the.Rings.Conquest.Repack-R.G.Mechanics","uid":10290779,"size":4181340561,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:978bc4a1540dc56bbb1382eb7c8e59fa46165a9e&amp;dn=The.Lord.of.the.Rings.Conquest.Repack-R.G.Mechanics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":151,"leechers":10,"uploader":"Taker009","files":-1,"time":1401852094,"description":"The.Lord.of.the.Rings.Conquest.Repack-R.G.Mechanics\n\n\nYear: 2009\nGenre: Action / 3D / 3rd Person\nPublication Type: RePack\nLanguage: Eng  | Rus\nLanguage: Eng | Rus\nCrack: Razor1911\n\nSystem requirements:\n\nOperating system: Windows XP (SP2), Windows Vista, Windows 7\nProcessor: 2.4 GHz or faster; Intel Core 2 Duo or faster\nMemory: 2 GB\nVideo: 256 MB compatible with Shader third model\nSound Card: Sound device compatible with DirectX 9.0\nFree space on hard disk: 6.2 GB\n\nDescription:\n\nLegendary fantasy saga &quot;The Lord of the Rings&quot; to the next level \nof development in the world of electronic entertainment. You have \na unique opportunity to participate in grand battles in the picturesque \nopen spaces of Middle-earth. And it does not necessarily favor the \ngood ... you can join the ranks of the armies of evil, taking over \nmanagement of the cave troll, Olyphant, Balrog and Sauron himself!\nThe game was created by real professionals from the studio Pandemic, \nresponsible for the brilliant dilogy Star Wars: Battlefront. Offering \nexciting battles, where each participant chooses a character and \ntactics to taste. Razite enemies dwarf ax, push them a crushing \nstrength of siege catapults, and strew the elven arrows, stunning \nmagic - Tolkien Middle-earth in The Lord of the Rings: Conquest \nreproduced in minute detail. The great battle described in the book \nand featured in the legendary film come alive on screen, and you \nbecome their direct party!\n\nFeatures:\n\nTeam spirit. \n\nLord of the Rings: Conquest - an uncompromising \nbattle for power over Middle-earth. Each battle is a clash between \ntwo teams where each member plays a unique role\n\nHistorical accuracy. \n\nThe game has recreated the most vivid scenes of the novel. \nYou will be able to contribute to the landmark battle, described \nin the book, and try yourself as familiar heroes.\n\nBeyond good. \n\nThe choice presented several classes of characters belonging to \nthe &quot;good&quot; or &quot;evil&quot; camp. Not only can you defend Middle-earth, \nbut to conquer it on the side of Sauron!\n\nThe massive battle. \n\nIn online battles can participate up to 16 players, and in the \nsplit-screen co-operate or compete can simultaneously four\nA close relationship with the film. Game contains material \nfrom the film saga, including the unforgettable music\n\nFeatures repack\n\nThe Lord of the Rings: Conquest\nVersion of the game - v1.1\nDo not cut / recoded","torrent":{"xt":"urn:btih:978bc4a1540dc56bbb1382eb7c8e59fa46165a9e","amp;dn":"The.Lord.of.the.Rings.Conquest.Repack-R.G.Mechanics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"978bc4a1540dc56bbb1382eb7c8e59fa46165a9e","infoHashBuffer":{"type":"Buffer","data":[151,139,196,161,84,13,197,107,187,19,130,235,124,142,89,250,70,22,90,158]},"announce":[],"urlList":[]}}