{"title":"Paddle Your Own Canoe (audiobook) - Nick Offerman 2013 English","uid":9165245,"size":312281679,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:97a32bc8cb93dfc1bc0fe7730801ae709e0737f9&amp;dn=Paddle+Your+Own+Canoe+%28audiobook%29+-+Nick+Offerman+2013+English&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":52,"leechers":2,"uploader":"volkwiesel","files":12,"time":1383965927,"description":"Paddle Your Own Canoe: One Man's Fundamentals for Delicious Living (Audiobook) by Nick Offerman, read by the author\nEnglish | 2013 | ISBN: 1611762189 | ASIN: B00FFHINZM | 10 hours and 53 minutes | MP3 64 kbps | 298 MB\n\nParks and Recreation actor Nick Offerman shares his humorous fulminations on life, manliness, meat, and much more in his first book.\nGrowing a perfect moustache, grilling red meat, wooing a woman - who better to deliver this tutelage than the always charming, always manly Nick Offerman, best known as Parks and Recreation's Ron Swanson? Combining his trademark comic voice and very real expertise in woodworking - he runs his own woodshop - Paddle Your Own Canoe features tales from Offerman's childhood in small-town Minooka, Illinois - &quot;I grew up literally in the middle of a cornfield&quot; - to his theater days in Chicago, beginnings as a carpenter/actor and the hilarious and magnificent seduction of his now-wife Megan Mullally. It also offers hard-bitten battle strategies in the arenas of manliness, love, style, religion, woodworking, and outdoor recreation, among many other savory entrees.\n\nA mix of amusing anecdotes, opinionated lessons and rants, sprinkled with offbeat gaiety, Paddle Your Own Canoe will not only tickle readers pink but may also rouse them to put down their smart phones, study a few sycamore leaves, and maybe even handcraft (and paddle) their own canoes.","torrent":{"xt":"urn:btih:97a32bc8cb93dfc1bc0fe7730801ae709e0737f9","amp;dn":"Paddle+Your+Own+Canoe+%28audiobook%29+-+Nick+Offerman+2013+English","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97a32bc8cb93dfc1bc0fe7730801ae709e0737f9","infoHashBuffer":{"type":"Buffer","data":[151,163,43,200,203,147,223,193,188,15,231,115,8,1,174,112,158,7,55,249]},"announce":[],"urlList":[]}}