{"title":"Batman - The Killing Joke (Deluxe HC Edition)","uid":5305952,"size":54556895,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:9852f8fbe4546d3c0998450b338970a26f9de698&amp;dn=Batman+-+The+Killing+Joke+%28Deluxe+HC+Edition%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":202,"leechers":0,"uploader":"brodahisou","files":-1,"time":1264385936,"description":"Batman: The Killing Joke is an influential one-shot superhero graphic novel written by Alan Moore, drawn by Brian Bolland, and published by DC Comics in 1988.\nThis is a scan of the deluxe hardcover edition published in 2008.  This Deluxe Edition features new coloring by Brian Bolland, meant to illustrate his original intentions for the book, with more somber, realistic, and subdued colors than the intensely-colored original.\n\nThe story would affect the mainstream Batman continuity in that it features the shooting and crippling of Barbara Gordon by the Joker, an event which would lead her to adopt the role and identity of Oracle, a vital source of information for Batman and other superheroes.\n\nThe plot revolves around a largely psychological battle between Batman and his longtime foe the Joker, who has escaped from Arkham Asylum. The Joker intends to drive Gotham City Police Commissioner James Gordon insane to prove that the most upstanding citizen can go mad after having &quot;one bad day&quot;. Along the way, the Joker has flashbacks to his early life, gradually explaining his possible origin.\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:9852f8fbe4546d3c0998450b338970a26f9de698","amp;dn":"Batman+-+The+Killing+Joke+%28Deluxe+HC+Edition%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9852f8fbe4546d3c0998450b338970a26f9de698","infoHashBuffer":{"type":"Buffer","data":[152,82,248,251,228,84,109,60,9,152,69,11,51,137,112,162,111,157,230,152]},"announce":[],"urlList":[]}}