{
  "title": "Age.of.Empires.II.HD.The.Forgotten-RELOADED",
  "uid": 9159877,
  "size": 1290599088,
  "categoryP": "games",
  "categoryS": "pc",
  "magnet": "?xt=urn:btih:98d2e651c078049e08b8faa0a5f299e4ba6483d2&amp;dn=Age.of.Empires.II.HD.The.Forgotten-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 132,
  "leechers": 6,
  "uploader": "Mr.Stifmeister",
  "files": 2,
  "time": 1383855694,
  "description": "\n                                      nERv\n\n\n   Age of Empires II HD: The Forgotten *Standalone* (c) Ensemble Studios\n\n      11/2013 :..... RELEASE.DATE .. PROTECTION .......: Steam+CEG\n            1 :.......... DISC(S) .. GAME.TYPE ........: RTS\n\n\nWelcome to Age of Empires II HD - The Forgotten; the first new official\nexpansion for the Age of Empires II universe in over ten years. Challenge\nfriends with five additional civilizations and technologies, battle through\nfour campaigns, vanquish opponents in new game modes on massive maps, or\nshoutcast a match and stream it all through twitch.tv.\nCrafted exclusively for Age of Empires II: HD Edition; The Forgotten\nexpansion builds upon the Age of Empires II: HD experience and includes\nSteam workshop support, new expansion rankings, steam trading cards, and\nmore!\nExplore a host of new features with Age of Empires II - The Forgotten\nincluding Five New Civilizations\n* Italians - Set sail to Venice and take the role as general in one of the\n  Italian republics that emerged from the chaos after the collapse of the\n  Roman Empire!\n* Indians - Put vast armies under your command, comprised of countless\n  Camels and powerful Elephants.\n* Slavs   Even after the dissolution of the Mongolian Golden Horde, these\n  icy planes of Eastern Europe still echo under the thundering hooves and\n  countless boots of your soldiers.\n* Magyars - Lead the mighty Black Army over the Hungarian plains and command\n  the fiercest cavalry forces that Europe has ever witnessed in the\n  Middle Ages\n* Incas - Lead your armies along the shores of Lake Titicaca, defend your\n  wealth and heritage from the invading Conquistadors and erect mighty\n  structures to withstand the test of time.\nFour New Campaigns\n* Alaric: The trauma of the Hun invasion in the 4th century has shaped\n  Alaric, the fearsome warrior king of the Goths. But can the beloved king\n  secure a new homeland for his people in the territory of the collapsing\n  Roman Empire?\n* Sforza: Always hungry for glory and wealth, Sforza wanders around 15th\n  century Italy, offering his services to the highest bidder. Will he pick the\n  right battles or make the wrong enemy? Take the fate of the young mercenary\n  captain in your hands.\n* Bari: 400 years after the collapse of the Roman Empire, Italy is still up\n  for grabs. Relive the tale of the port city Bari from the point of view of\n  a Byzantine family, rising from the common soldiery to the nobility.\n  Beware, for not only Bari is at stake, but also control of Southern Italy.\n* Dracula: History forged an incredible legend around the man who ruled\n  Wallachia in the mid-14th century. Holding his ground against the vast\n  armies of the expanding Ottoman Empire, his cruel tactics made him the\n  most feared man in all of Eastern Europe. Shall his thirst for blood and\n  the loyalty of his soldiers hold the Turks back for good?\nNew LudaKRIS map size\nTwitch.tv streaming integration\nSpectator mode\nNew Game Modes\nTreaty - Popularized in later titles, the economically focused  Treaty\ngametype will be available in AoF. Also commonly known as  No Rush , Treaty\nmode enables a limited duration of battle-free early growth before focusing on\nmilitary might.\nCapture the Relic - For a quick paced, action oriented battle the new\n Capture the Relic  will see players rushing with their monks to take control\nof a single treasure and return it safely to base.\n\nNote:\nOld savegames cant get loaded due to Twitch.tv streaming integration.\n\n\n1. Unrar.\n2. Burn or mount the image.\n3. Install the game.\n4. Copy over the cracked content from the /Crack directory on the image to\n   your game install directory.\n5. Play the game.\n6. Support the software developers. If you like this game, BUY IT!\n",
  "parsed": {
    "xt": "urn:btih:98d2e651c078049e08b8faa0a5f299e4ba6483d2",
    "dn": "Age.of.Empires.II.HD.The.Forgotten-RELOADED",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "98d2e651c078049e08b8faa0a5f299e4ba6483d2",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        152,
        210,
        230,
        81,
        192,
        120,
        4,
        158,
        8,
        184,
        250,
        160,
        165,
        242,
        153,
        228,
        186,
        100,
        131,
        210
      ]
    },
    "name": "Age.of.Empires.II.HD.The.Forgotten-RELOADED",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 50,
  "peers": 219,
  "last_updated": "2016-12-27T07:52:03.050Z"
}