{"title":"Project Management: Best Practices: Achieving Global Excellence","uid":9761155,"size":11483313,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:98d4b83bec470111e879b519c80315f7d127c3e0&amp;dn=Project+Management%3A+Best+Practices%3A+Achieving+Global+Excellence&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":45,"leechers":0,"uploader":"xXGalaxyXx","files":-1,"time":1394811629,"description":"English | 2010-02-08 | ISBN: 047052829X | 707 pages | PDF | 10.95 Mb\n\nSenior executives and project managers from more than 50 world-class companies offer their best practices for successful project management implementation\nThe first two editions of the bestselling Project Management Best Practices helped project managers navigate the increasingly complex task of working within global corporations employing distant and diverse work teams. This new Third Edition includes the same valuable wealth of proven best practices, while following up on case studies from previous editions and offering new case studies on project management practices at large and small companies.\n\nThe Third Edition offers insight from project managers and executives at more than fifty global companies in all sectors of the market. These industry-leading professionals offer insight and best practices for:\n\n- Project risk management\n- Project management for multinational cultures and cultural failures\n- Focusing on value, as well as cost and schedule\n- Integrated and virtual project teams\n\nCovering the latest developments in the project management field, Project Management Best Practices, Third Edition offers a must-have window into the issues and solutions facing corporate managers, project and team managers, engineers, project team members, and business consultants in today's global market.","torrent":{"xt":"urn:btih:98d4b83bec470111e879b519c80315f7d127c3e0","amp;dn":"Project+Management%3A+Best+Practices%3A+Achieving+Global+Excellence","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98d4b83bec470111e879b519c80315f7d127c3e0","infoHashBuffer":{"type":"Buffer","data":[152,212,184,59,236,71,1,17,232,121,181,25,200,3,21,247,209,39,195,224]},"announce":[],"urlList":[]}}