{"title":"Gone Girl: A Novel - Gillian Flynn - Audiobook MP3","uid":11196664,"size":553297781,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:994e26910c8d1fec437c55f774b2df906b8e4dc2&amp;dn=Gone+Girl%3A+A+Novel+-+Gillian+Flynn+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":70,"leechers":2,"uploader":"Squiddy82","files":-1,"time":1413100791,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nGone Girl: A Novel\n\nWritten by: Gillian Flynn\nNarrated by: Julia Whelan, Kirby Heyborne\nLength: 19 hrs and 11 mins\nUnabridged Audiobook\nRelease Date:06-05-12\n\nMarriage can be a real killer. One of the most critically acclaimed suspense writers of our time, New York Times best seller Gillian Flynn, takes that statement to its darkest place in this unpausable masterpiece about a marriage gone terribly, terribly wrong. The Chicago Tribune proclaimed that her work &quot;draws you in and keeps you reading with the force of a pure but nasty addiction.&quot; Gone Girl's toxic mix of sharp-edged wit and deliciously chilling prose creates a nerve-fraying thriller that confounds you at every turn.\n\nOn a warm summer morning in North Carthage, Missouri, it is Nick and Amy Dunne's fifth wedding anniversary. Presents are being wrapped and reservations are being made when Nick's clever and beautiful wife disappears from their rented McMansion on the Mississippi River. Husband-of-the-Year Nick isn't doing himself any favors with cringe-worthy daydreams about the slope and shape of his wife's head, but passages from Amy's diary reveal the alpha-girl perfectionist could have put anyone dangerously on edge.\n\nUnder mounting pressure from the police and the media - as well as Amy's fiercelyparents - the town golden boy parades an endless series of lies, deceits, and inappropriate behavior. Nick is oddly evasive, and he's definitely bitter - but is he really a killer?\n\nAs the cops close in, every couple in town is soon wondering how well they know the one that they love. With his twin sister, Margo, at his side, Nick stands by his innocence. Trouble is, if Nick didn't do it, where is that beautiful wife? And what was in that silvery gift box hidden in the back of her bedroom closet?\n\nWith her razor-sharp writing and trademark psychological insight, Gillian Flynn delivers a fast-paced, devilishly dark, and ingeniously plotted thriller that confirms her status as one of the hottest writers around.","torrent":{"xt":"urn:btih:994e26910c8d1fec437c55f774b2df906b8e4dc2","amp;dn":"Gone+Girl%3A+A+Novel+-+Gillian+Flynn+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"994e26910c8d1fec437c55f774b2df906b8e4dc2","infoHashBuffer":{"type":"Buffer","data":[153,78,38,145,12,141,31,236,67,124,85,247,116,178,223,144,107,142,77,194]},"announce":[],"urlList":[]}}