{"title":"Grease Soundtrack - John Travolta - Olivia Newton-John 320cbr","uid":9435387,"size":154847855,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:99fbf9c489f316291259ad79796c6131cacc753a&amp;dn=Grease+Soundtrack+-+John+Travolta+-+Olivia+Newton-John+320cbr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":93,"leechers":13,"uploader":"Big-Papi","files":-1,"time":1388893380,"description":"Grease Soundtrack - John Travolta - Olivia Newton John 320cbr (Big Papi) 1991 24 Tracks\n\nSource: 1991 CD\n\n\nBy Daniel\nGiven the national funk the USA was in, the songs in Grease was also a longing for a funner, simpler time, when rock wasn't so complicated. Stylishly, it's 50's music, some with 70's disco sensibilities, 70's non-disco pop, and songs whose sound harken back to the stage play, clearly meant to stay within the confines of the movie.\nThe order of songs on the soundtrack frontloads the theme song and singles in the first part before getting back in movie order for the rest. Now, in order of the movie...\n\nAfter the brief &quot;Love Is A Many Splendored Thing,&quot; comes the title song, the perfect marriage of the 50's, exemplified by singer, Frankie Avalon, and the catchy disco-like rhythms of the 70's, hardly surprising given that Barry Gibb of the Bee Gees penned this song.\n\n&quot;Summer Nights&quot; the first duet between John Travolta and Olivia Newton-John, featuring members of the cast, harkens back to its stage origins, with the differing versions of what went on in Danny and Sandy's fateful summer marked by vocal tradeoffs between the two, highlighted by predominantly male voices in Travolta's segment, female ones in Newton-John's.\n\n&quot;Look At Me, I'm Sandra Dee&quot; too is a stagey song, sung by Stockard Channing when making fun of Sandy, with references to Elvis, Troy Donahue, and Doris Day making it a look back at the late 50's. The sugary pop ballad &quot;Hopelessly Devoted To You&quot; was tailor-made for Newton-John, a ballad alternately with steel guitars one moment, strings the next.\n\n&quot;Why this car is automatic, it's systematic, it's hydromatic. Why it's greased lightning!\n&quot;It's Raining On Prom Night,&quot; sung by Cindy Bullens, is another vintage 50's-type slow ballad, and is the song that plays when Sandy goes to the jukebox, only to have Danny make fun of the jock she's hanging out with.\n\nFrankie Avalon's slow-dance &quot;Beauty School Dropout&quot; is a nod back to the days when his &quot;Venus&quot; was a big hit, strings laden doo-wop style female accompaniment including Stockard Channing. This number was done in the guardian angel (Avalon) telling Frenchie to get her act together and go back to school.\n\n&quot;Rock And Roll Party Queen&quot; can be briefly heard in the dance segment when the people start entering the decorated gym.\n\nAnother example of 50s/70s dynamic is Sha-Na-Na, who spearheaded a rock and roll revival movement. Their songs is one fun track after another, from Danny and the Juniors' &quot;Rock And Roll Is Here To Stay,&quot; the slow dance of &quot;Those Magic Changes,&quot; Little Anthony's &quot;Tears On My Pillow,&quot; Big Mama Thornton's &quot;Hound Dog,&quot; the climactic and fun-brimmed &quot;Born To Hand Jive,&quot; and then a cover of &quot;Blue Moon.&quot;\n\nTravolta's solo song &quot;Sandy,&quot; done after Sandy storms out of his car after his manhandling her, is more a defense than an apology, as he says in the monologue that she hurt him. The monologue he has inbetween the singing segments is more a hallmark of girl group songs like &quot;Leader Of The Pack.&quot; Solo, Travolta's actually not bad, replicating 50's-style falsetto at times.\n\nNext, is another Stockard Channing solo, &quot;There Are Worse Things I Could Do&quot; and a reprise of &quot;Sandra Dee&quot; by Olivia Newton-John, before the final blowout. In the interview segment of the video, Olivia Newton-John herself knew that with the bouncy bassline throughout the energetic &quot;You're The One That I Want,&quot; the second Travolta duet, was going to be a hit, and it was. And in the movie, it's followed by the equally vivacious &quot;We Go Together,&quot; which could've been a single.\n\nOther notes: These were not included in the movie:&quot;Alone At the Drive-In,&quot; &quot;Freddy My Love,&quot; &quot;Mooning,&quot; and &quot;Rock N Roll Party Queen&quot; were in the movie, because I don't remember them. Another exemplary soundtrack from the 70's and perhaps of all time","torrent":{"xt":"urn:btih:99fbf9c489f316291259ad79796c6131cacc753a","amp;dn":"Grease+Soundtrack+-+John+Travolta+-+Olivia+Newton-John+320cbr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99fbf9c489f316291259ad79796c6131cacc753a","infoHashBuffer":{"type":"Buffer","data":[153,251,249,196,137,243,22,41,18,89,173,121,121,108,97,49,202,204,117,58]},"announce":[],"urlList":[]}}