{
  "title": "The Goldfinch [2013][Donna Tartt][mobi/epub][INFERNO]",
  "uid": 9093162,
  "size": 2147918,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:9a264e562ef967c9794de5e3f5413fac10e6dfcd&amp;dn=The+Goldfinch+%5B2013%5D%5BDonna+Tartt%5D%5Bmobi%2Fepub%5D%5BINFERNO%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 61,
  "leechers": 10,
  "uploader": "AN0NYMOUS142857",
  "files": -1,
  "time": 1382641521,
  "description": "The Goldfinch by Donna Tartt\n\n\nFormat: mobi/epub\nLength: 784 pages\nGenre: Thriller/Mystery\nDate: 22 October 2013\n\nThe author of the classic bestsellers The Secret History and The Little Friend returns with a brilliant, highly anticipated new novel. Composed with the skills of a master, The Goldfinch is a haunted odyssey through present day America and a drama of enthralling force and acuity.\n\nIt begins with a boy. Theo Decker, a thirteen-year-old New Yorker, miraculously survives an accident that kills his mother. Abandoned by his father, Theo is taken in by the family of a wealthy friend. Bewildered by his strange new home on Park Avenue, disturbed by schoolmates who don't know how to talk to him, and tormented above all by his unbearable longing for his mother, he clings to one thing that reminds him of her: a small, mysteriously captivating painting that ultimately draws Theo into the underworld of art.\n\nAs an adult, Theo moves silkily between the drawing rooms of the rich and the dusty labyrinth of an antiques store where he works. He is alienated and in love-and at the center of a narrowing, ever more dangerous circle.\n\nThe Goldfinch is a novel of shocking narrative energy and power. It combines unforgettably vivid characters, mesmerizing language, and breathtaking suspense, while plumbing with a philosopher's calm the deepest mysteries of love, identity, and art. It is a beautiful, stay-up-all-night and tell-all-your-friends triumph, an old-fashioned story of loss and obsession, survival and self-invention, and the ruthless machinations of fate.\n\nAn Amazon Best Book of the Month, October 2013.\n\nAuthor:\n\nDonna Tartt (born 23 December 1963) is an American writer who received critical acclaim for her two novels, The Secret History and The Little Friend. Tartt was the 2003 winner of the WH Smith Literary Award for The Little Friend.",
  "parsed": {
    "xt": "urn:btih:9a264e562ef967c9794de5e3f5413fac10e6dfcd",
    "dn": "The Goldfinch [2013][Donna Tartt][mobi/epub][INFERNO]",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "9a264e562ef967c9794de5e3f5413fac10e6dfcd",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        154,
        38,
        78,
        86,
        46,
        249,
        103,
        201,
        121,
        77,
        229,
        227,
        245,
        65,
        63,
        172,
        16,
        230,
        223,
        205
      ]
    },
    "name": "The Goldfinch [2013][Donna Tartt][mobi/epub][INFERNO]",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 16,
  "peers": 42,
  "last_updated": "2016-12-27T07:59:56.733Z"
}