{
  "title": "Kaspersky Internet Security 2014",
  "uid": 10082137,
  "size": 240571806,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:9a34eb6ef99eafd45787af869ea92008b84a92cf&amp;dn=Kaspersky+Internet+Security+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 55,
  "leechers": 0,
  "uploader": "nikkk0",
  "files": 13,
  "time": 1399030224,
  "description": "[img]http://s14.postimg.org/k86uw565d/2014_05_02_14_15_36.png[/img]\n\n[size=200]Whats New In Version 2014:[/size] \n\nTo increase security of applications, Trusted Applications mode has been added. When Trusted Applications mode is enabled, Kaspersky Internet Security allows starting only known and trusted applications and ensures that they are run safely. Trusted Applications mode will be available in September 2013, after an update to Kaspersky Internet Security. \n\nProtection against screen lockers has been added. You can unlock the screen by using a specified key shortcut. Protection against screen lockers detects and eliminates the threat. Screen lockers can now be automatically monitored and rolled back. \n\nOn Windows 8, Kaspersky Internet Security can minimize activity when switched to Connected Standby mode. When running in limited activity mode, Kaspersky Internet Security pauses scan tasks and update tasks. When the computer returns from Connected Standby mode, all paused tasks are resumed automatically. \n\nThe latest versions of popular web browsers are now supported: protection components (such as Kaspersky URL Advisor or Safe Money) support Mozilla Firefox 16.x, 17.x, 18.x, 19.x, 20.x, 21.x. and 22.x; Internet Explorer 8, 9, and 10; and Google Chrome 22.x, 23.x, 24.x, 25.x, 26.x, and 27.x. \n\nThe option of participating in the Protect a Friend program has been added. You can now share a link to Kaspersky Internet Security with friends and receive bonus activation codes.\n\n[size=200]Whats Improved[/size]: \n\nThe functionality of Safe Money has been improved. You can now select a web browser to open websites of banks or payment systems. A list of popular websites for financial operations has been added; when these websites are accessed, Safe Money is enabled automatically. \n\nThe functionality of Parental Control has been improved: permissions to start games and applications can be flexibly configured. Age-appropriate presets have been added to Parental Control for restricting user activity. \n\nConfiguration of Kaspersky Internet Security has been simplified. Now only frequently used application settings are available for configuration. \n\nPhishing protection is now more powerful: the Anti-Phishing component has been improved and updated. \n\nProtection components now use Kaspersky ZetaShield technology, which offers effective detection of exploits. \n\nFaster application performance and reduced computer resource use. \n\nLess time is required to start the application. \n\nGUI performance and responsiveness to user actions have been improved. \n\nApplication reporting has been improved. Reports are now more intuitive and visual \n\nActivation \n1.Kaspersky Internet Security 2014(2 License File both 32 &amp; 64 Bit) \n2.Kaspersky antiVirus 2014(2 License file both 32 &amp; 64 bit) \n3.Manual trial Reset Registry file \n4.Read Me! Instruction",
  "parsed": {
    "xt": "urn:btih:9a34eb6ef99eafd45787af869ea92008b84a92cf",
    "dn": "Kaspersky Internet Security 2014",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "9a34eb6ef99eafd45787af869ea92008b84a92cf",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        154,
        52,
        235,
        110,
        249,
        158,
        175,
        212,
        87,
        135,
        175,
        134,
        158,
        169,
        32,
        8,
        184,
        74,
        146,
        207
      ]
    },
    "name": "Kaspersky Internet Security 2014",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 55,
  "peers": 31,
  "last_updated": "2016-12-25T08:50:14.249Z"
}