{
  "title": "Nightwish - Endless Forms Most Beautiful [2015] ak6103",
  "uid": 11761366,
  "size": 131392468,
  "categoryP": "audio",
  "categoryS": "music",
  "magnet": "?xt=urn:btih:9a3bf0a70340815b6ff7851448842a67b34889bf&amp;dn=Nightwish+-+Endless+Forms+Most+Beautiful+%5B2015%5D+ak6103&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 186,
  "leechers": 4,
  "uploader": "analogkid6103",
  "files": 12,
  "time": 1426553623,
  "description": "Endless Forms Most Beautiful is the upcoming eighth album by Finnish symphonic power metal band Nightwish. It is due to be released on March 27, 2015 in the EU and Argentina, on March 30 in the UK and on March 31 in the USA. It is the band's first album with new singer Floor Jansen, as well as the first to feature Troy Donockley, who played uillean pipes and various other instruments on Dark Passion Play and Imaginaerum, as a permanent member.\n\nIt is also their first album without drummer Jukka Nevalainen, who had to take a temporary break from the band due to suffering of strong insomnia, leading him to step away from both the album and its subsequent tour. All the drum parts on the album were consequently played by Kai Hahto from Wintersun and Swallow the Sun. Due to this, the album features only five Nightwish members, despite being their first album released with the band being a sextet.\n\nThe first single from the album, titled &quot;Ã‰lan&quot;, was leaked on February 9, four days before its planned release date of February 13, 2015.\n\nContents\n\n1 Production\n1.1 Concept\n1.2 Songwriting\n1.3 Recording\n2 Composition and lyrics\n3 Track listing\n\nProduction\nConcept\n\n\n\n\nAs with every Nightwish album, Endless Forms Most Beautiful was mainly written and composed by Tuomas Holopainen. However, in the same way since 2002, singer and bassist Marco Hietala acted as secondary songwriter. Commenting on the songs after recording a first demo, Holopainen said &quot;It's still too early to analyze the material more closely, but the album will once again explore all the ends of the spectrum, bringing the very best out of the newcomers Floor [Jansen] and Troy [Donockley]. And stealthily the album ended up having a theme running through it.&quot; Holopainen composed the songs of the new album at the same time he was composing the songs for his first solo album, Music Inspired by the Life and Times of Scrooge; he mainly worked on the songs in late night and in the morning, stating &quot;I think I haven't written a song after 6 PM for this album&quot;.\nEndless Forms Most Beautiful is the first Nightwish album featuring Floor Jansen.\n\nNew members Jansen and Donockley both discussed their roles in the new album; Jansen stated &quot;[Holopainen's] style didn't change of course, but there are things that he hears me singing as well as for example Troy and Marco, and you can just feel that those parts really fit, and at the same time he's triggering me to do new things, so I'm gonna also find new, you know, sounds and borders within my sound, and 'Let's just try this !', and usually, you know, it just fits.&quot; She said Holopainen &quot;challenged me using everything I have to offer. High, low, soft, whatever, but definitely lower stuff and very soft and intimate things. Something that more by coincidence was something that I kind of missed doing. Something I haven't explored much and Tuomas wrote parts where I have to use this completely, where I have to go into it entirely. I'm very happy with what came out there.&quot; Tuomas later confirmed he did challenge her for he thought her voice could fit both heavier and softer songs.\n\nDespite the fact she was an active composer and lyricist in both her former band After Forever and her current other band ReVamp,  I have creative energy in me that needs to come out one way or another, but that's where ReVamp comes in.&quot; Holopainen commented that, however, &quot;she will bring a lot of interpretations, some arrangements and positive energy for sure.&quot;\n\nDonockley said about his parts: &quot;[Tuomas] writes with challenging parts, you know, especially for the pipes, because the pipes are very much a part of a style and a tradition, so it's always nice for me to really push the boundaries of the instrument. But it's not to saturation point, you know, it's not pipes over every song.&quot;\n\n\n\nHolopainen, Hietala and audio engineer Tero &quot;TeeCee&quot; Kinnunen first recorded a demo of 12 songs from late April to May 14, 2014. The band subsequently begun rehearsals and recordings in the following months in Eno, Finland, in a &quot;cabin&quot; in the middle of a semi-deserted land of snow and trees that the band rented, and loosely referred by them as the &quot;summer camp&quot;.\n\n\nDuring the last month, it has become evident for me that due to my insomnia, I can't fulfill my duties as a musician in the way that I'd want and with the precision that the music deserves. Thus I have decided to step aside from my duties as the drummer of Nightwish during the recording of the forthcoming album and the subsequent tour.\n\nThe mixing of the album was undertaken by Holopainen and long-time collaborators Mikko Karmila and Tero Kinnunen. On October 29, 2014, the band announced the beginning of mixing. On December 16, the band announced that mixing was finished.\nComposition and lyrics\n\nTuomas said the album is heavier than its two predecessors, citing &quot;Weak Fantasy&quot;, &quot;Yours Is an Empty Hope&quot; and the title song as examples.\n\nThe first single &quot;Ã‰lan&quot; is about &quot;the meaning of life, which can be something different for all of us. It's important to surrender yourself to the occasional 'free fall' and not to fear the path less travelled by.&quot;\n\n I want to capture the essence of that photo in one of the songs&quot;. The song was intended to be about children at war, but he was struggling with the lyrics due to the theme being too delicate. Following input by Troy, he decided not to add any lyrics at all apart from distant voices and a children choir.\n\n&quot;The Greatest Show on Earth&quot; is the longest Nightwish song to date and refers to &quot;life and evolution by natural selection&quot;. The title was taken from a book by Richard Dawkins. He also said that the band is unlikely to play the entire song live, but there is a &quot;band section&quot; in the middle of it that they are willing to perform.\n\nTrack listing\nNo. Title Length\n\n1. &quot;Shudder Before the Beautiful&quot; 6:29\n2. &quot;Weak Fantasy&quot; 5:23\n3. &quot;Ã‰lan&quot; 4:45\n4. &quot;Yours Is an Empty Hope&quot; 5:34\n5. &quot;Our Decades in the Sun&quot; 6:37\n6. &quot;My Walden&quot; 4:38\n7. &quot;Endless Forms Most Beautiful&quot; 5:07\n8. &quot;Edema Ruh&quot; 5:15\n9. &quot;Alpenglow&quot; 4:45\n10. &quot;The Eyes of Sharbat Gula&quot; (Instrumental) 6:03\n11. &quot;The Greatest Show on Earth&quot;\n\nI. &quot;Four Point Six&quot;\nII. &quot;Life&quot;\nIII. &quot;The Toolmaker&quot;\nIV. &quot;The Understanding&quot;\nV. &quot;Sea-Worn Driftwood&quot;\n\n24:00\nTotal length:\n78:36[5]\nimage\n\nimage",
  "parsed": {
    "xt": "urn:btih:9a3bf0a70340815b6ff7851448842a67b34889bf",
    "dn": "Nightwish - Endless Forms Most Beautiful [2015] ak6103",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "9a3bf0a70340815b6ff7851448842a67b34889bf",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        154,
        59,
        240,
        167,
        3,
        64,
        129,
        91,
        111,
        247,
        133,
        20,
        72,
        132,
        42,
        103,
        179,
        72,
        137,
        191
      ]
    },
    "name": "Nightwish - Endless Forms Most Beautiful [2015] ak6103",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 50,
  "peers": 149,
  "last_updated": "2016-12-27T08:00:36.861Z"
}