{
  "title": "Henry Kissinger - World Order - Reflections on the Character of",
  "uid": 15910024,
  "size": 524615,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:9b16bd0f347ba4b708cf84c30b9e15d5ef4997ab&amp;dn=Henry+Kissinger+-+World+Order+-+Reflections+on+the+Character+of+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 41,
  "leechers": 4,
  "uploader": "roflcopter2110",
  "files": 1,
  "time": 1475104582,
  "description": "https://cdn.pximg.xyz/538bbc3c4facf38e563895ed67bba141.png\r\n \nhttp://boltimg.com/images/YhROu.jpg\r\n\r\nHenry Kissinger - World Order - Reflections on the Character of Nations and the Course of History - epub [TKRG]\r\n\r\nWorld Order is the summation of Henry Kissinger's thinking about history, strategy and statecraft. As if taking a perspective from far above the globe, it examines the great tectonic plates of history and the motivations of nations, explaining the attitudes that states and empires have taken to the rest of the world from the formation of Europe to our own times.\r\n\r\nKissinger identifies four great 'world orders' in history - the European, Islamic, Chinese and American. Since the end of Charlemagne's empire, and especially since the Peace of Westphalia in 1648, Europeans have striven for balance in international affairs, first in their own continent and then globally. Islamic states have looked to their destined expansion over regions populated by unbelievers, a position exemplified today by Iran under the ayatollahs. For over 2000 years the Chinese have seen 'all under Heaven' as being tributary to the Chinese Emperor. America views itself as a 'city on a hill', a beacon to the world, whose values have universal validity.\r\n\r\nHow have these attitudes evolved and how have they shaped the histories of their nations, regions, and the rest of the world? What has happened when they have come into contact with each other? How have they balanced legitimacy and power at different times? What is the condition of each in our contemporary world, and how are they shaping relations between states now?\r\n\r\nTo answer these questions Henry Kissinger draws upon a lifetime's historical study and unmatched experience as a world statesman. His account is shot through with observations about how historical change takes place, how some leaders shape their times and others fail to do so, and how far states can stray from the ideas which define them. World Order is a masterpiece of narrative, analysis and portraits of great historical actors that only Henry Kissinger could have written",
  "parsed": {
    "xt": "urn:btih:9b16bd0f347ba4b708cf84c30b9e15d5ef4997ab",
    "dn": "Henry Kissinger - World Order - Reflections on the Character of ",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "9b16bd0f347ba4b708cf84c30b9e15d5ef4997ab",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        155,
        22,
        189,
        15,
        52,
        123,
        164,
        183,
        8,
        207,
        132,
        195,
        11,
        158,
        21,
        213,
        239,
        73,
        151,
        171
      ]
    },
    "name": "Henry Kissinger - World Order - Reflections on the Character of ",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 45,
  "peers": 46,
  "last_updated": "2016-12-25T08:56:45.593Z"
}