{
  "title": "The Oxford Illustrated History of World War II [PDF][StormRG]",
  "uid": 11850041,
  "size": 59242381,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:9b25e24c27558057597df63970576320a025a541&amp;dn=The+Oxford+Illustrated+History+of+World+War+II+%5BPDF%5D%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 58,
  "leechers": 3,
  "uploader": "0xmovva",
  "files": 2,
  "time": 1430066293,
  "description": "TITLE/EDITION The Oxford Illustrated History of World War Two\nBy: Richard Overy\nSeries: Oxford Illustrated History\nHardcover: 416 pages\nPublisher: Oxford University Press; 1 edition (June 1, 2015)\nLanguage: English\nISBN-10: 0199605823\nISBN-13: 978-0199605828\nNOTE: This is the standalone ebook and may not include access codes that come packaged with the bound book\n\n\n\n\nWorld War Two was the most devastating conflict in recorded human history. It was both global in extent and total in character. It has understandably left a long and dark shadow across the decades. Yet it is three generations since hostilities formally ended in 1945 and the conflict is now a lived memory for only a few. And this growing distance in time has allowed historians to think differently about how to describe it, how to explain its course, and what subjects to focus on when considering the wartime experience. \n\nFor instance, as World War Two recedes ever further into the past, even a question as apparently basic as when it began and ended becomes less certain. Was it 1939, when the war in Europe began? Or the summer of 1941, with the beginning of Hitler's war against the Soviet Union? Or did it become truly global only when the Japanese brought the USA into the war at the end of 1941? And what of the long conflict in East Asia, beginning with the Japanese aggression in China in the early 1930s and only ending with the triumph of the Chinese Communists in 1949? \n\nIn The Oxford Illustrated History of World War Two a team of leading historians re-assesses the conflict for a new generation, exploring the course of the war not just in terms of the Allied response but also from the viewpoint of the Axis aggressor states. Under Richard Overy's expert editorial guidance, the contributions take us from the genesis of war, through the action in the major theatres of conflict by land, sea, and air, to assessments of fighting power and military and technical innovation, the economics of total war, the culture and propaganda of war, and the experience of war (and genocide) for both combatants and civilians, concluding with an account of the transition from World War to Cold War in the late 1940s. Together, they provide a stimulating and thought-provoking new interpretation of one of the most terrible and fascinating episodes in world history",
  "parsed": {
    "xt": "urn:btih:9b25e24c27558057597df63970576320a025a541",
    "dn": "The Oxford Illustrated History of World War II [PDF][StormRG]",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "9b25e24c27558057597df63970576320a025a541",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        155,
        37,
        226,
        76,
        39,
        85,
        128,
        87,
        89,
        125,
        246,
        57,
        112,
        87,
        99,
        32,
        160,
        37,
        165,
        65
      ]
    },
    "name": "The Oxford Illustrated History of World War II [PDF][StormRG]",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 18,
  "peers": 34,
  "last_updated": "2016-12-27T08:07:16.177Z"
}