{"title":"Brain Games s1 s2","uid":8855607,"size":4246143923,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9b4aa5e6cc4ef53411358b966ce71c00a005e510&amp;dn=Brain+Games+s1+s2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":44,"leechers":21,"uploader":"maxjasper","files":14,"time":1377642382,"description":"[img]http://www.hollywoodreporter.com/sites/default/files/imagecache/thumbnail_570x321/2013/04/brain_games.jpg[/img]\n\n[b]National Geographic[/b] [url]http://braingames.nationalgeographic.com/[/url]\n\n[img]http://natgeotv.com.au/content/cache/200x200/shows/thumbnails/brain-games.jpg[/img]\n\n[b]Brain Games[/b] is a reality television series that discusses and explores the components of the human brain. \nHosted by Jason Silva, the show uses experts in cognitive science, neuroscience and psychology. \nThe show is interactive, encouraging viewers to participate in experiments, or &quot;brain games&quot;, that emphasize the main points presented in each episode. \n\n\n[b]Season 1 [/b]\n\n01\tWatch This\tExplore optical illusions and how our brain can mislead us.\n02\tPay Attention\tDavid Copperfield explores how we use attention throughout our life.\n03\tRemember This\tFormer detective Greg Walsh exposes memory weakness.\n\n\n[b]Season 2[/b]\n\n01\tFocus Pocus\tHighlights our misconception that your brain is able to focus on everything important at any given time.\n02\tIt's About Time\tWhy does time fly when you're having fun and slow down when you're in danger?\n03\tMotion Commotion\tExplore how your brain use and reacts to motion in order to make decisions.\n04\tDon't Be Afraid\tExplore how fear may actually be good for you.\n05\tPower of Persuasion\tSee how marketers, advertisers and even political candidates manipulate your brain to persuade you.\n06\tWhat You Don't Know\tLearn what you may not know about what's happening around you.\n07\tBattle of the Sexes\tExplores gender differences.\n08\tSeeing is Believing\tIllusions highlight how your visual perceptions can be surprisingly off.\n09\tYou Decide\tA team of experts show how you may not be in charge of your own destiny.\n10\tUse it or Lose it\tThe brain is similar to muscles - the more you use it, the stronger it gets.\n11\tIllusion Confusion\tOptical illusions highlight how powerful our minds can really be.\n12\tLiar, Liar\tLearn how to determine if someone is lying.","torrent":{"xt":"urn:btih:9b4aa5e6cc4ef53411358b966ce71c00a005e510","amp;dn":"Brain+Games+s1+s2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b4aa5e6cc4ef53411358b966ce71c00a005e510","infoHashBuffer":{"type":"Buffer","data":[155,74,165,230,204,78,245,52,17,53,139,150,108,231,28,0,160,5,229,16]},"announce":[],"urlList":[]}}