{
  "title": "Prezi 5.2.8 with CrackLock 3.9.45",
  "uid": 13216683,
  "size": 572026886,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:9b973da50caca05f578da3fc53a1e0e36cd8ddd9&amp;dn=Prezi+5.2.8+with+CrackLock+3.9.45&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 49,
  "leechers": 6,
  "uploader": "Lokomant",
  "files": 4,
  "time": 1452712826,
  "description": "Description: Prezi is a comprehensive and practical software solution whose main purpose is to help users create stunning presentations effortlessly. The application enables you to store your customized presentations both locally and online into your account by uploading them and accessing them remotely whenever you want.\r\n\r\nBefore actually using the application, you need to choose the template you like most, then insert images, shapes, symbols, YouTube videos and specific files so you can personalize the presentation as you prefer. The differences between Prezi and other applications that help you to create interesting presentations is that you can export your work to PDF format or as a portable app and run the presentation without the need of Prezi installed.By using Prezi you have the possibility to add object animations, change the order between slides and modify the theme as you wish.\r\nAlso, you are able to create and store prezis securely on your computer, USB drive or local network so you can easily share them with your friends and colleagues.\r\nPrezi allows you to communicate design ideas, strategies and concepts in a highly engaging and dynamic way because it brings motion and flexibility to the art of the presentation.\r\nMoreover, because of its complexity and features that Prezi comes with, it can be used in schools and in companies as well. Teachers have the task of conveying complex ideas in a short amount of time, but here Prezi comes in handy. You have the possibility to create connections between various topics, without losing the main idea and your students’ focus.\r\nWith the help of Prezi, your presentations can be as interesting as your organization’s cause and enable you to present new ideas in an intuitive and interactive environment.\r\n\r\n\r\n1) Install Prezi\r\n2) Create Account on Prezi\r\n3) Login on Desktop client ( Internet Connection Required )\r\n4) Close Prezi\r\n5) Download Cracklock and install it.\r\n6) Open Cracklock manager and click on 'Add Program'.\r\n7) Find and select Prezi.exe ( Usually in C Drive )\r\n8) In Configuration window of Cracklock -&gt; Check Virtual Date -&gt; Change date to 40 days back (say) ( don't go back a lot of days because if you go back a couple of years say 20 years, then when you will work with prezi, security warning will be shown repeatedly which is annoying ).\r\n9) In 'Injection Mode' tab select 'Run time Injection'. ( Static Injection has not worked for me. See Cracklock documentation for more details about this ). \r\n10) Be sure to click on 'Click here to create a shortcut on the desktop'. It will create a shortcut on the desktop.\r\n11) Now close Cracklock and enjoy Prezi.\r\n\r\n\r\nWhen you open Prezi you will see 40 days trial ( as you have changed the trial back to 40 days ). But this does not mean that you have only 40 days. When you open tomorrow you will still see 40 days. Even after 10 days you will still see 40 days. So this will never end. And you can enjoy Prezi forever. ( To understand the process in more detail read documentation of Cracklock. In short this happens as you have frozen the time in Cracklock for Prezi. )\r\n\r\nIf you have money please upgrade to pro. The developers really deserve this",
  "parsed": {
    "xt": "urn:btih:9b973da50caca05f578da3fc53a1e0e36cd8ddd9",
    "dn": "Prezi 5.2.8 with CrackLock 3.9.45",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "9b973da50caca05f578da3fc53a1e0e36cd8ddd9",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        155,
        151,
        61,
        165,
        12,
        172,
        160,
        95,
        87,
        141,
        163,
        252,
        83,
        161,
        224,
        227,
        108,
        216,
        221,
        217
      ]
    },
    "name": "Prezi 5.2.8 with CrackLock 3.9.45",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 55,
  "peers": 50,
  "last_updated": "2016-12-25T09:00:22.456Z"
}