{
  "title": "SmartDraw 2013 Enterprise Edition (keygen-REPT) [ChingLiu]",
  "uid": 7727782,
  "size": 60426158,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:9b9ec11da98f94974889bba0852ff76d31d7c335&amp;dn=SmartDraw+2013+Enterprise+Edition+%28keygen-REPT%29+%5BChingLiu%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 120,
  "leechers": 4,
  "uploader": "Ching_Liu",
  "files": 6,
  "time": 1350261642,
  "description": "SmartDraw More Than Just Draw... Productivity Every Day\n\nWhy Everyone Needs a Visual Processor\nThe rapid pace of change in the modern business world and the information overload it has caused is a problem we all wrestle with. We need to consume information in a way that can be easily understood in the minimum amount of the time. When you look at information presented visually, you can immediately see the key ideas and the relationships between them, instead of having to take the time to read a 12 page report. A picture really is worth a 1,000 words.\n\nVisual Process Management\nImprove quality and increase efficiency with this revolutionary process management solution which is universally accessible, comprehensive, and always up-to-date.\n\nVisual Meetings\nReduce the number of meetings and the time they take by using visuals in real time to reach a decision.\n\nVisual Presentations\nCreate and deliver more compelling and successful presentations with a whole new way to plan, compose, and manage your PowerPoints.\n\nVisual Grammar\nMake visual communication across your whole company quick, inexpensive and effective using software that automatically formats with standard rules.\n\nLive Information Capture\nThe secret to short, effective meetings is to capture the decisions and action items assigned during the meeting in a common document that each person can see as changes are made.\n\nProject Planning\nFind out how to prevent even the largest projects from being delivered late and over-budget.\n\nVisual Strategic Planning\nThe secret to developing a winning strategy is to capture big ideas quickly and easily and then also implement these ideas seamlessly.\n\nBetter, Easier Charts\nThe business world is awash in data: sales figures, cost breakdowns, financial reports, and so on. It's the information we must communicate most often. So it makes sense to communicate it in the most effective way possible: with a chart.\n\nOrganize Better with Hubs\nLearn how to use hubs to organize and communicate information quickly and easily with anyone in your organization from a new hire to upper management.\n\nOS: Windows 8, 7, Vista, XP or 2000.\n\nLanguage : English\n\nHomepage : http://www.smartdraw.com/",
  "parsed": {
    "xt": "urn:btih:9b9ec11da98f94974889bba0852ff76d31d7c335",
    "dn": "SmartDraw 2013 Enterprise Edition (keygen-REPT) [ChingLiu]",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "9b9ec11da98f94974889bba0852ff76d31d7c335",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        155,
        158,
        193,
        29,
        169,
        143,
        148,
        151,
        72,
        137,
        187,
        160,
        133,
        47,
        247,
        109,
        49,
        215,
        195,
        53
      ]
    },
    "name": "SmartDraw 2013 Enterprise Edition (keygen-REPT) [ChingLiu]",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 124,
  "peers": 244,
  "last_updated": "2016-12-25T09:00:42.527Z"
}