{
  "title": "Speed Learning Secrets of NLP - Mike Noone",
  "uid": 11680445,
  "size": 324486,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:9bc438b3ec907d058ffab449de61443ef7613d8a&amp;dn=Speed+Learning+Secrets+of+NLP+-+Mike+Noone&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 88,
  "leechers": 1,
  "uploader": "ZamKhan",
  "files": 1,
  "time": 1423063202,
  "description": "When you are in the classroom you get taught what to learn. You get used as a data dump for other people's ideas about what's important. Speed learning secrets is what they don't teach you at school. This book will show you how to learn and how to remember more by teaching you how to use your whole brain.\n\nWho this book is for: \nIf you want to understand how your brain processes the information that you learn and how to use that to learn and remember things more easily then this is for you. If you want to keep your brain agile then this book is for you. \n\nIf you are prepared to implement what you learn here and practice until it becomes habit then it's for you. This is for those who are serious about improving how they use their brain. \n\nWho it's not for is whiners, complainers and those who give up easily before they've even tried out what's written here. It's not for those who are close minded or already have fixed ideas about what they cannot do. \n\nSpeed Learning Secrets of NLP is a guide to learning HOW your brain understands and processes information and how you can utilise that knowledge to by pass the biggest barrier to Speed Learning. ..Your Conscious mind. \n\nAbout the Author\nMike Noone knows that anything is possible if you use your brain in the right way and you are consistent. Part of the challenges people have when they are learning is they don't know how their brain receives, processes and stores information. As a result they also don't know how to retrieve it.\n\nAn NLP trainer, coach and teacher for over 20 years, Mike grew up in NZ and has taught on 3 continents. \n\nMike studied Psychology, Psychotherapy and Transpersonal Counseling in London England and went on to become a hypnotherapist, a timeline therapist and a Coach.\n\nPrior to developing speed learning Mike worked as a project manager on large and complex construction projects in the UK and Europe.\n\nMike wants to create a world people want to live in, where they get what they want and want what they get...\n\nMike lives in Thailand and in New Zealand",
  "parsed": {
    "xt": "urn:btih:9bc438b3ec907d058ffab449de61443ef7613d8a",
    "dn": "Speed Learning Secrets of NLP - Mike Noone",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "9bc438b3ec907d058ffab449de61443ef7613d8a",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        155,
        196,
        56,
        179,
        236,
        144,
        125,
        5,
        143,
        250,
        180,
        73,
        222,
        97,
        68,
        62,
        247,
        97,
        61,
        138
      ]
    },
    "name": "Speed Learning Secrets of NLP - Mike Noone",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 89,
  "peers": 26,
  "last_updated": "2016-12-25T09:01:28.704Z"
}