{
  "title": "Grey's Anatomy - Complete Season 3 (Reseed)",
  "uid": 3811710,
  "size": 9160430370,
  "categoryP": "video",
  "categoryS": "tv_shows",
  "magnet": "?xt=urn:btih:9c399a0a95352c2bc2d8b5c879912a9f81dae789&amp;dn=Grey%5C%27s+Anatomy+-+Complete+Season+3+%28Reseed%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 53,
  "leechers": 29,
  "uploader": "saberfuerza78",
  "files": 25,
  "time": 1190194030,
  "description": "This is a reseed to krankumar&amp;#039;s torrent:\n &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3702281/Grey_s_anatomy_-_the_whole_season_3&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3702281/Grey_s_anatomy_-_the_whole_season_3&lt;/a&gt; .\n\n\nIf you have already downloaded the original torrent to 99.9%, refer to:\n\n &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3802955/Grey_s_Anatomy_Season_3_Episodes_8_and_10&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3802955/Grey_s_Anatomy_Season_3_Episodes_8_and_10&lt;/a&gt;\n\n-OR-\n &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3635042/Grey_s_Anatomy_Season_03_Episode_01-12_swesub&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3635042/Grey_s_Anatomy_Season_03_Episode_01-12_swesub&lt;/a&gt;\n\n\n\n~Saber\n\n---------------------------------------------------\nThe whole season 3\n\nthe episode list....\n\nSeason 3, Episode 1: Time Has Come Today\nOriginal Air Date: 21 September 2006\nWhen Izzie has a mental collapse after Denny&amp;#039;s death, Izzie and Christina turn to Meredith to try and make it better for her. Callie tries to cope with George not returning the three word sentiment she said to him. Meanwhile, back at the hospital, Alex and Addison deal with a baby left in a garbage can at a local high school, Richard receives and ultimatum from his wife, and Derrick and George are quarantined in the locker room due to a patient suspected of having the plague.\n\n\nSeason 3, Episode 2: I Am a Tree\nOriginal Air Date: 21 September 2006\nPatients include a teen aged boy with a tree run through him, a man with a tumor on his brain that forces him to be honest, and a patient who goes all out on living before her surgery as the interns begin to go all out on Bailey to ask Izzy to come back to Seattle Grace; Dr. Burke&amp;#039;s mother goes all out on breaking Christine&amp;#039;s will; Addison goes all out with the bottle, because she found some interesting pocket fanfare in her husband&amp;#039;s tuxedo after the prom; and Callie goes all out to make George jealous.\n\n\nSeason 3, Episode 3: Sometimes a Fantasy\nOriginal Air Date: 5 October 2006\nCristina refuses to quit, like she thinks Preston has. Finn and Derek refuse to quit on Meredith, who insist that they date her. Izzie won&amp;#039;t quit standing out front of Seattle Grace, waiting for the time she feels is right to see Dr. Webber. Mark won&amp;#039;t quit on giving up on Addison, who now realizes her marriage to Derek is over. And Alex wishes she would quit picking him as her intern in the OB-GYN department.\n\n\nSeason 3, Episode 4: What I Am\nOriginal Air Date: 12 October 2006\nDenny&amp;#039;s father (Fred Ward) visits Izzie and gives her something that will change everything. Meanwhile, Meredith is diagnosed with appendicitis and while waiting for emergency surgery and high on morphine has a talk with Addison for the first time since Addison found the panties. Mark &quot;McSteamy&quot; Sloan starts working at the hospital and Alex wants to work under him instead of Addison because Mark has a patient with severe facial burns. And while Callie and George break up, Meredith finally picks one man.\n\n\nSeason 3, Episode 5: Oh, the Guilt\nOriginal Air Date: 19 October 2006\nGuilt causes different actions in everyone, the interns are allowed to attend an M&amp;M meeting, and Derek and Addison finalize things.\n\n\nSeason 3, Episode 6: Let the Angels Commit\nOriginal Air Date: 2 November 2006\nDerrick&amp;#039;s sister comes to Seattle for a visit, and seems more into the extended family and gossip surrounding his divorce from Addison than into him. Meanwhile, the interns are not the only ones jealous of Cristina&amp;#039;s opportunity to scrub in with Preston on a &quot;Humpty Dumpty&quot; procedure, and Bailey takes it personal when she learns she&amp;#039;s been scrubbed, herself. George works with Addison on a very unusual case and Alex envies him.\n\n\nSeason 3, Episode 7: Where the Boys Are\nOriginal Air Date: 9 November 2006\nDerrick was looking forward to getting away from it all for a few days, until his co-workers all go along on a camping trip. Bailey confronts Cristina and another doctor confronts Izzie about her feelings surrounding Denny. Addison and Callie are confronted by a major problem with a pregnant patient.\n\n\nSeason 3, Episode 8: Staring at the Sun\nOriginal Air Date: 16 November 2006\nGeorge must deal with his family when his father is admitted, Richard comes to a decision about his marriage, and Burke&amp;#039;s secret is closer to getting out.\n\n\nSeason 3, Episode 9: From a Whisper to a Scream\nOriginal Air Date: 23 November 2006\nA traumatic car accident fills the ER; Cristina has a crisis of conscience about her deceptive teamwork with Burke; Izzie pushes the boundaries of probation.\n\n\nSeason 3, Episode 10: Don&amp;#039;t Stand So Close to Me\nOriginal Air Date: 30 November 2006\nMiranda is adamant that Burke and Cristina be punished, Derek doubts his abilities, Izzie takes a stand, and Meredith deals with family in two very different ways.\n\nNext US airings:\nThur. May 31 10:00 PM ABC  \n\n\nSeason 3, Episode 11: Six Days: Part 1\nOriginal Air Date: 11 January 2007\nAs Mr. O&amp;#039;Malley&amp;#039;s surgery approaches, he begins to suspect how serious his condition is, Izzie has to take a positive step to scrub in on a surgery, and Meredith keeps running in to her father.\n\n\nSeason 3, Episode 12: Six Days: Part 2\nOriginal Air Date: 18 January 2007\nGeorge&amp;#039;s dad has a rocky road to recovery, Cristina and Burke continue their war of silence, and Meredith reaches out to her father.\n\n\nSeason 3, Episode 13: Great Expectations\nOriginal Air Date: 25 January 2007\nGeorge deals with his grief, Cristina and Burke&amp;#039;s not talking makes for an interesting dinner party, and the Chief has made an decision that sends all the attending doctors scrambling.\n\n\nSeason 3, Episode 14: Wishin&amp;#039; and Hopin&amp;#039;\nOriginal Air Date: 1 February 2007\nA toxic cancer patient immobilizes the hospital, George has an announcement, and Izzie frets that her money wasn&amp;#039;t well spent. Meredith, meanwhile, has new issues with her mother and Cristina worries that having a personal life could affect her career.\n\n\nSeason 3, Episode 15: Walk on Water\nOriginal Air Date: 8 February 2007\nThe interns face a mass-casualty incident while George crosses the professional line with Callie, Cristina asks Preston to let her tell Meredith about their engagement before anyone else finds out, and the Chief dons a new hair style.\n\n\nSeason 3, Episode 16: Drowning on Dry Land\nOriginal Air Date: 15 February 2007\nCristina keeps an eye out around the hospital for Meredith to tell her about Cristina&amp;#039;s impending nuptials. Izzie fights for the life of her patient, still trapped between two vehicles on the ferry and Derrick also searches for Meredith, wondering where she&amp;#039;s disappeared to. Alex gets the job of notifying friends and family members about the status of loved ones.\n\n\nSeason 3, Episode 17: Some Kind of Miracle\nOriginal Air Date: 22 February 2007\nMeredith interacts with some memories, all while the Chief, Burke and Bailey devise an unusual resuscitation maneuver. Meanwhile, Cristina has her own therapy and Derek speaks his mind to Ellis.\n\n\nSeason 3, Episode 18: Scars and Souvenirs\nOriginal Air Date: 15 March 2007\nA Korean war veteran with an old bullet left in his shoulder is admitted into Seattle Grace. Tensions escalate between Izzie and George, and Callie must reveal a big secret. Alex continues to work with Jane Doe.\n\n\nSeason 3, Episode 19: My Favorite Mistake\nOriginal Air Date: 22 March 2007\nIzzie seems to be the only one with a memory of the previous night, Derek gets over-protective when Meredith gets a surgery, and one of Callie&amp;#039;s relatives comes to town.\n\n\nSeason 3, Episode 20: Time After Time\nOriginal Air Date: 19 April 2007\nMeredith deals with an overbearing step-mother. Christina finds herself caught between Burke and Marlow. Derek fights for the job of Chief. Akex continues the search for Jane Doe&amp;#039;s identity. And Izzie&amp;#039;s past comes looking for her.\n\n\nSeason 3, Episode 21: Desire\nOriginal Air Date: 26 April 2007\nThe Chairman of Seattle Grace&amp;#039;s board of directors is admitted and all the attendings vie for his favor, Izzy and George keep getting confronted by the results of infidelity, and Preston presses Cristina for a decision.\n\n\nSeason 3, Episode 22: The Other Side of This Life: Part 1\nOriginal Air Date: 3 May 2007\nAddison leaves for warmer climes and to figure things out, Susan visits the clinic, and Cristina&amp;#039;s perfect wedding is changed when her and Burke&amp;#039;s mothers hit town.\n\n\nSeason 3, Episode 23: The Other Side of This Life: Part 2\nOriginal Air Date: 3 May 2007\nAddison is pulled into the case of a high-risk surrogate mother, Susan develops a complication, Izzy struggles with George&amp;#039;s decision, and Ava has surgery that may restore her memory.\n\n\nSeason 3, Episode 24: Testing 1-2-3\nOriginal Air Date: 10 May 2007\nThe interns take the biggest test of their careers, their first-year medical exams, as the residents attend to three injured mountain climbers. Meanwhile Callie&amp;#039;s suspicions of George and Izzie grow, and Cristina struggles to write her wedding vows.\n\n\nSeason 3, Episode 25: Didn&amp;#039;t We Almost Have It All?\nOriginal Air Date: 17 May 2007\nThe wedding day arrives, and Cristina desperately needs something to take her mind off it, the fourth climber is found and his condition doesn&amp;#039;t match the other climbers&amp;#039; stories, and Adele&amp;#039;s condition brings a change for Richard.",
  "parsed": {
    "xt": "urn:btih:9c399a0a95352c2bc2d8b5c879912a9f81dae789",
    "dn": "Grey\\'s Anatomy - Complete Season 3 (Reseed)",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "9c399a0a95352c2bc2d8b5c879912a9f81dae789",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        156,
        57,
        154,
        10,
        149,
        53,
        44,
        43,
        194,
        216,
        181,
        200,
        121,
        145,
        42,
        159,
        129,
        218,
        231,
        137
      ]
    },
    "name": "Grey\\'s Anatomy - Complete Season 3 (Reseed)",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 82,
  "peers": 10,
  "last_updated": "2016-12-25T09:04:37.351Z"
}