{"title":"Mr. Mercedes: A Novel - Stephen King - Audiobook MP3 CBR 64K","uid":10295711,"size":416651629,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9e581cbc44a1cad35ffe5a90d53f71ca5809d517&amp;dn=Mr.+Mercedes%3A+A+Novel+-+Stephen+King+-+Audiobook+MP3+CBR+64K&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":56,"leechers":3,"uploader":"Squiddy82","files":-1,"time":1401915853,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Smart AudioBook Player or Listen Audiobook Player.\n\niTunes users - Add this to your iTunes collection, and change &quot;Media Kind&quot; to &quot;Audiobook.&quot; Right-click the track or album, and select &quot;Get Info&quot; from the context menu. You will find &quot;Media Kind&quot; under &quot;Options.&quot; This will allow you to transfer the book to your iOS while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\nIf you need the single MP3 file chopped up into smaller segments, you can use Audiobook Cutter.\n\n\nMr. Mercedes: A Novel\n\nWritten by: Stephen King\nNarrated by: Will Patton\nLength: 14 hrs and 22 mins\nFormat: Unabridged\nRelease Date:06-03-14\nProgram Type: Audiobook\n\nIn a mega-stakes, high-suspense race against time, three of the most unlikely and winning heroes Stephen King has ever created try to stop a lone killer from blowing up thousands.\n\nIn the frigid pre-dawn hours, in a distressed Midwestern city, hundreds of desperate unemployed folks are lined up for a spot at a job fair. Without warning, a lone driver plows through the crowd in a stolen Mercedes, running over the innocent, backing up, and charging again. Eight people are killed; fifteen are wounded. The killer escapes.\n\nIn another part of town, months later, a retired cop named Bill Hodges is still haunted by the unsolved crime. When he gets a crazed letter from someone who self-identifies as the &quot;perk&quot; and threatens an even more diabolical attack, Hodges wakes up from his depressed and vacant retirement, hell-bent on preventing another tragedy.\n\nBrady Hartfield lives with his alcoholic mother in the house where he was born. He loved the feel of death under the wheels of the Mercedes, and he wants that rush again. Only Bill Hodges, with a couple of highly unlikely allies, can apprehend the killer before he strikes again. And they have no time to lose, because Brady's next mission, if it succeeds, will kill or maim thousands.\n\nMr. Mercedes is a war between good and evil, from the master of suspense whose insight into the mind of this obsessed, insane killer is chilling and unforgettable. ","torrent":{"xt":"urn:btih:9e581cbc44a1cad35ffe5a90d53f71ca5809d517","amp;dn":"Mr.+Mercedes%3A+A+Novel+-+Stephen+King+-+Audiobook+MP3+CBR+64K","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e581cbc44a1cad35ffe5a90d53f71ca5809d517","infoHashBuffer":{"type":"Buffer","data":[158,88,28,188,68,161,202,211,95,254,90,144,213,63,113,202,88,9,213,23]},"announce":[],"urlList":[]}}