{
  "title": "RIDE-RELOADED",
  "uid": 11779336,
  "size": 14989270206,
  "categoryP": "games",
  "categoryS": "pc",
  "magnet": "?xt=urn:btih:9f2ea74c4b9a48c6a0191333467351af52f1bc44&amp;dn=RIDE-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 53,
  "leechers": 11,
  "uploader": "extremezone",
  "files": 2,
  "time": 1427492464,
  "description": " &lt;a href=&quot;http://i.imgur.com/PxzNgbT.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://i.imgur.com/PxzNgbT.jpg&lt;/a&gt;\n\nScreens:\n &lt;a href=&quot;\nhttp://i.imgur.com/SMKUj2s.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/SMKUj2s.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://i.imgur.com/fEnQ7nr.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/fEnQ7nr.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://i.imgur.com/y0ZNXQh.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/y0ZNXQh.jpg&lt;/a&gt;\n\nRIDE-RELOADED\nRIDE (c) Milestone S.r.l\n\n03/2015 :..... RELEASE.DATE .. PROTECTION .......: Steam\n1 :.......... DISC(S) .. GAME.TYPE ........: Racing, Simulation\nSports\n\nAbout This Game Bikes from the world's most beloved motorcycle manufacturers,\nbreathtaking races, and a round-the-world trip taking in 15 different\nlocations: all this and more in the new videogame: RIDE.\n\nChoose from over 100 bikes from the manufacturers that have made motorcycling\nhistory, and set off on the World Tour. Challenge rivals at Motorcycle\nFestivals divided into three different track typologies: from the thrills of\nthe GP Tracks, through the beautiful landscapes of the Country Tracks, and\nall the way to the challenge of the City Tracks. Race after race, customise\nand improve your bike in order to work your way up the World Rankings and\nbecome the fastest biker in RIDE . As well as the World Tour, players can\ncompete in a variety of different game modes: Quick Race, Time Trial, Split\nScreen, and online with up to 12 players in the Quick Race and in the\nChampionship.\n\nWORLD TOUR:\n\nThe World Tour is RIDE's main game mode, where you can participate in various\nFestivals around the world, divided into various categories: Superbike 1000,\nSupersport 600, Historic Championships, and so on. Each Motorcycle Festival\nfeatures a variety of race modes: single race, championship, time trial,\ntrack day, drag race, and endurance. Each race influences your reputation,\nand therefore your position in the World Ranking of RIDE players.\n\nMULTIPLAYER:\n\nUp to 12 players can compete in the online game modes, including quick race\nand championship you'll be able to challenge a friend with the split screen\nfeature, and all the results of every race will be recorded on the\nLeaderboards.\n\nBIKES:\n\nChoose from a roster of the most beautiful bikes currently in production, and\nfrom the models that have made motorcycling history, with bikes from 14 of\nthe world's leading manufacturers. There are more than 100 bikes in RIDE ,\nwith displacements ranging from 250 to 1,299 cc, manufactured between 1987\nand 2015. Each bike has its own specific mechanical and dynamic\ncharacteristics (power, weight distribution, engine architecture, and so on\nthat have been integrated with a new game physics specifically developed for\nRide that allows players, gamepad in hand, to really appreciate the different\ndynamic behaviour of each model.\n\nCUSTOMISATION:\n\nRIDE lets you choose from a vast range of gear from the leading specialist\nclothing manufacturers, allowing you to personalise your rider from top to\ntoe: choose from over 100 items and 400 colour schemes\nYour bike is completely customisable, in accordance with two component\ncategories: appearance and performance. Choose from a variety of models of\nmirrors and wheel rims, or improve performance on the track by mounting a\nracing exhaust and remapping the ECU. These are just some of the components\nthat you can customize choosing from a catalogue of more than 100 parts.\n\nTRACKS:\n\nRIDE features 15 different circuits in the various locations where the\nMotorcycle Festivals of the World Tour take place.\n\nCountry Tracks: mountain passes, countryside, and natural parks, faithfully\nreproduced from the real world.\n\nCity Tracks: circuits winding through the city, with long straights and tight\ncorners that really challenge your riding reflexes.\n\nGP Tracks: actual racetracks, chosen to enhance the sensations of riding in\nthe seat of the bike, and being able to push it right to the edge.\n\nThe renewed Evolving Track System means that the track evolves lap after lap,\nguaranteeing improved grip along the rubbered-in ideal trajectory as it gets\ndarker and darker as more bikes pass over it. This really helps push you\ntowards a clean riding style, and helps you learn the braking points and the\ncorrect trajectories by studying the behaviour of your rivals.\n\n2. Burn or mount the image\n3. Install the game.\n4. Copy over the cracked content from the /Crack directory on the image to\nyour game install directory\n5. Play the game\n6. Support the software developers. If you like this game, BUY IT\n\nNote: We need anything you can offer as early releases,seedboxes, source links,\naccounts, contact us on &lt;a href=&quot; http://torentz.3xforum.ro&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://torentz.3xforum.ro&lt;/a&gt;\nSeed Stats: 20-400 GiB at aprox 10 MiB/sec/20 slots per torrent\n\nHow To Get Your MAXSPEED (uTorrent)\n\nTorrent Client - Preferences - Bandwidth - Number of connections - Set aprox. 500 for each \nTorrent Client - Preferences - BiTorrent - Protocol Encryption - Forced\nBandwidth Allocation - High (Set download/upload limit - Unlimited)\nStop Other Active Torrents - Start downloading and wait for connections.\nEnjoy and Seed for at least 1:1 ratio. Don't forget to say thanks/leave reviews.\nFor more info,crack only,PATCH,serial,keygen,trainers,CRACKFIX,UPDATES,\nsystem requirements,cheats,NFO,gameplay trailers,free downloads,\npc iso,demos,screenshots,visit some RELEASE SITES or official web pages. \nIF the game does not work for you then update drivers, directX, components\nas netframework/redist files/etc, run as administrator, change compatibility\nmode, block/disable access to internet, copy crack/overwrite, other tweaks,upgrade pc,etc\nSearch on scene release websites for any future updates/working status/etc and \nother quality filesharing sites or just use this - other torrent search functions\nStop using stupid av's as AVG reporting false positive viruses-disable or use ESET",
  "parsed": {
    "xt": "urn:btih:9f2ea74c4b9a48c6a0191333467351af52f1bc44",
    "dn": "RIDE-RELOADED",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "9f2ea74c4b9a48c6a0191333467351af52f1bc44",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        159,
        46,
        167,
        76,
        75,
        154,
        72,
        198,
        160,
        25,
        19,
        51,
        70,
        115,
        81,
        175,
        82,
        241,
        188,
        68
      ]
    },
    "name": "RIDE-RELOADED",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 167,
  "peers": 121,
  "last_updated": "2016-12-27T08:34:03.388Z"
}