{
  "title": "All MATLAB Books Collection",
  "uid": 3879875,
  "size": 944392178,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:9ffceb32ec41c1df19289a677795654cba860970&amp;dn=All+MATLAB+Books+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 39,
  "leechers": 4,
  "uploader": "aksatapathy",
  "files": 80,
  "time": 1194617779,
  "description": "All MATLAB Books Collection\n\nContains Seventy-Three selected books on MATLAB and its applications. \n\nThe .m-files are rar-packed without password.\n\nMATLAB is an incredibly powerful tool that integrates computation, visualization, and programming in a flexible, open environment. It offers engineers, scientists, and mathematicians an intuitive language for expressing problems and their solutions mathematically and graphically. Complex numeric and symbolic problems can be solved in a short time by interfacing it with a programming language such as C, Fortran, or Java.\n\n++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\nA Guide to MATLAB for Beginners and Experienced Users - Hunt Lipsman &amp; Rosenberg.pdf\nA Guide to MATLAB Object-Oriented Programming - Andy H. Register.pdf\nAdaptive Filtering Primer with MATLAB - Poularikas and Ramadan.pdf\nAdvanced Mathematics and Mechanics Applications Using MATLAB - Howard B. Wilson.pdf\nAlgorithm Collections for Digital Signal Processing Applications using Matlab - E.S. Gopi.pdf\nAn Introduction to Programming and Numerical Methods in MATLAB - S.R. Otto &amp; J.P. Denier.pdf\nAntenna and EM Modeling with MATLAB - Sergey N. Makarov.pdf\nApplied Numerical Methods Using MATLAB - Yang Cao Chung and Morris.pdf\nApplied Statistics Using SPSS, STATISTICA, MATLAB and R - Joaquim P. Marques.pdf\nBasics of MATLAB and Beyond - Andrew Knight.pdf\nBiosignal and Biomedical Image Processing MATLAB based Applications - John L. Semmlow.pdf\nBusiness Economics &amp; Finance with Matlab GIS and Simulation Models - Patrick L.Anderson.pdf\nChemical Process Control a First Course with Matlab - P.C. Chau.pdf\nCircuit Analysis II with MATLAB - Steven T. Karris.pdf\nClassical Feedback Control with MATLAB - Boris J. Lurie and Paul J. Enright.djvu\nClassification Parameter Estimation &amp; State Estimation An Engg Approach Using MATLAB.pdf\nComputational Colour Science Using MATLAB - Stephen Westland &amp; Caterina Ripamonti.pdf\nComputational Mathematics Models Methods and Analysis with Matlab - Robert E. White.pdf\nComputational Statistics Handbook with MATLAB - Martinez &amp; Martinez.pdf\nContemporary Communication Systems using Matlab - Proakis and Salehi.pdf\nDigital Circuit Analysis and Design with Simulink Modeling  - Steven T. Karris.pdf\nDigital Image Processing Using Matlab - Gonzalez Woods &amp; Eddins.pdf\nDigital Signal and Image Processing Using MATLAB - Gerard Blanchet &amp; Maurice Charbit.pdf\nDigital Signal Processing - Computer Based Approach - Sanjit K. Mitra.pdf\nDigital Signal Processing Using Matlab V4 - Ingle and Proakis.pdf\nDynamic Simulations of Electric Machinery - Chee Mun Ong.djvu\nElectronic Devices and Amplifier Circuits with MATLAB Applications - Steven T. Karris.pdf\nElectronics and Circuit Analysis Using MATLAB - John O. Attia.pdf\nElem. Math. and Comp. Tools for Engineers using MATLAB - J. Manassah.pdf\nEmbedded Control Systems in C C++ Using MATLAB - Jim Ledin.chm\nEmbedded Image Processing with DSP Examples in MATLAB - Shehrzad Qureshi.pdf\nEngineering Analysis Interactive Methods and Programs with MATLAB - Y. C. Pao.pdf\nEngineering and Scientific Computations Using MATLAB - Sergey E. Lyshevski.pdf\nEnvironmental Modeling Using MATLAB - Ekkehard Holzbecher.pdf\nEssential MATLAB for Engineers and Scientists - Brian D. Hahn &amp; Daniel T. Valentine.pdf\nExploratory Data Analysis with MATLAB - Martinez and Martinez.pdf\nFundamentals of Electromagnetics with Matlab - Lonngren &amp; Savov.pdf\nGraphics and GUIs with MATLAB - Patrick Marchand and O. Thomas Holland .pdf\nIntroduction to Fuzzy Logic using MatLab - Sivanandam Sumathi and Deepa.pdf\nIntroduction to MATLAB - Sikander M. Mirza.pdf\nIntroduction to Simulink with Engineering Applications - Steven T. Karris.pdf\nIntuitive Probability and Random Processes Using MatLab - Steven M. Kay.pdf\nKalman Filtering Theory and Practice Using MATLAB - Grewal and Andrews.pdf\nMathWorks Documentation - MATLAB V7 Function References.pdf\nMathWorks Documentation - MATLAB V7 Introductory and Programming.pdf\nMATLAB Guide - Desmond J. Higham &amp; Nicholas J. Higham.djvu\nMATLAB Primer (6th Ed) - Kermit Sigmon &amp; Timothy A. Davis.pdf\nMATLAB Primer (7th Ed) - Timothy A. Davis &amp; Kermit Sigmon.pdf\nMATLAB Programming - David Kuncicky.pdf\nMATLAB Recipes for Earth Sciences - M.H.Trauth.pdf\nMATLAB Simulations for Radar Systems Design - Bassem R. Mahafza &amp; Atef Z. Elsherbeni.pdf\nMechanics of Composite Materials with MATLAB - George Z. Voyiadjis &amp; Peter I. Kattan.pdf\nNumerical Analysis Using MATLAB and Excel - Steven T. Karris.pdf\nNumerical Analysis Using MATLAB and Spreadsheets - Steven T. Karris.pdf\nNumerical Computing with MATLAB - Cleve Moler.pdf\nNumerical Methods in Engineering with MATLAB - Jaan Kiusalaas.pdf\nNumerical Methods in Finance &amp; Economics A MATLAB based Introduction - Paolo Brandimarte.pdf\nNumerical Methods using MATLAB - Mathews and Fink.pdf\nNumerical Techniques for Chemical &amp; Biological Engineers Using MATLAB - Elnashaie &amp; Uhlig.pdf\nOptical Scanning Holography with MATLAB - Ting Chung Poon.pdf\nOptics Learning by Computing with Examples using MATLAB - K.D. Moller.pdf\nOrdinary and Partial Differential Equation Routines in Matlab - H.J. Lee &amp; W.E. Schiesser.pdf\nRadar Systems Analysis and Design Using MatLab - Mahafza Bassem R.pdf\nRobust Control Design with Matlab - Gu Petkov and Konstantinov.pdf\nScientific Computing with Matlab - Alfio Quarteroni &amp; Fausto Saleri.djvu\nScientific Computing with Matlab and Octave - Alfio Quarteroni &amp; Fausto Saleri.pdf\nSignals and Systems with MATLAB Applications - Steven T. Karris.pdf\nSignals and Systems with MATLAB Computing and Simulink Modeling - Steven T. Karris.pdf\nSolving ODEs with MATLAB - Shampine Gladwell Thompson.pdf\nSolving ODEs with Matlab Instructors Manual - L.F. Shampine.pdf\nSpectral Methods in MATLAB - Lloyd N. Trefethen.pdf\nThe Finite Element Method using MATLAB - Kwon and Bang.pdf\nVibration Simulation Using MATLAB and ANSYS - Michael R Hatch.pdf\n\n+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++",
  "parsed": {
    "xt": "urn:btih:9ffceb32ec41c1df19289a677795654cba860970",
    "dn": "All MATLAB Books Collection",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "9ffceb32ec41c1df19289a677795654cba860970",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        159,
        252,
        235,
        50,
        236,
        65,
        193,
        223,
        25,
        40,
        154,
        103,
        119,
        149,
        101,
        76,
        186,
        134,
        9,
        112
      ]
    },
    "name": "All MATLAB Books Collection",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 9,
  "peers": 38,
  "last_updated": "2016-12-27T08:39:38.402Z"
}