{
  "title": "GetDataBack for FAT and NTFS v4.0.0.1 Portable",
  "uid": 5017538,
  "size": 9900145,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:a00a4e57147b07a10f3fd70a4ed51913b34c1f58&amp;dn=GetDataBack+for+FAT+and+NTFS+v4.0.0.1+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 59,
  "leechers": 4,
  "uploader": "NoExcuses",
  "files": 6,
  "time": 1248295254,
  "description": "GetDataBack for FAT &amp; NTFS v4.0.0.1 made Portable.\n\nNo need to install it!\nOr, if you want to, Setup and Serials are included.\n\nRuntime Software's data recovery software will help you rescue your lost or inaccessible files from any imaginable data recovery disaster.\n\nData Recovery is possible more often than you might think - even without having to send your hard drive to a data recovery service. Download our printable Step-by-Step Guide. \n\nOur powerful, yet easy to use, data recovery tools are designed not only to undelete accidentally deleted files or partitions but also recover your data with GetDataBack after fdisk, formatting your drive, power failure, virus attack, software failure, or after deleting files, folders or partitions. Download the free demo version now. \n\nOur data recovery products come with free updates for the lifetime of the software. Other than with competitors who require you to buy a new version every year, our first GetDataBack customers from 2001 are still enjoying the newest versions of our software. \n\nRuntime Software also offers a wide range of file system utilities and forensic tools as well as data recovery service for all kinds of logical hard drive failures and RAID reconstruction and recovery.\n\n\nMore infos at\n &lt;a href=&quot;\nhttp://www.runtime.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.runtime.org/&lt;/a&gt;\n\n\n\nThe Portable SFX EXE files are built up using WinRAR. You can use it to extract the files and check them one by one if you want to be sure of what is running on your machine.\n\n\n\nThis has also been built up on an XP x86 machine, I don't know if this program can run on a x64 or Vista machine. I't's up to you to check it if you are using them.\n\n\n\nSUGGESTIONS ON USING P2P DOWNLOADS\n==================================\n\n1) It's always better to run all downloaded programs using Sandboxie or a similar virtual machine until you are sure they are clean.\n\n\n2) When in doubt, scan them with an Internet Scan service as the ones provided by Jotti and VirusTotal\n &lt;a href=&quot;\nhttp://virusscan.jotti.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://virusscan.jotti.org/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.virustotal.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.virustotal.com/&lt;/a&gt;\n\nThis will ***NOT*** give you any warranty that a file passing their analysis is clean, nor that if they see them as a troian it's so or not just another false positive, but helps you to decide and at least ask for help or infos.\n\n\n3) Remember, trust nobody, and when in doubt, go to point 1) \n\n\n4) If you find any upload containing trojans or whatsoever malicious or unclean, instead of start cursing in the comments of the upload, take the time to go to the Suprbay Forum at:\n &lt;a href=&quot;\nhttp://suprbay.org/forumdisplay.php?f=34&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://suprbay.org/forumdisplay.php?f=34&lt;/a&gt;\n\nand report links and comments there, and someone will take care of all the nasties.\n\n\nThat's the only way to keep TPB and its uploads fresh and clean.\n\n\nThat's for what is regarding security. If after testing it you see that you like it and it's useful for you, show your support by buying it!\n\n\n\nEnjoy and remember to seed... :o)\n\n\n",
  "parsed": {
    "xt": "urn:btih:a00a4e57147b07a10f3fd70a4ed51913b34c1f58",
    "dn": "GetDataBack for FAT and NTFS v4.0.0.1 Portable",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "a00a4e57147b07a10f3fd70a4ed51913b34c1f58",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        160,
        10,
        78,
        87,
        20,
        123,
        7,
        161,
        15,
        63,
        215,
        10,
        78,
        213,
        25,
        19,
        179,
        76,
        31,
        88
      ]
    },
    "name": "GetDataBack for FAT and NTFS v4.0.0.1 Portable",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 14,
  "peers": 14,
  "last_updated": "2016-12-27T08:39:56.451Z"
}