{"title":"Madam Secretary Season 1","uid":11888448,"size":5788984039,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a0136f61f4d23f8dc40ca95031daf59f95e25d35&amp;dn=Madam+Secretary+Season+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":38,"leechers":26,"uploader":"bobalazs","files":44,"time":1430908619,"description":"Not politics as usual.\n\nA look at the personal and professional life of a Secretary of State as she tries to balance her work and family life.\n\nThis is a show about the secretary of state, the lead Elizabeth(Tea Leoni) is a school teacher and an ex CIA employee who's personally picked by the president to become the secretary of state when her predecessor dies in a car accident. There's a calm nature in Tea that makes her a perfect candidate for this role, she slides into it like it was tailor made for her. Adding to that Henry(Tim Daly) who's her husband in this and a fantastic actor along with their 3 kids it's just a really solid show. \n\nThe truly interesting part about this is that the rest of cast are all really good experienced actors too so basically you have people who play really well off of one another and keep pushing the show into directions where it would typically not go with a new cast. On a personal note if this show at any point in time collided with House of Cards it might make the most interesting crossover in a long time with people who are as smart as they are ruthless in their comprehension of the congressional offices that they hold","torrent":{"xt":"urn:btih:a0136f61f4d23f8dc40ca95031daf59f95e25d35","amp;dn":"Madam+Secretary+Season+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0136f61f4d23f8dc40ca95031daf59f95e25d35","infoHashBuffer":{"type":"Buffer","data":[160,19,111,97,244,210,63,141,196,12,169,80,49,218,245,159,149,226,93,53]},"announce":[],"urlList":[]}}