{"title":"David and Goliath (audiobook) by Malcolm Gladwell 2013 English","uid":8990326,"size":403905609,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a17b25cc800d4139f77bbabe0278c89bd5b94563&amp;dn=David+and+Goliath+%28audiobook%29+by+Malcolm+Gladwell+2013+English&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":42,"leechers":2,"uploader":"drader","files":11,"time":1380767590,"description":"\nDavid and Goliath: Underdogs, Misfits, and the Art of Battling Giants (Audiobook) By Malcolm Gladwell, read by the author\nUnabridged edition 2013 | 7 hours | ISBN: 1611137527 | MP3 128 kbps | 385 MB\n\nDavid and Goliath is the dazzling and provocative new book from Malcolm Gladwell, no.1 bestselling author of The Tipping Point, Blink, Outliers and What the Dog Saw. Why do underdogs succeed so much more than we expect? How do the weak outsmart the strong? In David and Goliath Malcolm Gladwell takes us on a scintillating and surprising journey through the hidden dynamics that shape the balance of power between the small and the mighty.\n\nFrom the conflicts in Northern Ireland through the tactics of civil rights leaders and the problem of privilege, Gladwell demonstrates how we misunderstand the true meaning of advantage and disadvantage. When does a traumatic childhood work in someone's favour? How can a disability leave someone better off? And do you really want your child to go to the best school he or she can get into? David and Goliath draws on the stories of remarkable underdogs, history, science, psychology and on Malcolm Gladwell's unparalleled ability to make the connections other miss. It's a brilliant, illuminating book that overturns conventional thinking about power and advantage. Malcolm Gladwell is a staff writer for The New Yorker magazine, and author of The Tipping Point, Blink, Outliers, and What The Dog Saw. &quot;A global phenomenon ...there is, it seems, no subject over which he cannot scatter some magic dust&quot;.","torrent":{"xt":"urn:btih:a17b25cc800d4139f77bbabe0278c89bd5b94563","amp;dn":"David+and+Goliath+%28audiobook%29+by+Malcolm+Gladwell+2013+English","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a17b25cc800d4139f77bbabe0278c89bd5b94563","infoHashBuffer":{"type":"Buffer","data":[161,123,37,204,128,13,65,57,247,123,186,190,2,120,200,155,213,185,69,99]},"announce":[],"urlList":[]}}