{"title":"Strong Curves (Bret Contreras Kellie Davis) epub","uid":10285459,"size":40420788,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a24b6afc6dcd4cce7dc75d128df71e7c3046155a&amp;dn=Strong+Curves+%28Bret+Contreras+Kellie+Davis%29+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":41,"leechers":4,"uploader":"Itzy","files":3,"time":1401776599,"description":"[img]https://d.gr-assets.com/books/1364138641l/13588186.jpg[/img]\n\nTorrent file name: Strong Curves (Bret Contreras Kellie Davis) epub\nTitle: Strong Curves: A Woman's Guide to Building a Better Butt and Body\nAuthors: Bret Contreras, Kellie Davis\nPublished April 2nd 2013 by Victory Belt Publishing (first published August 1st 2012)\nformat: epub\ngenre: diet, self-help, exercise\n\nThis is not your run-of-the-mill fitness book. Developed by world-renowned gluteal expert Bret Contreras, Strong Curves offers an extensive fitness and nutrition guide for women seeking to improve their physique, function, strength, and mobility.\n\nContreras spent the last eighteen years researching and field-testing the best methods for building better butts and shapelier bodies. In Strong Curves, he offers the programs that have proven effective time and time again with his clients, allowing you to develop lean muscle, rounded glutes, and greater confidence.\n\nEach page is packed with information decoding the female anatomy, providing a better understanding as to why most fitness programs fail to help women reach their goals. With a comprehensive nutritional guide and over 200 strength exercises, this book gets women off the treadmill and furnishes their drive to achieve strength, power, and sexy curves from head to toe.\n\nAlthough the glutes are the largest and most powerful muscle group in the human body, they often go dormant due to lifestyle choices, leading to a flat, saggy bum. Strong Curves is the cure.","torrent":{"xt":"urn:btih:a24b6afc6dcd4cce7dc75d128df71e7c3046155a","amp;dn":"Strong+Curves+%28Bret+Contreras+Kellie+Davis%29+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a24b6afc6dcd4cce7dc75d128df71e7c3046155a","infoHashBuffer":{"type":"Buffer","data":[162,75,106,252,109,205,76,206,125,199,93,18,141,247,30,124,48,70,21,90]},"announce":[],"urlList":[]}}