{"title":"The V-Word - True Stories About First-Time Sex (2016) Gooner","uid":15927745,"size":2151018,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a573a3637bcbdcf3127598957fea71d015dc5c84&amp;dn=The+V-Word+-+True+Stories+About+First-Time+Sex+%282016%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":57,"leechers":3,"uploader":"GoonerTPB","files":2,"time":1475326898,"description":"The V-Word - True Stories About First-Time Sex (2016) (Epub) Gooner\r\n\r\nPublisher: Beyond Words Publishing (1 Mar. 2016)\r\nLanguage: English\r\nISBN-10: 1582705216\r\nISBN-13: 978-1582705217\r\n\r\nAn honest and poignant collection of essays by women about losing their virginity in their teens. &quot;The V-Word&quot; captures the complexity of this important life-decision and reflects diverse real-world experiences. Includes helpful resources for parents and teens. \r\n\r\nLosing it. Popping your cherry. Handing in your V-card. \r\nFirst time sex is a big unknown. Will it be candlelight and rose petals or quick and uncomfortable? Is it about love or about lust? Deciding to have sex for the first time is a choice that s often fraught with anxiety and joy. But do you have anyone telling you what sex is really like? \r\n\r\nIn &quot;The V-Word&quot; seventeen writers (including Christa Desir, Justina Ireland, Sara Ryan, Carrie Mesrobian, Erica Lorraine Scheidt, and Jamia Wilson) pull back the sheets and tell all, covering everything from straight sex to queer sex, diving-in versus waiting, and even the exhilaration and disappointment that blankets it all. Some of their experiences happened too soon, some at just the right time, but all paint a broad picture of what first-time sex is really like. \r\n\r\nFunny, hot, meaningful, cringe-worthy, gross, forgettable, magnificent, empowering, and transformative, the stories in &quot;The V-Word&quot; are never preachy, but provide a map for teens to chart their own course through the steamy waters of sex. With &quot;The V-Word &quot;girls can finally take control, learn what s on the horizon, and eliminate the fear and mystery surrounding this important milestone.&quot;","torrent":{"xt":"urn:btih:a573a3637bcbdcf3127598957fea71d015dc5c84","amp;dn":"The+V-Word+-+True+Stories+About+First-Time+Sex+%282016%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a573a3637bcbdcf3127598957fea71d015dc5c84","infoHashBuffer":{"type":"Buffer","data":[165,115,163,99,123,203,220,243,18,117,152,149,127,234,113,208,21,220,92,132]},"announce":[],"urlList":[]}}