{"title":"Reigns for PC","uid":15600609,"size":76143704,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a7e7b13b4f9652a73abe235c6d5d985b679cf958&amp;dn=Reigns+for+PC&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":186,"leechers":1,"uploader":"Snik146","files":1,"time":1471635776,"description":"Sit on the throne as a benevolent (or malevolent) medieval monarch of the modern age and swipe your royal controller either left or right to impose your will upon the kingdom. Survive the seemingly never-ending gauntlet of requests from your advisors, peasants, allies, and enemies while maintaining balance between the influential factions of your kingdom. But beware; each decision you make might have implications and unfortunate consequences down the road that could put your reign and family’s dynasty at risk!\r\n\r\nAn Unpredictable Kingdom: Each year of your reign brings another important – seemingly random – request from your unpredictable kingdom as you strive for balance between the church, the people, the army, and the treasury. Prudent decisions and careful planning make for a long reign but unforeseen motivations, surprise events, and poor luck can take down even the most entrenched monarch.\r\n\r\nDynasty Expansion: Extend your reign as long as possible, forge alliances, make enemies, and find new ways to die as your dynasty marches along through the ages. Some events will span on centuries, with an intrigue involving burning witches, scientific enlightenment, wicked politics and, maybe, the Devil himself.\r\n\r\nRoyal Challenges: Achieve specific goals set before you at the start of your reign to cement your legacy and unlock new cards and content within the kingdom.\r\n\r\nEclectic Presentation: An inspiring score from Disasterpeace compliment elegant gameplay and a bold art direction for a sublime experience as you rule over your people.\r\n\r\nDon't forget to seed please !!\r\n\r\nIf you like gamae buy it","torrent":{"xt":"urn:btih:a7e7b13b4f9652a73abe235c6d5d985b679cf958","amp;dn":"Reigns+for+PC","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7e7b13b4f9652a73abe235c6d5d985b679cf958","infoHashBuffer":{"type":"Buffer","data":[167,231,177,59,79,150,82,167,58,190,35,92,109,93,152,91,103,156,249,88]},"announce":[],"urlList":[]}}