{
  "title": "Settlers 4 Gold Edition GOG",
  "uid": 8721757,
  "size": 603984894,
  "categoryP": "games",
  "categoryS": "pc",
  "magnet": "?xt=urn:btih:a827264796b47f637f1ab710de39a330b15abd6b&amp;dn=Settlers+4+Gold+Edition+GOG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 40,
  "leechers": 0,
  "uploader": "IAmsoICan",
  "files": 5,
  "time": 1374433761,
  "description": "What's cool about it:\n\n    Includes the original The Settlers  IV and its two expansions: The Settlers  IV: The Trojans and the Elixir of Power and The Settlers  IV Mission CD along with a random map generator.\n    Iron supplies at an end? Maybe you can get your hands on some of your neighbor s surplus metal by trading in some of those coal reserves!\n    Four races with their own campaigns: the Romans, the Mayans, the Vikings, and the Trojans. Each has their own individual style in dress, weapons, alcohol, and magic!\n    Show off your tactical genius and steel your defenses by appointing Squad Leaders and deploying your soldiers with more precision than ever before!\n\nOverview:\n\nJust because of a little uprising, Morbus has been banished to Earth by HIM, the highest god of all. It really could not have been worse for this particular villain, as Morbus cannot bear the sight of anything green. He definitely doesn t plan on letting it stay that way   his Dark Tribe will soon be waging war on the Earth s flora and fauna.\n\nThe Romans, the Mayans, the Vikings, and the Trojans are the four industrious little races you ll be settling with. The seamless zoom function allows you to take a close-up peek as your settlers go about their daily business, or to zoom out for a bird s-eye view of how your very own empire is coming along. Put your settling skills to the test as you gather resources, establish and manage trade routes, manufacture goods, or wage war. It s up to you to lead your tiny settlers to victory! Are you up to the task?",
  "parsed": {
    "xt": "urn:btih:a827264796b47f637f1ab710de39a330b15abd6b",
    "dn": "Settlers 4 Gold Edition GOG",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "a827264796b47f637f1ab710de39a330b15abd6b",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        168,
        39,
        38,
        71,
        150,
        180,
        127,
        99,
        127,
        26,
        183,
        16,
        222,
        57,
        163,
        48,
        177,
        90,
        189,
        107
      ]
    },
    "name": "Settlers 4 Gold Edition GOG",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 25,
  "peers": 69,
  "last_updated": "2016-12-27T09:32:00.783Z"
}