{"title":"Assetto Corsa v1.5-RELOADED","uid":14142152,"size":9955876882,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a914eb7928e636ba0dca5093a066078869a74d96&amp;dn=Assetto+Corsa+v1.5-RELOADED&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":77,"leechers":21,"uploader":"Pirata","files":3,"time":1459622118,"description":"█                                              █\n                █    ▄▀▀█ ▄▀▀  ▓   ▄▀▀▄ ▄▀▀▄ ▄▀▄  ▄▀▀  ▄▀▄     █\n                █▄▄▄ █▀▓  ▓▀ ▄ █   █  ▓ █▀▀▓ ▓  █ ▓▀ ▄ █  ▓ ▄▄▄█\n                       █  ▀▀▀▀ ▀▀▀  ▀▀  ▀    ▀▀▀  ▀▀▀▀ ▀▀▀\n \n                    Assetto Corsa v1.5 (c) Kunos Simulazioni    \n   \n        03/2016 :..... RELEASE.DATE .. PROTECTION .......: Steam\n              1 :.......... DISC(S) .. GAME.TYPE ........: Indie, Racing,\n                                                           Simulation, Sports\n   \n                   ▄▀▀  ▄▀▀▄ ▄▀▄▀▄ ▄▀▀  ▀ ▄▀▀▄ ▄▀▀▄ ▄▀▀▄ ▄▀\n  ▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀ █ ▀▓ █▀▀▓ █   ▓ ▓▀ ▄ █ █  ▓ ▓▀   █  ▓ ▀▀▀█ ▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\n                    ▀▀  ▀    ▀   ▀ ▀▀▀▀ ▀ ▀    ▀     ▀▀   ▀▀\n  Note:\n  ~~~~~\n  Although not a full sequel, this release represents a major update of\n  Assetto Corsa and all of its content, not just a bunch of bug fixes\n  (we did, however, include the last-minute v1.5.2 patch).\n \n  Dream Pack 1-3 DLC's are also included.\n \n  --\n \n  Content\n  The new version includes Ford Mustang 2015, Corvette Stingray 2015, Abarth\n  595 EsseEsse in three versions and the new &quot;Black Cat County&quot; scenery\n  available in three different layouts.\n \n  A new layout for Vallelunga\n  Prior to 2005, &quot;Trincea&quot; was the most challenging bend on the Vallelunga\n  circuit before it was modified to host Formula 1 tests. Trincea (&quot;trench&quot;)\n  is a blind high-speed corner that joins the straight after &quot;Ciminis&quot; to the\n  slower section of the circuit. On the real track, in spite of Trincea being\n  permanently closed, the road is still there and it has been captured in our\n  laser-scan point cloud, which is why we decided to give you the thrill this\n  bend was able to offer, bringing the number of layouts available for &quot;our&quot;\n  home circuit up to three.\n \n  Sound environment\n  The 1.5 version brings some interesting updates regarding sounds, an element\n  absolutely relevant to guaranteeing proper immersion and to get you in the\n  car. As we are gaining experience with FMOD, we can take further advantage\n  of its features, while we continue to expand our recordings database. Thanks\n  to our relationship with racing teams and their kind cooperation, we aim to\n  keep improving our recording techniques and the overall product.\n \n  We always take into consideration our users' feedback, so the 1.5 build\n  finally features basic reverb effects along the tracks and the car sounds\n  are differentiated by internal and external cameras. This means that cockpit\n  cameras use internal sounds, while you can hear the powerful intake sound\n  from the bonnet camera or the distinctive exhaust sound from the chase\n  camera. This vastly enhances immersion and realism and gives modders the\n  chance to further enhance their amazing projects.\n  Additionally, we now provide an in-game app that permits changing sound\n  volumes on the fly, so you are not forced to exit a game session. And that's\n  not all, since the free cameras now use the same distance attenuation of the\n  track cameras, this is also great news for race broadcasters and video makers.\n  Not only does the build bring new features, but also many fixes as well,\n  most importantly gear shift and backfires sounds are now shared by the engine\n  volume. Sounds are also an important information to the driver: now you can\n  hear the bottom of the car scraping against the asphalt or any other surfaces.\n \n  Graphics\n  The 1.5 version also takes an important advantage from the strong and direct\n  connection with the porting process of the code to the consoles, and brings\n  improvements and new features in the graphics department. Post-processing\n  filters have been improved, and the improvements also affect how the cars\n  look. The graphics of the internal instruments have been improved, as well\n  as car details, shaders and materials. The new build features two new\n  driving views: an additional exterior view and the &quot;dashcam&quot;, based on the\n  suggestions given by real drivers and simracers.\n \n  Tyre model &amp; physics\n  Starting with tyres; the 1.5 build optimizes the work started with the\n  previous version and brings all the cars to the latest tyre model and tyre\n  features. Tyres have now a more realistic load sensitivity, a variable grip\n  curve after peak, closer performance level between compounds, a brand-new\n  surface and core heating model as well as more realistic heating operation\n  range.\n \n  Pitstops\n  One of the most awaited features for single player is finally here. Pitstop\n  functionalities open Assetto Corsa to endurance racing thanks to the option\n  of refuelling the car and changing tyres, using the compounds available for\n  each single car. The pitstop menu also allows repair to the car body (that\n  affects aerodynamics), suspensions or the engine, with the same\n  functionalities available for multiplayer racing.\n \n  Artificial intelligence\n  As usual, we have not stopped to keep tweaking and improving our artificial\n  intelligence. Significant improvements have been made, more specifically the\n  AI are now more skilled at navigating through traffic and handle racing\n  situations, offering users who prefer single-player modes an increased level\n  of challenge and more realistic racing environment.\n \n             ▀ ▄▀▀▄ ▄▀   ▓▄▄  ▄▀▀▄ ▓   ▓   ▄▀▀▄ ▄▀▀▄ ▓▄▄  ▄▀▀  ▄▀\n  ▀▀▀▀▀▀▀▀▀▀ █ █  ▓ ▀▀▀█ █  ▄ █▀▀▓ █   █   █  ▓ █  ▓ █  ▄ ▓▀ ▄ ▀▀▀█ ▀▀▀▀▀▀▀▀▀▀\n             ▀ ▀     ▀▀   ▀▀▀ ▀    ▀▀▀ ▀▀▀ ▀     ▀▀   ▀▀▀ ▀▀▀▀  ▀▀\n  1. Unrar.\n  2. Burn or mount the image.\n  3. Install the game.\n  4. Copy over the cracked content from the /Crack directory on the image to\n     your game install directory.\n  5. Play the game.\n  6. Support the software developers. If you like this game, BUY IT!","torrent":{"xt":"urn:btih:a914eb7928e636ba0dca5093a066078869a74d96","amp;dn":"Assetto+Corsa+v1.5-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a914eb7928e636ba0dca5093a066078869a74d96","infoHashBuffer":{"type":"Buffer","data":[169,20,235,121,40,230,54,186,13,202,80,147,160,102,7,136,105,167,77,150]},"announce":[],"urlList":[]}}