{
  "title": "Grass Valley Edius Pro 8.20 Build 312 - Crackingpatching",
  "uid": 15646537,
  "size": 573860259,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:a91a099f8e3458b07dcede9e71fa259175c5092f&amp;dn=Grass+Valley+Edius+Pro+8.20+Build+312+-+Crackingpatching&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 65,
  "leechers": 6,
  "uploader": "ITRG",
  "files": 4,
  "time": 1472057015,
  "description": "[b]Download without torrent client, visit:[/b]\r\n \nhttp://crackingpatching[.]com\r\n\r\n[b]Description:[/b]\r\nValley of Edius a Grass  - is a professional software for video processing, it is often used in the field of television and even film industry. It is worth mentioning is a big plus of development, it can work with video in real time and with almost all known formats, can also handle uncompressed video. If you are already interested in it, I advise you free download Grass Valley Edius full news.\r\nFeatures can be distinguished from the work implement with any number of layers, each of which may contain both audio and video, plus effects. Once you have finished working, you can save the project with the codec Canopus HQ, which is a proprietary company. Video editing can be in formats such as: AVCHD, HDV, DV, MPEG-1, MPEG-2 in real time, there is a full list of formats on the official website.\r\nEdius Pro is ideal for video editing in real time you can work with a video with different frame rates and resolutions. You can apply different quality effects, transitions and titles, you can encode the individual segments of a time line. I want to note the utility Quick Titler, which comes complete, it will allow you to work with subtitles in real time. Yes Multi-Camera mode, it will work with the 8 different sources at the same time. \r\nNow, the most interesting thing to work you need an Intel Core 2 or Core iX, AMD processor with a frequency of 3 GHz in this case he has to support a set of SSE2 instructions and SSE3, so do not all the program will work. A minimum of 1 GB of memory, and better 4. On the hard drive under the program should be about 6 GB, OS only X64! I know that there are already 8 version, but the drug to her yet, so rejoice that is, as soon as version 8, be sure to add it.\r\nDeveloper : Grass Valley USA, LLC \r\nLicense : ShareWare \r\nLanguage : English \r\nOS : Windows 7 x64 and above\r\n\r\n[b]How to Install:[/b]\r\n\r\n1 Uninstall whatever Edius I had installed\r\n2 Erase everything Edius and Grass Valley from my computer\r\n3 Erased everything Ediys and Grass Valley from the registry (careful on this one)\r\n4 Restart computer\r\n5 Install Edius 7xx Restart computer\r\n6 Copy and replace EDIUS update patch, restarted computer again\r\n7 install Edius LOADER (It found that the GV License manager needed to be changed and it did it)\r\n8 Discard from desktop the original Edius 7 icon, the Loader 6xx icon\r\n9 Click on Edius 7 Loader icon\r\n\r\n[b]Contact us:[/b]\r\n  [.]com",
  "parsed": {
    "xt": "urn:btih:a91a099f8e3458b07dcede9e71fa259175c5092f",
    "dn": "Grass Valley Edius Pro 8.20 Build 312 - Crackingpatching",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "a91a099f8e3458b07dcede9e71fa259175c5092f",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        169,
        26,
        9,
        159,
        142,
        52,
        88,
        176,
        125,
        206,
        222,
        158,
        113,
        250,
        37,
        145,
        117,
        197,
        9,
        47
      ]
    },
    "name": "Grass Valley Edius Pro 8.20 Build 312 - Crackingpatching",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 100,
  "peers": 224,
  "last_updated": "2016-12-27T09:37:23.979Z"
}