{
  "title": "Smith Micro Poser Pro 11.0.5.32974 Incl Keygen [SadeemPC]",
  "uid": 15807315,
  "size": 989575425,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:a946316e7ba5725b3bb4e3cb06901580f93ddde0&amp;dn=Smith+Micro+Poser+Pro+11.0.5.32974+Incl+Keygen+%5BSadeemPC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 41,
  "leechers": 6,
  "uploader": "SadeemPC",
  "files": 1,
  "time": 1473571850,
  "description": "mith Micro Poser Pro 11.0.5.32974\r\n\r\nPoser is a 3D universe to illustrate and animate in. Whether you've just begun your journey into graphics or youâ™re a seasoned professional, Poser is your gateway to an experience that is infinitely creative. Design your 3D world with gigabytes of included content from Poserâ™s library. Set the scene with real-world props and 3D elements. Populate and animate scenes with ready-to-pose, fully textured animals and humans. Start making 3D art and animation in minutes.\r\n\r\nFigure Design\r\nPoser makes working with the human form easily accessible with an intuitive user interface. Human and animal models are included for you to start designing and posing immediately. Click-and-drag to sculpt faces, pose body parts, or create various ethnic varieties. For those who require finer control; full body morphs, facial expression morphs, and bone rigging are available for any figure. All features and models are provided in a natural 3D environment for realistic depth, lighting and shadowing on any figure in any pose. Quickly and easily create shape variations with Poserâ™s brush based morphing tools.\r\n\r\nContent\r\nWith Poser, human and animal models are prepared for you to start designing and posing immediately. Figures are pre-rigged so artists can click-and-drag to pose body parts, sculpt faces, or create ethnic varieties. Thousands of poses, morphs, clothing, hair, materials, and accessories are included.\r\n\r\nRendering\r\nPoserâ™s powerful lighting and rendering tools deliver high-quality artistic effects. Create renders with natural lighting, shadows, subsurface scattering for realistic looking skin, caustics and volumetrics for smoke, fog and cloud effects. Customize your final output in many styles, including photorealism, sketch, cartoon, silhouette, real-time comic book mode and more.\r\n\r\nAnimation\r\nPoserâ™s animation tools help you create stunning, realistic animations without much of the repetitive work involved in animating figures. Poser includes automatic keyframe creation, non-linear animation, lip syncing and a walk simulator to simplify the animation process.\r\n\r\nSimulation\r\nDynamic props and bullet physics move with your figure and add realism, bounce and jiggle to your animations. Clothing, table cloth, curtains drape and deform just as they do in real-life, while hair can be grown, styled and controlled dynamically as if blown by the wind",
  "parsed": {
    "xt": "urn:btih:a946316e7ba5725b3bb4e3cb06901580f93ddde0",
    "dn": "Smith Micro Poser Pro 11.0.5.32974 Incl Keygen [SadeemPC]",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "a946316e7ba5725b3bb4e3cb06901580f93ddde0",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        169,
        70,
        49,
        110,
        123,
        165,
        114,
        91,
        59,
        180,
        227,
        203,
        6,
        144,
        21,
        128,
        249,
        61,
        221,
        224
      ]
    },
    "name": "Smith Micro Poser Pro 11.0.5.32974 Incl Keygen [SadeemPC]",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 154,
  "peers": 80,
  "last_updated": "2016-12-27T09:38:42.257Z"
}