{
  "title": "Paragon Hard Disk Manager 15 Suite 10.1.25.813 + Boot Medias",
  "uid": 13802143,
  "size": 1491259174,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:aa558d0e7f77d373b5ec620dc179212f69d39626&amp;dn=Paragon+Hard+Disk+Manager+15+Suite+10.1.25.813+%2B+Boot+Medias&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 53,
  "leechers": 9,
  "uploader": "SadeemPC",
  "files": 4,
  "time": 1457464657,
  "description": "Paragon Hard Disk Manager 15 Suite 10.1.25.813 + Boot Medias (x86/x64)\r\n\r\nThe Hard Disk Manager 15 Suite is the ideal system and data management solution for the discriminating private user. Dependable backup and flexible recovery functions, optimization tools, everything you need for perfect partitioning, the new Paragon Recovery Environment, reliable data wiping algorithms, and much more... all of this is what makes the Hard Disk Manager 15 the perfect companion for your PC over its entire life cycle.\t\r\n\r\nThe all-round solution to completely protect, maintain and manage your PC!\r\n- Every essential solution to manage today’s hard drives\r\n- Full range of backup, recovery and partitioning solutions\r\n- Fast migration to new HDDs, SSDs and virtual machines\r\n- New! Secure data wiping on SSDs\r\n- New! Embedded Recovery Media Builder 3.0\r\n- Free Update* for Windows 10 Support!\r\n\r\nSystem &amp; data backup\r\nThe Hard Disk Manager 15 Suite handles your backup tasks automatically – from backing up the entire system, individual partitions or just selected files. Incremental and differential backup technologies make continuous system backups exceptionally efficient with the Paragon Hard Disk Manager. A one-time full backup of the entire computer followed by regular incremental backups keep the latest status of your PC safe at all times. The new backup containers in pVHD format speed up backups to networks (like an NAS).\r\n\r\nPartitioning &amp; optimization\r\nParagon’s high-performance partitioning engine handles any hard disk partitioning task and helps make optimal use of the available hard disk space. Thanks to automatic partition alignment** you can always get top performance out of SSDs and hard disks with 4-K sectors and RAID volumes.\r\n\r\nParagon Recovery Medium\r\nIf your operating system won’t boot up anymore, you can fire up your PC with the bootable Paragon recovery environment and load in an existing backup, secure important data or rectify booting errors. The new Recovery Media Builder 3.0 makes it extremely easy and flexible to create your own personal recovery environment. And thanks to the latest WinPE technology, the recovery environment is also intuitive to operate.\r\n\r\nAre your backups on a network drive? Then use the advanced options and already add your network configuration and network drive while you’re still creating the recovery medium.\r\n\r\nHave you got a new PC or version of Windows? Why not just keep a virtual version of your previous system to fall back on if you need to?\r\n\r\nRecovery &amp; adaptation\r\nWhat to do if something goes awry?\r\nWith the Hard Disk Manager, you’ll always be on the safe side. Existing backups are no problem to restore thanks to integrated assistants - even on different hardware. It gives you total flexibility and can restore the entire system, specific partitions or just individual files.\r\n\r\nThe Universal Image Mounter (UIM) gives you full access to your secured files at all times. Simply map a backup archive as a network drive and the files it contains will already be accessible, just like they would be with a normal hard disk.\r\n\r\nSupported Operating Systems:\r\n- Windows 10\r\n- Windows 8.1\r\n- Windows 8\r\n- Windows 7\r\n- Windows Vista\r\n- Windows XP Professional\r\n- Windows XP Home\r\n\r\nWhat's New in Version 10.1.25.813:\r\n• Supports the latest Windows 10 (New)\r\n• Agentless protection of Hyper-V guest machines (New)\r\n• File-level backup/restore for virtual containers (pVHD, VHD, VHDX, VMDK) (New)\r\n• Improved Export VD Container Wizard (New)\r\n• Advanced Encryption Standard (AES) support (New)\r\n• System state data backup support (New)\r\n• Refactored P2V Restore Wizard (Update)\r\n• Paragon Recovery Media Builder 3.0 (New)\r\n• Revised Graphical User Interface (GUI) (New)\r\n• Wiping SSD (New)\r\n• Wipe reports auto-save option (New)",
  "parsed": {
    "xt": "urn:btih:aa558d0e7f77d373b5ec620dc179212f69d39626",
    "dn": "Paragon Hard Disk Manager 15 Suite 10.1.25.813   Boot Medias",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "aa558d0e7f77d373b5ec620dc179212f69d39626",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        170,
        85,
        141,
        14,
        127,
        119,
        211,
        115,
        181,
        236,
        98,
        13,
        193,
        121,
        33,
        47,
        105,
        211,
        150,
        38
      ]
    },
    "name": "Paragon Hard Disk Manager 15 Suite 10.1.25.813   Boot Medias",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 62,
  "peers": 100,
  "last_updated": "2016-12-25T10:34:47.092Z"
}