{
  "title": "Intuit Turbotax Deluxe Premier Home Business 2013",
  "uid": 9389306,
  "size": 578527465,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:ab94a9dbd87a15b99842420144f87b9103aa787d&amp;dn=Intuit+Turbotax+Deluxe+Premier+Home+Business+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 37,
  "leechers": 7,
  "uploader": "bobwoz",
  "files": 6,
  "time": 1387852778,
  "description": "Intuit Turbotax Deluxe Premier Home Business 2013 (Mac OSX and Windows) | 551.73 MB\n\n\nTurbotax help you find every tax deduction you deserve and double-check your tax return to help make sure its right. TurboTax Home &amp; Business walks you through your personal and your business income to help you keep every hard-earned dollar you deserve. We will tell you which expenses you can deduct for your advertising, travel, office supplies and more so you get every business tax deduction you are entitled to. We will help you deduct expenses if you have a qualifying home office. \n\n\nFind every tax deduction and credit you qualify for\nWe will get to know you by asking simple questions about your income, family and changes in your tax situation. Then, based on your answers, TurboTax will search for more than 350 tax deductions and credits to get you the biggest tax refund guaranteed.\n\nGet the maximum tax deduction for your donations\nIts Deductible (included) helps you accurately value items you donate to charity no more guessing. Plus, it tracks other donations such as cash, mileage and stocks, to help you get every tax deduction you are entitled to for your charitable donations.\n\nBig life changes? We can help\nChanged jobs? Got married? Bought a home? Had a baby? We'll guide you through common life changes, explain how they impact your taxes, and find any new tax deductions and credits you are eligible for.\n\nTrack your audit risk\nOur Audit Risk Meter checks your tax return for common audit triggers and shows whether your risk is high or low. Then we provide tips to help you reduce your chance of a tax audit.\n\nSee if you qualify for education tax credits (1098-E, 1098-T)\nIf you or your children attended college trade school or even took classes for work, we will help you find refund boosting education tax credits and deductions for tuition, books, and student loan interest.\n\nExtra guidance for homeowners\nYour biggest purchase can also mean big deductions for things like: mortgage interest, property taxes, refinancing fees, points, and improvements to your homes energy efficiency.\n\nNote: You can find the comparison chart between different editions through the included home page link as well.\n",
  "parsed": {
    "xt": "urn:btih:ab94a9dbd87a15b99842420144f87b9103aa787d",
    "dn": "Intuit Turbotax Deluxe Premier Home Business 2013",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "ab94a9dbd87a15b99842420144f87b9103aa787d",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        171,
        148,
        169,
        219,
        216,
        122,
        21,
        185,
        152,
        66,
        66,
        1,
        68,
        248,
        123,
        145,
        3,
        170,
        120,
        125
      ]
    },
    "name": "Intuit Turbotax Deluxe Premier Home Business 2013",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 44,
  "peers": 13,
  "last_updated": "2016-12-25T10:43:10.801Z"
}