{
  "title": "Batman Arkham Knight-CPY",
  "uid": 12169986,
  "size": 53933012992,
  "categoryP": "games",
  "categoryS": "pc",
  "magnet": "?xt=urn:btih:abd666da8457782f6a867aec408a554aff78f12c&amp;dn=Batman+Arkham+Knight-CPY&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 41,
  "leechers": 11,
  "uploader": "Tenguken",
  "files": 1,
  "time": 1438135980,
  "description": "Release Name.......[ Batman.Arkham.Knight-CPY\nRelease Date.......[ 28/07/2015\nShop Release Date..[ 23/06/2015\nFormat.............[ Iso\nRelease............[ Game\nKind...............[ Action\nProtection.........[ Steam+Denuvo\nFiles N............[ 200x250MB\n\n                   [ INFORMATION ]\n\nBatman: Arkham Knight brings the award-winning Arkham trilogy from\nRocksteady Studios to its epic conclusion. Developed exclusively for\nNew-Gen platforms, Batman: Arkham Knight introduces Rocksteady's\nuniquely designed version of the Batmobile. The highly anticipated\naddition of this legendary vehicle, combined with the acclaimed game-\nplay of the Arkham series, offers gamers the ultimate and complete\nBatman experience as they tear through the streets and soar across\nthe skyline of the entirety of Gotham City. In this explosive finale,\nBatman faces the ultimate threat against the city that he is sworn to\nprotect, as Scarecrow returns to unite the super criminals of Gotham\nand destroy the Batman forever.\nBe The Batman - Live the complete Batman experience as the Dark Knight\nenters the concluding chapter of Rocksteady's Arkham trilogy. Players\nwill become The World's Greatest Detective like never before with the\nintroduction of the Batmobile and enhancements to signature features\nsuch as FreeFlow Combat, stealth, forensics and navigation.\nIntroducing the Batmobile - The Batmobile is brought to life with a\ncompletely new and original design featuring a distinct visual appea-\nrance and a full range of on-board high-tech gadgetry. Designed to be\nfully drivable throughout the game world and capable of transformation\nfrom high speed pursuit mode to military grade battle mode, this\nlegendary vehicle sits at the heart of the game's design and allows\nplayers to tear through the streets at incredible speeds in pursuit of\nGotham City's most dangerous villains.\nThe Epic Conclusion to Rocksteady's Arkham Trilogy - Batman: Arkham\nKnight brings all-out war to Gotham City. The hit-and-run skirmishes of\nBatman: Arkham Asylum, which escalated into the devastating conspiracy\nagainst the inmates in Batman: Arkham City, culminates in the ultimate\nshowdown for the future of Gotham. At the mercy of Scarecrow, the fate\nof the city hangs in the balance as he is joined by the Arkham Knight,\na completely new and original character in the Batman universe, as well\nas a huge roster of other infamous villains including Harley Quinn, The\nPenguin, Two-Face and the Riddler.\n\nInstructions:\n-Burn or mount the image\n-Install the game\n-Copy the crack\n-Enjoy\n\nNote:\nThe game is updated to the latest patch and includes all DLCs.\nEdit CPY.ini to change the language, choose between &quot;english&quot;,\n&quot;french&quot;, &quot;german&quot;, &quot;italian&quot;, &quot;spanish&quot;, &quot;russian&quot;, &quot;brazilian&quot;",
  "parsed": {
    "xt": "urn:btih:abd666da8457782f6a867aec408a554aff78f12c",
    "dn": "Batman Arkham Knight-CPY",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "abd666da8457782f6a867aec408a554aff78f12c",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        171,
        214,
        102,
        218,
        132,
        87,
        120,
        47,
        106,
        134,
        122,
        236,
        64,
        138,
        85,
        74,
        255,
        120,
        241,
        44
      ]
    },
    "name": "Batman Arkham Knight-CPY",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 48,
  "peers": 7,
  "last_updated": "2016-12-27T09:55:03.310Z"
}