{
  "title": "Warren Buffett's Management Secrets: Proven Tools for Personal ",
  "uid": 6148285,
  "size": 109445283,
  "categoryP": "audio",
  "categoryS": "audio_books",
  "magnet": "?xt=urn:btih:abf8e2d8b9c3c14123bc844368ee9354a890c2de&amp;dn=Warren+Buffett%5C%27s+Management+Secrets%3A+Proven+Tools+for+Personal+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 52,
  "leechers": 3,
  "uploader": "MANTESH",
  "files": 48,
  "time": 1296772971,
  "description": " &lt;a href=&quot;http://img25.imageshack.us/img25/3407/11818244.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://img25.imageshack.us/img25/3407/11818244.jpg&lt;/a&gt;\n\n\n\n\n\n\nWarren Buffett's Management Secrets: Proven Tools for Personal and Business Success \n\n\nPublisher: Simon &amp; Schuster Audio \n2009 \nISBN: 0743597346 \nENGLISH\nMP3\n96 kbps \n2 hrs 31 mins \n104.38 MB\n\n&quot;This amazing book captures in vivid detail Warren Buffett's most important management secrets, allowing the reader to take action with their new knowledge. Mary Buffett and David Clark have again shown their ability to reveal Warren's thought processes better than any other authors.&quot; -- John P. Reese\n\nEven in today's economic climate, when so many investors and major companies are failing, Warren Buffett continues to be successful in all aspects of his life. Mary Buffett and David Clark have written the first book ever to take an in-depth look at Warren Buffett's philosophies for personal and professional management -- what they are, how they work, and how you can use them.\n\nThrough close examination of Warren Buffett's life and career from his earliest days to now, Buffett and Clark shed light on his decision-making processes and reveal his strategies for keeping on track and maintaining focus. They examine Buffett's inimitable leadership qualities and explain how Warren integrated what he learned over time into a winning management formula and became not only the manager whom other managers want to emulate but also the second richest man in the world.\n\nA true companion volume to Buffett and Clark's successful Buffettology series, Warren Buffett's Management Secrets is filled with anecdotes and quotes that show how Buffett's life philosophies are reflected in his businessdecisions and in the way he manages people and businesses. This insider's view into Warren Buffett's management techniques offers simple solutions for success to newcomers and seasoned Buffettologists alike and illustrates how and why success in business and life usually go hand in hand....................\n\n\n\n",
  "parsed": {
    "xt": "urn:btih:abf8e2d8b9c3c14123bc844368ee9354a890c2de",
    "dn": "Warren Buffett\\'s Management Secrets: Proven Tools for Personal ",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "abf8e2d8b9c3c14123bc844368ee9354a890c2de",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        171,
        248,
        226,
        216,
        185,
        195,
        193,
        65,
        35,
        188,
        132,
        67,
        104,
        238,
        147,
        84,
        168,
        144,
        194,
        222
      ]
    },
    "name": "Warren Buffett\\'s Management Secrets: Proven Tools for Personal ",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 12,
  "peers": 25,
  "last_updated": "2016-12-27T09:55:55.456Z"
}