{
  "title": "Game Character Creation with Blender and Unity [PDF]",
  "uid": 9436584,
  "size": 178646896,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:abf8f4808577549aa10ccf5fb33ddfc34a1608ff&amp;dn=Game+Character+Creation+with+Blender+and+Unity+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 41,
  "leechers": 1,
  "uploader": "F1restorm",
  "files": -1,
  "time": 1388917941,
  "description": "Game Character Creation with Blender and Unity \nAuthor: Chris Totten\nPublished: 2012\nPublisher: Sybex\nISBN: 9781118226902\nFormat: Retail PDF\nReader Required: Adobe Reader, Adobe Digital Editions\nSize: 170MB\n\nTested on the above readers with no problems on laptop and Android tablet. \nPlease allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nEnjoy! :D\n___________________________________________________________________________________\n\nA complete guide to creating usable, realistic game characters with two powerful tools\nCreating viable game characters requires a combination of skills. This book teaches game creators how to create usable, realistic game assets using the power of an open-source 3D application and a free game engine. It presents a step-by-step approach to modeling, texturing, and animating a character using the popular Blender software, with emphasis on low polygon modeling and an eye for using sculpting and textures, and demonstrates how to bring the character into the Unity game engine.\n\n-Game creation is a popular and productive pursuit for both hobbyists and serious developers; this guide brings together two effective tools to simplify and enhance the process\n-Artists who are familiar with Blender or other 3D software but who lack experience with game development workflow will find this book fills important gaps in their knowledge\n-Provides a complete tutorial on developing a game character, including modeling, UV unwrapping, sculpting, baking displacements, texturing, rigging, animation, and export\n-Emphasizes low polygon modeling for game engines and shows how to bring the finished character into the Unity game engine\n\nWhether you're interested in a new hobby or eager to enter the field of professional game development, this book offers valuable guidance to increase your skills.",
  "parsed": {
    "xt": "urn:btih:abf8f4808577549aa10ccf5fb33ddfc34a1608ff",
    "dn": "Game Character Creation with Blender and Unity [PDF]",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "abf8f4808577549aa10ccf5fb33ddfc34a1608ff",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        171,
        248,
        244,
        128,
        133,
        119,
        84,
        154,
        161,
        12,
        207,
        95,
        179,
        61,
        223,
        195,
        74,
        22,
        8,
        255
      ]
    },
    "name": "Game Character Creation with Blender and Unity [PDF]",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 42,
  "peers": 0,
  "last_updated": "2016-12-25T10:45:51.441Z"
}