{
  "title": "Ni Labview 2013 v13.0 With Toolkits (x86/x64) ACTIVATED",
  "uid": 8904096,
  "size": 4845987840,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:acac7b5f612ce135aacebedbede94db22b2f50c7&amp;dn=Ni+Labview+2013+v13.0+With+Toolkits+%28x86%2Fx64%29+ACTIVATED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 97,
  "leechers": 6,
  "uploader": "tbnm",
  "files": 1,
  "time": 1378869244,
  "description": "Ni Labview 2013 v13.0 With Toolkits (x86/x64)\n\n\n\n\nNi Labview 2013 v13.0 With Toolkits (x86/x64) | 5.49 GB\n\n\nNational Instruments released NI LabVIEW 2013, the newest version of its system design software for engineers and scientists. With LabVIEW 2013, NI integrated the latest and most innovative technologies into the software while reducing design complexity from basic measurements to full test platforms.\n\nNew LabVIEW 2013 benefits include:\n- Native support for the newest hardware from vendors like ARM and Xilinx, including the Xilinx Zynq All Programmable system on a chip used in high-performance systems.\n- Enhanced application reliability and quality for complex applications through a suite of code management, documentation and review tools. New tools integrate with a software engineering process, including a new Subversion plugin from Viewpoint Systems.\n- Streamlined deployment technologies for developers who want to deliver professional applications to users, including a new tool from Wirebird Labs.\n- Delivering systems on the latest mobile platformsfor iOS and Android that enable dashboards for remote monitoring and system control.\n\nThese new capabilities are delivered through the familiar LabVIEW programming paradigm, eliminating developer need for expensive new toolchains or the acquisition of OS- or hardware-specific training or talent.\n\nLabVIEW 2013 emphasizes the incorporation of ongoing user feedback through the inclusion of more than 100 new features and improvements in the LabVIEW editor. NI has also simplified and expanded access to resources that ensure LabVIEW programmers can take full advantage of a product's broad toolset. Customers with an active service contract will benefit from an expanded library of online training resources from the use of real-time targets to programming for FPGAs and even object-oriented programming. This training is combined with redesigned application examples and new sample projects to provide programmers a variety of resources that cater to different learning styles.\n\nThis version has also new features for all LabVIEW modules as well as updates and bug fixes to the rest of the LabVIEW platform.",
  "parsed": {
    "xt": "urn:btih:acac7b5f612ce135aacebedbede94db22b2f50c7",
    "dn": "Ni Labview 2013 v13.0 With Toolkits (x86/x64) ACTIVATED",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "acac7b5f612ce135aacebedbede94db22b2f50c7",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        172,
        172,
        123,
        95,
        97,
        44,
        225,
        53,
        170,
        206,
        190,
        219,
        237,
        233,
        77,
        178,
        43,
        47,
        80,
        199
      ]
    },
    "name": "Ni Labview 2013 v13.0 With Toolkits (x86/x64) ACTIVATED",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 50,
  "peers": 50,
  "last_updated": "2016-12-27T10:00:22.440Z"
}