{
  "title": "CCNA Routing and Switching Study Guide [PDF]",
  "uid": 9174221,
  "size": 41546124,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:ace7cf1a5ea6ad57030e7d7a04e7011ff9bd2ace&amp;dn=CCNA+Routing+and+Switching+Study+Guide+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 171,
  "leechers": 7,
  "uploader": "F1restorm",
  "files": -1,
  "time": 1384120932,
  "description": "CCNA Routing and Switching Study Guide Exam 100-101, 200-101, 200-120\nAuthor: Todd Lammle\nPublished: October, 2013\nPublisher: Sybex\nISBN: 9781118749616\nFormat: Retail PDF\nReader Required: Adobe Reader, Adobe Digital Editions etc\n\nTested on the above readers with no problems. \nThe Sybex website (link below and in book) offers bonus content and study tools, please note that you need to register an email address (free) to access some of the bonus content.The author also offers a free website and forum to further develop your skills (link in book).\nIt takes a couple seconds for the seedboxes to engage, then the download should be superfast.\nEnjoy and good luck with your tests :D\n_____________________________________________________________________________\n\n\nTodd Lammle Prepares You for the New CCNA Exams\n\nGet ready for Cisco's redesigned CCNA Routing and Switching certification exams with this new edition of the bestselling Sybex CCNA Study Guide. Cisco authority Todd Lammle covers all exam objectives for the ICND1 (#100-101) and ICND2 (#200-101) exams, as well as the CCNA Composite (#200-120) exam, and he provides plenty of examples and hands-on labs so you can really absorb the material. Not only will you be better prepared, you'll also benefit from Todd's valuable insights drawn from his over 30 years of experience in networking and Cisco technologies. Study, practice, and review with:\n\n-Full coverage of all exam objectives in a systematic approach, so you can be confident you're getting the instruction you need for the exam\n-Practical written and hands-on labs to reinforce critical skills\n-Free network simulator to complete the book's hands-on labs without the need for additional hardware\n-Real-world scenarios that put what you've learned in the context of actual job roles\n-Challenging review questions in each chapter to prepare you for exam day\n-Exam Essentials, a key feature in each chapter that identifies critical areas you must become proficient in before taking the exam\n-Sybex Exam Prep Tools\n-A full set of test prep tools is available at www.sybex.com/go/ccnarssg to help you prepare for the exam. Select the Downloads tab for access to:\nFree network simulator\nCustom test environment\nTodd Lammle author videos\nHundreds of sample questions\nElectronic flashcards\nGlossary of key terms\nIncludes coverage of all exam objectives, including these key topics:\n\nSelecting the components required to meet a given network specification\nPredicting the data flow between two hosts across a network\nIdentifying enhanced switching technologies\nDescribing IPv6 addresses\nConfiguring and verifying operation status of a serial interface\nManaging Cisco IOS files",
  "parsed": {
    "xt": "urn:btih:ace7cf1a5ea6ad57030e7d7a04e7011ff9bd2ace",
    "dn": "CCNA Routing and Switching Study Guide [PDF]",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "ace7cf1a5ea6ad57030e7d7a04e7011ff9bd2ace",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        172,
        231,
        207,
        26,
        94,
        166,
        173,
        87,
        3,
        14,
        125,
        122,
        4,
        231,
        1,
        31,
        249,
        189,
        42,
        206
      ]
    },
    "name": "CCNA Routing and Switching Study Guide [PDF]",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 178,
  "peers": 24,
  "last_updated": "2016-12-25T10:51:44.803Z"
}