{
  "title": "Final cut pro 10.1 Motion 5.1 Compressor 4.1",
  "uid": 9383239,
  "size": 4307020353,
  "categoryP": "applications",
  "categoryS": "mac",
  "magnet": "?xt=urn:btih:acfc339f51934007a383db892290dd14f1494d6f&amp;dn=Final+cut+pro+10.1+Motion+5.1+Compressor+4.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 42,
  "leechers": 0,
  "uploader": "gfx3dro",
  "files": 1,
  "time": 1387746494,
  "description": "\nFinal Cut Pro X optimized for the new Mac Pro\n\nAs promised when the new Mac Pro was first announced, Apple has delivered updates to its pro video applications to take advantage of 4K content, optimized playback and rendering and Thunderbolt 2.\n\nApple released a trio of pro video software updates on Thursday along with the release of its new Mac Pro which are now available from the Mac App Store.\n\nFinal Cut Pro X 10.1 arrives with an insanely long list of new and enhanced features, but the top of the list is full support for the new 2013 Mac Pro, including &quot;optimized playback and rendering using dual GPUs&quot; along with 4K content support and video monitoring via both Thunderbolt 2 and HDMI.\n\nThe update also introduces libraries, a new way to &quot;gather multiple events and projects within a single bundle&quot; along with the option to import media to locations inside or outside of those bundles. Tucked away amongst the list of 37 changes is also &quot;improved performance with large projects&quot; -- one we're particularly interested to take for a spin.\n\nApple also released Motion 5.1, which offers many of the same Mac Pro-centric enhancements along with FxPlug 3 for custom plug-in interfaces and dual-GPU support, faster project loading and the ability to share directly to YouTube at 4K resolution.\n\nLast but not least, Compressor 4.1 delivers an all-new, single-window layout along with streamlined controls, preset destinations for common encoding tasks, hardware-based H.264 encoding in supported Share operations, support for Dolby Digital Plus encoding and much more",
  "parsed": {
    "xt": "urn:btih:acfc339f51934007a383db892290dd14f1494d6f",
    "dn": "Final cut pro 10.1 Motion 5.1 Compressor 4.1",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "acfc339f51934007a383db892290dd14f1494d6f",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        172,
        252,
        51,
        159,
        81,
        147,
        64,
        7,
        163,
        131,
        219,
        137,
        34,
        144,
        221,
        20,
        241,
        73,
        77,
        111
      ]
    },
    "name": "Final cut pro 10.1 Motion 5.1 Compressor 4.1",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 5,
  "peers": 5,
  "last_updated": "2016-12-27T10:02:24.890Z"
}