{
  "title": "Microsoft Office 2016 AIO by roonney",
  "uid": 12526806,
  "size": 3906996224,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:ad791da1e43541492a315c748c2e353545850641&amp;dn=Microsoft+Office+2016+AIO+by+roonney&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 83,
  "leechers": 4,
  "uploader": "zerocoolroot",
  "files": 1,
  "time": 1444076445,
  "description": "Microsoftt Office Pro\r\nCom o Office 2016, a edição de documentos nos softwares de edição Word (texto), PowerPoint (apresentação) e OneNote (notas rápidas) passa a ser feita a várias mãos, que poderão trabalhar ao mesmo tempo. Esse recurso funcionará na versão para desktops.O Office 2016 diminui os conflitos da colaboração, tornando mais fácil compartilhar documentos, trabalhar em conjunto e usar coautoria, mensagens instantâneas, voz e vídeo para realizar tarefas.Produza documentos profissionais rapidamente com sugestões inteligentes, informações e ideias no momento certo....\r\n\r\nMicrosoft Project Pro\r\nPlaneje e gerencie facilmente seus projetos com controles intuitivos e ferramentas de equipe flexíveis para ajudar sua organização a produzir o valor de negócios pretendido.Concentre-se rapidamente no que importa, selecione facilmente ações a serem executadas e procure funções de forma simples, com uma experiência visual avançada.Utilize a nova tela inicial no Project Pro para Office 365 para percorrer as funções básicas de projetos, como organizar e vincular tarefas e criar um cronograma....\r\n\r\nMicrosoft Visio Pro\r\nComece a trabalhar com diagramação rapidamente com um conjunto selecionado de diagramas iniciais pré-elaborados e dicas e truques contextuais.Crie diagramas profissionais rapidamente.Aproveite os 70 modelos internos e milhares de formas que atendem aos padrões do setor, como:\r\nDiagramas de negócios, como fluxograma, cronograma, Diagrama Dinâmico e organograma.Diagramas de processos, como fluxogramas multifuncionais, IDEF0 (Integration Definition for Process Modeling), BPMN (Business Process Model and Notation) 2.0 e fluxos de trabalho do Microsoft SharePoint. Diagramas de TI, como ITIL (biblioteca de infraestrutura de tecnologia da informação), Active Directory, rede detalhada e rack.\r\n\r\n\r\n---------------------------------------------------------------------------\r\n\r\nGOOGLE TRANSLATE.\r\n\r\nMicrosoftt Office Pro\r\nWith Office 2016, editing documents in Word editing software (text), PowerPoint (presentation) and OneNote (Quick Notes) shall be made to a number of hands that can work simultaneously. This feature works in Office 2016 version desktops.O reduces conflicts of collaboration, making it easy to share documents, work together and use co-authoring, instant messaging, voice and video to make tarefas.Produza professional documents quickly with intelligent suggestions, information and ideas at the right time ....\r\n \r\nMicrosoft Project Pro\r\nPlan and manage their projects easily with intuitive controls and flexible team of tools to help your organization produce the business value if pretendido.Concentre quickly on what matters, easily select actions to be performed and look for simple functions, with an experience visual avançada.Utilize the new home screen in Project Pro for Office 365 to scroll through the basic functions of projects, how to organize and link tasks and create a schedule ....\r\n \r\nMicrosoft Visio Pro\r\nGet started with diagramming quickly with a selected set of pre-built initial diagrams and tips and tricks contextuais.Crie professional diagrams rapidamente.Aproveite 70 internal models and thousands of forms that meet industry standards, such as:\r\nBusiness diagrams, such as flow chart, schedule, PivotDiagram and organograma.Diagramas processes such as cross-functional flowcharts, IDEF0 (Integration Definition for Process Modeling), BPMN (Business Process Model and Notation) 2.0 and Microsoft SharePoint workflows. Diagrams, such as ITIL (Information Technology Infrastructure Library), Active Directory, and comprehensive network rack",
  "parsed": {
    "xt": "urn:btih:ad791da1e43541492a315c748c2e353545850641",
    "dn": "Microsoft Office 2016 AIO by roonney",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "ad791da1e43541492a315c748c2e353545850641",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        173,
        121,
        29,
        161,
        228,
        53,
        65,
        73,
        42,
        49,
        92,
        116,
        140,
        46,
        53,
        53,
        69,
        133,
        6,
        65
      ]
    },
    "name": "Microsoft Office 2016 AIO by roonney",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 87,
  "peers": 88,
  "last_updated": "2016-12-25T10:55:09.430Z"
}