{
  "title": "Crusader Kings II v.2.2.02 All DLC Cracked",
  "uid": 11280948,
  "size": 755975801,
  "categoryP": "games",
  "categoryS": "pc",
  "magnet": "?xt=urn:btih:ae724ef9a23965fd4a47c257355e067c6f9b58da&amp;dn=Crusader+Kings+II+v.2.2.02+All+DLC+Cracked&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 102,
  "leechers": 3,
  "uploader": "Nimbleton",
  "files": -1,
  "time": 1414213237,
  "description": "Crusader Kings II v.2.2.02 All DLC Cracked\n\n\nExtract 7zip &amp; play!\n\n\n014-10-XX v2.2.0.2 BETA\n\n\nMAJOR:\n- Disabled the Depose Liege CB and the Weaken Fellow Vassal plots for not working well enough\n- Fixed an issue where adventurers would no longer spawn fleets correctly\n- Tweaked Gavelkind succession to focus more on the current capital duchy region for the primary heir rather than the &quot;preferred&quot; capital\n- Tweaked Gavelkind succession to take no heed of what heirs will inherit from outside your realm\n\nMINOR:\n- Fixed bug where combats with multiple units on one side would always pick the WORST leader for each flank\n- You can now only complete the &quot;Become Exalted Among Men&quot; ambition once per lifetime.\n- Fixed OOS if all players did not reselect their characters after the last player had loaded the save.\n- Tribals will now upgrade towards castle if their liege is feudal and city if their liege is republic.\n- Removed the vassal king opinion penalty.\n- Faction CBs are now invalidated when the liege is in a faction.\n- The Byzantine free revoke on duchies are now in the Imperial Administration law.\n- If the Charlemagne DLC is enabled, the Byzantine free revoke on duchies only applies to Viceroyalties.\n- Fixed bug where the Centralization law was reset to the first level when enabling High Tribal Organization.\n- The viceroyalty status of titles are now reset when the top liege gets the title, instead of just the liege.\n- Lowered the opinion penalty for feudal vassals for granted viceroyalties (was -5 for king viceroys and -2 for duke viceroys, is now -2 for kings and -1 for dukes).\n- Vassals can now grant viceroyalties if their topliege have laws allowing this and they have viceroyalty titles to give away.\n- The viceroyalty flag for titles now resets when the topliege inherits the title, not just the liege.\n- Viceroyalty titles can no longer be given as a normal title to a vassal.\n- Added missing decision icon for offering to help with lieges titles.\n- Minor localization fixes for events.\n- Viceroyalties now provide their lieges with fewer levies.\n- Fixed bug where overridden tribal holdings were not properly removed.\n- The decisions for forming kingdoms and empires now have their succession laws inherited from the base title.\n- Fixed CTD when using the console to increase attributes and the target character was dead.\n- Event when regent is in on plot to lower tribal organization now have the right localization.\n- Crash fixes for total conversion mods when learning scenario characters did not exist.\n- Fixed republican succession where the capital was not a county capital.\n- Tribal buildings now show what castle and city buildings they convert to in their tooltip.\n- Republics now use their succession laws properly for all their titles and not just some of them.\n- Fixed bug where looters were able to siege several holdings in one province simultaneously.\n- Fixed broken calculation of months when determining if the war is undecided.\n- Fixed bug where characters selected before loading a save was still the selected character after the save was loaded.\n- Fixed issue where the exported chronicle showed the wrong year.\n- Fixed bug where chronicle entries were missing from the chronicle.\n- Characters with portraits in the chronicle will no longer be pruned from the database.\n- Fixed bug where filler-entries showed the wrong year.\n- The call all tribal allies tooltip now tells you when you can not call tribal vassals.\n- AI no longer changes viceroyalty laws to handle being over vassal limit.\n- Tribals and pagans can now raid others of the same religion.\n- Triggered modifiers will no longer be added repeatedly and will be removed when no longer valid.\n- Fixed bug where succession laws inherited from viceroyalties defaulted to gavelkind instead of the intended law.\n- It is no longer possible to destroy viceroyalties.\n- Fixed bug where factions to change succession laws were allowed against viceroyalties.\n- When copying laws from viceroyalties, the liege title will be used for copying the laws.\n- Fixed bug where the mongols could enact the open elective law.\n- Viceroyalties can no longer change succession laws.\n- Pressing &quot;G&quot; when having several units selected will now merge the units instead of changning mapmode.\n- Blocked several CB's and plots against viceroyalties.\n- Fixed bug where characters lost the viceroyalty-tag on their titles when they rebelled against their liege.\n- Fixed bug where characters did not lose the viceroyalty-tag when they inherited their top liege title.\n- Forming a merchant republic no longer creates a patrician of your own dynasty vassal.\n- Mercenary costs are now calculated properly before raising them.\n\nMODDING:\n- Added copy_title_laws flag to the create_title effect (yes will copy laws from the base title)\n- The priority_shortcut flag in interface scripts can now be used to define priority shortcuts. Priority shortcuts will fire before any other shortcuts.\n- Added error log message for assigning is_viceroyalty in history where the title is owned by the top liege.\n\n\n2014-10-17 v2.2.0.1 BETA\n\n\nMAJOR:\n- Fixed OOS in multiplayer if all players did not have Charlemagne enabled.\n- Muslims are now more likely to become decadent, especially dynasty members of larger realms.\n- Fixed bug where the Straighten Up decision could be taken again after 7 days.\n- Fixed bug where it was not possible to hand out viceroyalties after reloading the game.\n- Resolved crash when opening war overview window in a revolt war.\n- Fixed crash in law view when republics did not have all patrician slots filled.\n- Fixed bug where the realm capital did not properly use the patrician elective law.\n- Norse fleets can now travel through major rivers as intended.\n- The Adopt Feudalism and Form Merchant Republic decisions are now divided into two part - one that is taken to adopt the new government form and upgrade the capital, and a second one that is taken to upgrade the remaining holdings.\n- Fixed crash while hovering the call all allies button in observer.\n- Tribals now properly get access to crown authority laws when they convert.\n- Solved the CTD on Linux, no more need for -threads=1 workaround\n\nMINOR:\n- Elective Gavelkind: Fixed a bug where claims were not awarded correctly on kingdom split inheritance\n- Optimized message logging in Release builds.\n- Fixed a bug where looter armies just standing around would prevent peace Prestige loss for aggressive pagans\n- AI: Rebalanced raid propensity. Rulers with Prestige loss on peace are now more aggressive\n- AI: Tweaked Prepared Invasion propensity slightly\n- AI: Less likely to answer calls to arms if busy raiding\n- Fixed an issue with exiled characters' destination\n- Added a revenge event for the sons of Lodbrok against Aella\n- It is now possible to see all the laws of your lieges titles in the law view.\n- Fixed exploit where the recently conquered modifier was not properly applied until the day after a holding was conquered.\n- The opinion modifier for vassals for handing out viceroyalties are now only applied to feudal non viceroyals on duke-tier or higher.\n- Fixed bug where the opinion modifier for handing out viceroyalties did not apply for viceroyals in the history files.\n- The empty holdings modifier for garrison and levies are now calculated after the other modifier.\n- Tribal holdings now get less taxes and levies if the province is of the wrong culture or religion.\n- The opinion modifiers for being of the wrong religion is now increased for tribals against their liege.\n- Right click now works on mac when using borderless.\n- Family prestige no longer gives a bonus to vassal limit.\n- The chronicle now closes when pressing escape.\n- Fixed bug where the caliphate title could be given to vassals of the wrong religion, females and characters without the Sayyid or Mirza traits.\n- Fixed bug where the 99% warscore cap was not properly applied in certain wars.\n- Fixed bug where the AI did not end wars when at 100% warscore due to the recipient having previously declined a peace offer.\n- Fixed bug where characters were not properly selected after loading a save if a character was selected before the save was loaded.\n- Children created in ruler designer now properly counts as heirs to your titles.\n- The decision to donate money to the knights templar now have its intended decision icon.\n- Chronicle should now properly show birth of first son even if he has older sisters.\n- Rare event that makes a vassal switch side between Charlemagne and Carloman should now work properly.\n- Saxon Blood Court event no longer gives you the Crusader trait.\n- Prepared Invasions are now enabled for Germanic Pagans with the start of the Viking Age.\n- Added some more Celtic realm names to Britain.\n- Several minor text fixes.\n- Viking Age event is now fully compatible with old save games.\n- Reworked system for Ramadan events. They will no longer pop in a bunch at the same time.\n- Fixed DND-flag and pulled adventurers out of hiding while preparing for a war.\n- Fixed Incorrect alpha for female muslim headgear fixed for the Early Eastern Clothing Pack DLC.\n- Now allowed some more leeway with granting &quot;contested titles&quot; while involved in wars and civil wars\n- Adventurers will no longer accept being invited to your court.\n- It is no longer possible to use the succession changing factions against muslim lieges.\n- Fixed bug where the characters in the era picker were unclickable after going back from custom game setup.\n- Fixed bug where the pagan versions of Coat of Arms were not properly applied to custom created kingdoms and empires.\n- Fixed inconsistencies in credits.\n- Fixed bug where the same plot entry was shown twice in the plot view.\n- Event spawned troops through the councillor jobs are now named Zealots, Raiders and Warriors.\n- Various text fixes.\n- Scottish culture event now properly converts province culture to Scottish.\n- Added missing Romuva holy sites in early start dates.\n- Cleaned up old tech system defines from defines.lua\n- Adopt feudalism decision now require at least one in the Noble Customs technology.\n- Found Merchant Republic decision now require at least one in the Trade Practices technology.\n- It is no longer possible to form custom kingdoms when not being independent.\n- The tribal councillor jobs no longer dissapear when having a regent.\n- Tweaked triggers for Russian and Scottish culture emergence events.\n- Tweaked AI logic for liege converting to capital province culture in some cases.\n- Moved/added new dynasties to several cultures.\n- Changed some early characters in history files from Dutch to Frisian culture.\n- Revised name lists for early East Slavs.\n- Corrected a history database issue where some Saffarid and Kabul Shahi subjects stayed Zunist after being subjugated.\n- Ireland is now tribal in 867.\n- Reduced severity of effects of unused and angry tribal event troops disbanding.\n- Hiding character going celibate now gives spouse and lovers intended opinion modifiers.\n- Adapted some Charlemagne story event triggers to protect against weirdnesses caused by using the ruler designer on major story characters.\n- Changed trigger for Irminsul event to make it more likely to happen.\n- Khazar rulers can now receive Jewish exiles regardless of ruler religion.\n- Christian rivals will no longer reconsider their rivalry against other Christians unless they recently switched religion to Christianity.\n- Pagan feast events reworked and should no longer pop in bunches at the same date.\n- Tweaked triggers for Russian and Scottish culture emergence events.\n- Tweaked AI logic for liege converting to capital province culture in some cases.\n- Moved/added new dynasties to several cultures.\n- Changed some early characters in history files from Dutch to Frisian culture.\n- Revised name lists for early East Slavs.\n- Corrected a history database issue where some Saffarid and Kabul Shahi subjects stayed Zunist after being subjugated.\n- Ireland is now tribal in 867.\n- Reduced severity of effects of unused and angry tribal event troops disbanding.\n- Hiding character going celibate now gives spouse and lovers intended opinion modifiers.\n- Adapted some Charlemagne story event triggers to protect against weirdnesses caused by using the ruler designer on major story characters.\n- Changed trigger for Irminsul event to make it more likely to happen.\n- Fixed issues in CB logic that could result in viewing wrong tooltip\n- Now custom kingdoms instantly dejure drift on formation, however only if the dejure kingdom/empire is not created and if you completly control the titles.\n- Custom kingdoms now cost 300 wealth instead of scaled wealth\n- Custom empires now cost 1000 wealth instead of scaled wealth\n\nMODDING:\n- Event spawned troops with an earmark can now be custom-named by using the earmark key and &quot;_ARMY&quot; or &quot;_ARMY_OF&quot; in the localization.\n- Added define for first year to execute tech, used for optimization, needed for mods.\n\nCONVERTER:\n- Now norse_pagan does not convert to norse_pagan_reformed in converter",
  "parsed": {
    "xt": "urn:btih:ae724ef9a23965fd4a47c257355e067c6f9b58da",
    "dn": "Crusader Kings II v.2.2.02 All DLC Cracked",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "ae724ef9a23965fd4a47c257355e067c6f9b58da",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        174,
        114,
        78,
        249,
        162,
        57,
        101,
        253,
        74,
        71,
        194,
        87,
        53,
        94,
        6,
        124,
        111,
        155,
        88,
        218
      ]
    },
    "name": "Crusader Kings II v.2.2.02 All DLC Cracked",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 105,
  "peers": 12,
  "last_updated": "2016-12-25T11:01:28.565Z"
}