{
  "title": "Rosetta Stone TOTALe 5.0.37.43113",
  "uid": 12558701,
  "size": 228619032,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:afe990d4890d60165c62c126d9d8bc8e889350b1&amp;dn=Rosetta+Stone+TOTALe+5.0.37.43113&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 40,
  "leechers": 1,
  "uploader": "jovo_bih",
  "files": 1,
  "time": 1444674958,
  "description": "*********************************\r\nRosetta Stone TOTALe 5.0.37.43113\r\n*********************************\r\n\r\nLearn a language naturally with Dynamic Immersion? The Rosetta Stone language program aims to make learning easier and more effective by scrapping dense explanations in favor of a visual teaching style featuring pictures, audio and text. The Rosetta Stone language program aims to make learning easier and more effective by scrapping dense explanations in favor of a visual teaching style featuring pictures, audio and text.\r\n\r\nThe product’s teaching method attempts to emulate the experience of a native-born speaker by immersing you in one of 29 languages using photos, spoken phrases and written words.\r\n\r\nTraining course of any language begins the same way – you will be asked to learn key words like &quot;man&quot; &quot;woman&quot; &quot;boy&quot; &quot;girl&quot;. And most of the rest of the words you will already know from the context. For example, you will see a man eating and a woman with a glass of water and write &quot;The man is eating&quot;, &quot;The woman is drinking&quot;. Then you have to make out a dozen combinations of old and new words – so, according to the authors, there is a fixing material. In any case, intuition and visual perception make up about 80% in the method Rosetta Stone.\r\n\r\n*****************************************************************\r\nAll tasks in the Rosetta Stone can be divided into several groups\r\n*****************************************************************\r\n\r\n- Finding the right pictures for phrases. Here you need the mouse to choose the desired picture.\r\n- The selection of suitable sentences for pictures. Here you will be shown several options from which you need to click on correct. Green buttons will allow you to once again listen to how it sounds each replica.\r\n- Job on pronunciation. You will be asked to repeat each list of words, and will give you just two attempts.\r\n- Grammar tasks. Here you need to insert the appropriate meaning of the word in correct form\r\n\r\nThe examination is held at the end of each topic in the form of a slideshow that illustrates some life situation. All your answers need to be spoken, and you don't show any text that you want to say – you have to guess what phrase is appropriate to say at the moment. Unlike conventional lessons, to affect the order of the exam is impossible – it is passed strictly from beginning to end, to return to some of its tasks impossible.\r\n\r\n***************************************\r\nNew Features in Rosetta Stone v5 TOTALe\r\n***************************************\r\n\r\n– Updated vocabulary\r\n– Updated photos\r\n– Brand new games\r\n– Improved compatibility with new operating systems\r\n– Updated language packs to fix language errors\r\n– Miscellaneous fixes/updates\r\n– New Interface\r\n\r\n*********\r\nTechnical\r\n*********\r\nSystem requirements: Windows 7, 8 or higher\r\n\r\nComputer Hardware (all of the following):\r\n\r\n- 2.33GHz or faster x86-compatible processor or\r\n- Intel® Atom™ 1.6GHz or faster processor for netbooks\r\n- 1 GB of RAM or higher\r\n- 3 GB free hard-drive space (per level)\r\n- 1024 x 768 display resolution\r\n- Broadband Internet connection\r\n- 1 available port for a headset with microphone\r\n\r\nHomepage:\n\r\n************************\r\nIncluded in this torrent\r\n************************\r\n\r\n- MUST READ Install file containing detailed installation instructions (please follow instructions very carefully)\r\n- Direct download links for available Language courses and their updates (all levels): English American, English British, French, German, Italian, Spanish Spain, Spanish Latin America, Russian, Arabic, Chinese, Dutch, Persian Farsi, Filipino, Greek, Hebrew, Hindi, Irish, Japanese, Korean, Polish, Portuguese, Swedish, Turkish, Vietnamese",
  "parsed": {
    "xt": "urn:btih:afe990d4890d60165c62c126d9d8bc8e889350b1",
    "dn": "Rosetta Stone TOTALe 5.0.37.43113",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "afe990d4890d60165c62c126d9d8bc8e889350b1",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        175,
        233,
        144,
        212,
        137,
        13,
        96,
        22,
        92,
        98,
        193,
        38,
        217,
        216,
        188,
        142,
        136,
        147,
        80,
        177
      ]
    },
    "name": "Rosetta Stone TOTALe 5.0.37.43113",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 41,
  "peers": 98,
  "last_updated": "2016-12-25T11:10:00.229Z"
}