{
  "title": "MakeMusic Finale 2014 with Samples Data (keygen R2R) [ChingLiu]",
  "uid": 9151829,
  "size": 1739317283,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:b02cb9aee3d6801e3b95f8cb5f370ef8634b551e&amp;dn=MakeMusic+Finale+2014+with+Samples+Data+%28keygen+R2R%29+%5BChingLiu%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 66,
  "leechers": 5,
  "uploader": "Ching_Liu",
  "files": -1,
  "time": 1383708397,
  "description": "New Features in Finale 2014\n\n- New file format. Designed to improve compatibility, the new format for documents created in Finale helps you share your music more easily. Older Finale documents are automatically converted when you open them, and you will be prompted to save the file in the new format. You can also export your document to the older format for use in Finale 2012 (use MusicXML for earlier versions of Finale).\n- Keyless scores. Create scores or sections with no key signature. You can also easily hide key signatures and continue to automatically display accidentals using the Hide key signature/Show accidentals option.\n- Beat-attached Smart Shapes. Smart Shapes that previously attached to measures now attach to beats (in the same manner as expressions) with lines showing the attachment point. Beat attachment allows a Smart Shape start or end point to attach to a particular note, beat, or right barline. Affected Smart Shapes include hairpins, trills and trill extensions, 8va/8vb (ottava/ottava bassa), horizontal brackets, and lines.\n- Smart multi-layer accidental and rest handling. Rests of the same duration and accidentals on unison notes in multiple layers now are displayed only once. Accidentals in one layer are also carried through the measure for all other layers (these can optionally be displayed in Staff Attributes or Staff Styles).\n- Improved percussion functionality. There is now greater interaction between the Percussion Layout Designer and Percussion MIDI Maps, and Percussion MIDI Maps can now be removed.\n- Unlinkable Special Tools. Alterations made with any of the Special Tools are now unlinkable between a score and its parts.\n- MP4 support. Finale now supports loading MP4 videos.\n- Improved Scanning/SmartScore Lite Enhancements. Finale now includes SmartScore Lite version X2, offering improved notation recognition.\n- New ARIA Player. Finale includes the latest ARIA Player from Garritan, with more than 400 instruments including the additions of alto flute, bass flute, oboe d'amore, Eb clarinet, contrabass clarinet, piccolo trumpet, tubular bells, string harmonics, percussion &quot;toys&quot;, orchestral brass mutes, flugelhorn, basic African percussion, steel drums, banjo, fife, tablas, Celtic harp, and nine patches from Garritan Instant Orchestra.\n- Improvements to opening files. Finale displays all readable file types in the Open dialog box. Additionally, MusicXML files can now be dragged-and-dropped onto the Finale application.\n- New method for Finale updates. At launch, Finale automatically checks for updates. Instead of requiring you to download and install the updates manually from the Finale website, Finale now downloads and installs the updates automatically.\n\nSystem Requirements\n\n- XP/Vista/Windows 7/Windows 8 (64-bit compatible)\n- Intel Core 2 Duo or AMD Athlon, Intel i3 or AMD Athlon II X2 and above recommended\n- 2 GB of RAM, 4 GB or above recommended\n- 800X600 minimum monitor resolution, 1366Ã—768 and above recommended\n- Internet connection for download install or DVD-ROM drive for DVD install\n- 600MB hard drive space required for software and user manual with an additional 2GB hard drive space is required for Garritan Instruments for Finale\n\nLanguage : English\n\nHomepage :  &lt;a href=&quot;\nhttp://www.finalemusic.com/products/finale/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.finalemusic.com/products/finale/&lt;/a&gt;",
  "parsed": {
    "xt": "urn:btih:b02cb9aee3d6801e3b95f8cb5f370ef8634b551e",
    "dn": "MakeMusic Finale 2014 with Samples Data (keygen R2R) [ChingLiu]",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "b02cb9aee3d6801e3b95f8cb5f370ef8634b551e",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        176,
        44,
        185,
        174,
        227,
        214,
        128,
        30,
        59,
        149,
        248,
        203,
        95,
        55,
        14,
        248,
        99,
        75,
        85,
        30
      ]
    },
    "name": "MakeMusic Finale 2014 with Samples Data (keygen R2R) [ChingLiu]",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 71,
  "peers": 67,
  "last_updated": "2016-12-25T11:12:04.701Z"
}