{
  "title": "Introduction to Computation and Programming Using Python- Revise",
  "uid": 10643081,
  "size": 14373491,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:b038738d4e4e9891142fca67dec3e92a5a253ffc&amp;dn=Introduction+to+Computation+and+Programming+Using+Python-+Revise&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 81,
  "leechers": 2,
  "uploader": "steelballz",
  "files": -1,
  "time": 1406504324,
  "description": "Description\nIntroduction to Computation and Programming Using Python, Revised\nAuthor:Guttag, John V.\nPublisher and Published Date:The MIT Press; revised and expanded edition edition (Aug. 9 2013)\nISBN-10:0262525003\nISBN-13:9780262525008\nFormat: Retail PDF\nReader Required: Adobe Acrobat\n\n\nDon't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss. Please allow a couple\nseconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\nIt should also be noted that any reference to any dvd, cd, or any other dlc or extra content in this, or any other torrent I upload, is not available in the torrent unless I state otherwise. If you want the extras, buy the product\nThis PDF is encrypted! This encryption will NOT interfere with opening, printing, or copying the PDF. It will only prevent editing of the PDF. I have my reasons for it. If you have questions pm me through my acct on KAT\nIf you do have difficulties opening this file while running a Linux OS, try opening in windows or mac using Adobe Acrobat. If you still can't open, pm me and I'll investigate.\n\n\nimage\nCover from actual book file\n\n\nProduct Description\n\n\nThis book introduces students with little or no prior programming experience to the art of computational problem solving using Python and various Python libraries, including PyLab. It provides students with skills that will enable them to make productive use of computational techniques, including some of the tools and techniques of &quot;data science&quot; for using computation to model and interpret data. The book is based on an MIT course (which became the most popular course offered through MIT's OpenCourseWare) and was developed for use not only in a conventional classroom but in a massive open online course (or MOOC) offered by the pioneering MIT-Harvard collaboration edX.\n\nStudents are introduced to Python and the basics of programming in the context of such computational concepts and techniques as exhaustive enumeration, bisection search, and efficient approximation algorithms. The book does not require knowledge of mathematics beyond high school algebra, but does assume that readers are comfortable with rigorous thinking and not intimidated by mathematical concepts. Although it covers such traditional topics as computational complexity and simple algorithms, the book focuses on a wide range of topics not found in most introductory texts, including information visualization, simulations to model randomness, computational techniques to understand data, and statistical techniques that inform (and misinform) as well as two related but relatively advanced topics: optimization problems and dynamic programming. Introduction to Computation and Programming Using Python can serve as a stepping-stone to more advanced computer science courses, or as a basic grounding in computational problem solving for students in other disciplines.\n\n\n\nimage\nScientia est potentia",
  "parsed": {
    "xt": "urn:btih:b038738d4e4e9891142fca67dec3e92a5a253ffc",
    "dn": "Introduction to Computation and Programming Using Python- Revise",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "b038738d4e4e9891142fca67dec3e92a5a253ffc",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        176,
        56,
        115,
        141,
        78,
        78,
        152,
        145,
        20,
        47,
        202,
        103,
        222,
        195,
        233,
        42,
        90,
        37,
        63,
        252
      ]
    },
    "name": "Introduction to Computation and Programming Using Python- Revise",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 83,
  "peers": 49,
  "last_updated": "2016-12-25T11:12:18.763Z"
}