{
  "title": "Data Mining - Practical Machine Learning Tools and Techniques.pd",
  "uid": 11712187,
  "size": 7003719,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:b079e17a35a285c4a7b4a2035c2bbcf5fac66f24&amp;dn=Data+Mining+-+Practical+Machine+Learning+Tools+and+Techniques.pd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 44,
  "leechers": 0,
  "uploader": "GoonerTPB",
  "files": 1,
  "time": 1424381536,
  "description": "Publisher: Morgan Kaufmann Publishers Inc.; 3 edition (1 Jan. 2011)\nLanguage: English\nISBN-10: 0123748569\nISBN-13: 978-0123748560\n\nData Mining: Practical Machine Learning Tools and Techniques offers a thorough grounding in machine learning concepts as well as practical advice on applying machine learning tools and techniques in real-world data mining situations. This highly anticipated third edition of the most acclaimed work on data mining and machine learning will teach you everything you need to know about preparing inputs, interpreting outputs, evaluating results, and the algorithmic methods at the heart of successful data mining.\n\nThorough updates reflect the technical changes and modernizations that have taken place in the field since the last edition, including new material on Data Transformations, Ensemble Learning, Massive Data Sets, Multi-instance Learning, plus a new version of the popular Weka machine learning software developed by the authors. Witten, Frank, and Hall include both tried-and-true techniques of today as well as methods at the leading edge of contemporary research.\n\n\n\n*Provides a thorough grounding in machine learning concepts as well as practical advice on applying the tools and techniques to your data mining projects *Offers concrete tips and techniques for performance improvement that work by transforming the input or output in machine learning methods *Includes downloadable Weka software toolkit, a collection of machine learning algorithms for data mining tasks-in an updated, interactive interface. Algorithms in toolkit cover: data pre-processing, classification, regression, clustering, association rules, visualization",
  "parsed": {
    "xt": "urn:btih:b079e17a35a285c4a7b4a2035c2bbcf5fac66f24",
    "dn": "Data Mining - Practical Machine Learning Tools and Techniques.pd",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "b079e17a35a285c4a7b4a2035c2bbcf5fac66f24",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        176,
        121,
        225,
        122,
        53,
        162,
        133,
        196,
        167,
        180,
        162,
        3,
        92,
        43,
        188,
        245,
        250,
        198,
        111,
        36
      ]
    },
    "name": "Data Mining - Practical Machine Learning Tools and Techniques.pd",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 25,
  "peers": 73,
  "last_updated": "2016-12-27T10:24:37.756Z"
}