{"title":"Cracking the Coding Interview, 6th Edition (PDF)","uid":15019184,"size":92107420,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b14c474156abc6b675ae59b16167f7949d8de078&amp;dn=Cracking+the+Coding+Interview%2C+6th+Edition+%28PDF%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":45,"leechers":0,"uploader":"JCJeff","files":1,"time":1466462388,"description":"Title: Cracking the Coding Interview, 6th Edition: 189 Programming Questions and Solutions\r\nAuthor: Gayle Laakmann McDowell\r\nPublisher: CareerCup\r\n\r\nISBN-10: 0984782850\r\nISBN-13: 978-0984782857\r\n\r\nDescription:\r\nI am not a recruiter. I am a software engineer. And as such, I know what it's like to be asked to whip up brilliant algorithms on the spot and then write flawless code on a whiteboard. I've been through this as a candidate and as an interviewer. \r\n\r\nCracking the Coding Interview, 6th Edition is here to help you through this process, teaching you what you need to know and enabling you to perform at your very best. I've coached and interviewed hundreds of software engineers. The result is this book.\r\n\r\nLearn how to uncover the hints and hidden details in a question, discover how to break down a problem into manageable chunks, develop techniques to unstick yourself when stuck, learn (or re-learn) core computer science concepts, and practice on 189 interview questions and solutions.\r\n\r\nThese interview questions are real; they are not pulled out of computer science textbooks. They reflect what's truly being asked at the top companies, so that you can be as prepared as possible. WHAT'S INSIDE?\r\n\r\n- 189 programming interview questions, ranging from the basics to the trickiest algorithm problems.\r\n \r\n- A walk-through of how to derive each solution, so that you can learn how to get there yourself.\r\n\r\n- Hints on how to solve each of the 189 questions, just like what you would get in a real interview.\r\n\r\n- Five proven strategies to tackle algorithm questions, so that you can solve questions you haven't seen.\r\n\r\n- Extensive coverage of essential topics, such as big O time, data structures, and core algorithms.\r\n\r\n- A behind the scenes look at how top companies like Google andhire developers.\r\n\r\n- Techniques to prepare for and ace the soft side of the interview: behavioral questions.\r\n\r\n- For interviewers and companies: details on what makes a good interview question and hiring process","torrent":{"xt":"urn:btih:b14c474156abc6b675ae59b16167f7949d8de078","amp;dn":"Cracking+the+Coding+Interview%2C+6th+Edition+%28PDF%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b14c474156abc6b675ae59b16167f7949d8de078","infoHashBuffer":{"type":"Buffer","data":[177,76,71,65,86,171,198,182,117,174,89,177,97,103,247,148,157,141,224,120]},"announce":[],"urlList":[]}}