{
  "title": "ESET Endpoint Antivirus 5.0.2242 (x86/x64)  (menin)",
  "uid": 11884817,
  "size": 147725996,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:b25b4d2479df7c8a11eb365b12fd0e381e133df5&amp;dn=ESET+Endpoint+Antivirus+5.0.2242+%28x86%2Fx64%29++%28menin%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 53,
  "leechers": 2,
  "uploader": "menin1",
  "files": 1,
  "time": 1430807215,
  "description": "Protect critical company data one computer at a time with proven detection technology trusted by over 100 million users. Now even better, smarter detection. Time-tested antivirus and antispyware protection utilizing advanced technologies such as cloud-powered scanning, device control and remote manageability of all endpoints.\n\n\nEndpoint Protection:\nProtect company networks with proven Antivirus, antispyware and advanced device control functionality. Rely on a solution that minimizes system slowdowns and comes with a broad range of customization options.\n\nRemote Administration:\nOversee security across the entire network from a single location. Enlist a range of customization and reporting features to tweak the system security as you need.\n\nNetwork Speed and Stability:\nLoad-balance execution of tasks to prevent overloading network connections and antivirus storm on VM hosts. Choose from improved update options update mirror server via HTTPS connection or revert to older virus database and modules.\n\nReports, Logs &amp; Notifications:\nMonitor network security status and server load statistics even from outside of your company. Perform data parsing via compatible data formats or designate critical threshold for event notification, set up notifications priority and much more.\n\nEndpoint Protection:\nKeep company endpoints free of malware with ESET cloud-powered scanning technology. Utilize the device control functionality to keep unauthorized USBs and CDs off company machines.\n\nEmployee Effectiveness:\nKeep company computers running smoothly and extend the lifetime of hardware thanks low system demands. Keep out distractions like pop-ups during presentations or slideshows.\n\nAdministrator Effectiveness:\nManage all past, present and future ESET security solutions from a single location, putting admins in perfect control of network security.\n\nReporting:\nKeep admins abreast of network security from outside the company. Take advantage of advanced monitoring and reporting tools for complete oversight and to take immediate action.\n\nUpdate Management:\nAll ESET solutions are built to preserve network speed and stability and smooth and reliable operation and come with a range of tools and customization options to ensure a consistent level of security.\n\nWhat's new in version 5.0.2242:\n\n-Fixed: BSOD when powering off computer with specific software installed on Windows XP\n-Fixed: Scheduled task that should be triggered by detection does not run\n-Fixed: Interactive firewall windows appear even though Policy based mode is applied from ERA\n-Fixed: Firewall rules return to default occasionally\n-Fixed: Some devices are not recognized when Device control is enabled\n\nInstructions:\n\nRead info for intrustions",
  "parsed": {
    "xt": "urn:btih:b25b4d2479df7c8a11eb365b12fd0e381e133df5",
    "dn": "ESET Endpoint Antivirus 5.0.2242 (x86/x64)  (menin)",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "b25b4d2479df7c8a11eb365b12fd0e381e133df5",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        178,
        91,
        77,
        36,
        121,
        223,
        124,
        138,
        17,
        235,
        54,
        91,
        18,
        253,
        14,
        56,
        30,
        19,
        61,
        245
      ]
    },
    "name": "ESET Endpoint Antivirus 5.0.2242 (x86/x64)  (menin)",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 55,
  "peers": 5,
  "last_updated": "2016-12-25T11:25:53.572Z"
}