{
  "title": "Prototype-Razor1911 FULL PC ISO MAX",
  "uid": 5136382,
  "size": 7972037817,
  "categoryP": "games",
  "categoryS": "pc",
  "magnet": "?xt=urn:btih:b2ef89e2973bede735d67631dfb864f3b61a7259&amp;dn=Prototype-Razor1911+FULL+PC+ISO+MAX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 193,
  "leechers": 48,
  "uploader": "extremezone",
  "files": -1,
  "time": 1256508875,
  "description": "Prototype-Razor1911 FULL PC ISO MAX\n\nYear: 2009\nGenres: Action (Shooter) / 3D / 3rd Person\nDeveloper: Radical Entertainment\nPublisher: Activision\nPlatform: PC\n\nSystem requirements:\n# OS: Windows XP (with Service Pack 3) and DirectX 9.0c or (Windows Vista with Service Pack 2)\n# Video Card: 256 MB 3D hardware accelerator card required - 100% DirectX 9.0c with Shader Model 3 support *\n# Processor: Pentium Intel Core 2 Duo 2.6 GHz or AMD Athlon 64 X2 3800 + or better\n# RAM: 1 GB of RAM for Windows XP / 2 GB Windows Vista systems\n# Hard Drive Space: 8 GB of uncompressed hard disk space (Plus 500MB for swap file.)\n# Sound Card: DirectX 9.0-compliant sound card\n# DVD-ROM: DVD-ROM\n\nType of publication: license\nLanguage: MULTI4\nTablet: the presence of\n\nDescription: Who am I and who turned me into a car to kill? To find the answers to these difficult questions, the main character Alex Mercer PROTOTYPE must survive in a brutal battle kromeshnom hell. You can look at the world through the eyes of merciless mutant, devoid of memory, and living alone, the thirst for vengeance to those who transformed it into a monster. Your path will face many obstacles, but none of them are not able to stop the powerful antigeroya. Destroy, blow up, kill and get to the truth at any cost! At your disposal are a truly unique capability. Alex does not know anything about his past, but wholly owned by this. Ruthlessly destroying anyone who becomes a nuisance, he assigns his memories and skills, becoming more powerful. He - a prototype of inhumane weapons, created by unknown and unclear for what purpose. Battling on two fronts - the professional military and the infected mutants, a hero with your help to unravel the plot and make the guilty pay off the account.\n\nFeatures:\n# The streets of New York. The action takes place in contemporary New York, overcrowded vehicles and people. A living city is responding to the shooting pain and bloody fights. When the battle begins, around the reign chaos and panic. In this metropolis designed to the smallest detail and has an impressive territory, as for the fights with some bosses you need to space the size of Manhattan ...\n# Bandwidth constraints. Alex moves around the city, using the methods of Parkour. As the hero - much more than just people, insurmountable obstacles for him did not exist. Jump over the machine, run on the vertical walls of skyscrapers, jumping on the enormous distances - thanks to their unusual abilities, you can overcome any obstacle.\n# The absolute weapon. Alex literally absorbs abilities and Ã‚Â«physical essenceÃ‚Â» of each prostrate enemy, becoming more powerful. Over time, he turns his own body into an absolute weapon with huge claws, sharp blades, overstrength skin and other biological devices.\n# The death and destruction. You A?8;0E plunge New York into chaos. Spread to the entire detachments of enemies, sow panic and destroy everything around with the help of heavy artillery - tanks Ã‚Â«AbramsÃ‚Â» and helicopters Ã‚Â«ApacheÃ‚Â» .* At the height of technology. The basis PROTOTYPE is a new graphics engine Titanium, Developed by Radical Entertainments. It allows on-screen entertainment and large-scale fighting, and supports high technology Neural 7.1 Surround Sound.\n\n\nRazor 1911 proudly presents:\nPrototype\n(C) Activision\n\nDate: 2009-06-09 Game Type : Action\nSize: 1 DVD Protection: SecuROM\n\nGame Notes\n\nYou are the PROTOTYPE, Alex Mercer, hiding in human form. You step out onto\nthe streets of New York with no memory, but limitless power. As a terrifying\nviral epidemic sweeps across Manhattan, top-secret Black Watch Special\nForces move in, transforming it into a war zone. Delve into the mysteries of\nyour origin, the true nature of your power and your part in a conspiracy 40\nyears in the making\n\nInstall Notes\n\n1. Mount or Burn image\n2. Install\n3. Copy crack to install dir\n4. Have Fun!\n\nRazor 1911 Greetings\n\nStop dumping VM's Save the whales\n\nRazor 1911 / Since 1985\n/\n\nSUPPORT THE COMPANIES THAT PRODUCE QUALITY SOFTWARE\nIF YOU ENJOYED THIS PRODUCT, BUY IT SOFTWARE AUTHORS DESERVE SUPPORT",
  "parsed": {
    "xt": "urn:btih:b2ef89e2973bede735d67631dfb864f3b61a7259",
    "dn": "Prototype-Razor1911 FULL PC ISO MAX",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "b2ef89e2973bede735d67631dfb864f3b61a7259",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        178,
        239,
        137,
        226,
        151,
        59,
        237,
        231,
        53,
        214,
        118,
        49,
        223,
        184,
        100,
        243,
        182,
        26,
        114,
        89
      ]
    },
    "name": "Prototype-Razor1911 FULL PC ISO MAX",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 275,
  "peers": 50,
  "last_updated": "2016-12-27T10:39:26.172Z"
}