{
  "title": "Torchlight.II-RELOADED",
  "uid": 7656433,
  "size": 1692511990,
  "categoryP": "games",
  "categoryS": "pc",
  "magnet": "?xt=urn:btih:b32e95c5d69a5e4e2da9d7558d2fd2aca6318a87&amp;dn=Torchlight.II-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 60,
  "leechers": 7,
  "uploader": "Mr.Stifmeister",
  "files": -1,
  "time": 1348170129,
  "description": "Torchlight 2 (c) Runic games\n\n09/2012 :..... RELEASE.DATE .. PROTECTION .......: Steam\n1 :.......... DISC(S) .. GAME.TYPE ........: Diablo Clone\n\n\nThe award-winning action RPG is back, bigger and better than ever!\nTorchlight II takes you back into the quirky, fast-paced world of\nbloodthirsty monsters, bountiful treasures, and sinister secrets - and, once\nagain, the fate of the world is in your hands!\n\nTorchlight II captures all the flavor and excitement of the original game -\nwhile expanding the world and adding the features players wanted most,\nincluding online and LAN co-op multiplayer. Torchlight II is fast, fun,\nand filled to the brim with action and loot. Adventure solo or online with\nyour friends!\n\nKey Features:\nMultiplayer - Play co-op with your friends via LAN or over the Internet for\nfree. No subscriptions, no item sales. Our new matchmaking service lets you\nfind friends, start new games, and join existing games. And, as always, you\ncan play single-player offline as well.\n\nCustomizable Characters - Players will create and customize a character from\none of four brand new classes. Each class can be played as either male or\nfemale, with customized cosmetic features and looks to make each individual\ncharacter stand out. All new skills and loot give loads of opportunity for\nunique character builds.\n\nModdability - TorchED, the Torchlight II editor, will give players the\nability to create their own mods, adding even more content to the world.\nHave your friends download the same mod and play together. TorchED will be\navailable as a separate download very shortly after launch.\n\nNew User Interface - Torchlight II boasts a new and improved user interface,\ndesigned to be easier than ever for new players to pick up and play. This\nintuitive interface ensures you can focus on playing the game the way you\nwant to.\n\nOpen World - We're not only in the town of Torchlight anymore! Explore vast\noverland areas and multiple hub towns, fight through rain, snow, day and\nnight. Our level randomization ensures new layouts, paths, loot, and\nmonsters every time you play.\n\nNew Game Plus - In New Game Plus, the game's not over until you say it is.\nOnce you've beaten Torchlight II's primary campaign, you can start again\nwith the same character for a significantly greater challenge. You'll keep\nall of the skills, gold, and gear you worked so hard for!\nPets &amp; Fishing - These popular features make their return in Torchlight II\nin improved form. More choices, better effects, and your pet will still\nmake the run to town to sell your loot so you dont have to.\n\n\n\n1. Unrar.\n2. Burn or mount the image.\n3. Install the game.\n4. Copy over the cracked content.\n5. Play the game.\n6. Support the software developers. If you like this game, BUY IT!\n\n\n ",
  "parsed": {
    "xt": "urn:btih:b32e95c5d69a5e4e2da9d7558d2fd2aca6318a87",
    "dn": "Torchlight.II-RELOADED",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "b32e95c5d69a5e4e2da9d7558d2fd2aca6318a87",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        179,
        46,
        149,
        197,
        214,
        154,
        94,
        78,
        45,
        169,
        215,
        85,
        141,
        47,
        210,
        172,
        166,
        49,
        138,
        135
      ]
    },
    "name": "Torchlight.II-RELOADED",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 67,
  "peers": 96,
  "last_updated": "2016-12-25T11:31:06.484Z"
}