{
  "title": "Everybody Hates Chris complete season 1-4",
  "uid": 5369673,
  "size": 16127756661,
  "categoryP": "video",
  "categoryS": "tv_shows",
  "magnet": "?xt=urn:btih:b46641893348c97d5e133940c835af774a0728d2&amp;dn=Everybody+Hates+Chris+complete+season+1-4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 41,
  "leechers": 22,
  "uploader": ".BONE.",
  "files": -1,
  "time": 1266383866,
  "description": "Motivated by his childhood experiences, Emmy Award-winner/actor/comedian Chris Rock narrates this very hilarious and touching story of a teenager growing up as the oldest of three children in Brooklyn, NY, in 1982. 1982 is the year that Chris (Tyler James Williams) turns 13. Filled with dreams of being a cool teenager, Chris moves with his family from the projects to the &quot;Bed-Stuy: Do or Die&quot; neighborhood. As the family's emergency adult while his parents are working, he's responsible for taking care of his younger brother Drew (Tequan Richmond), who's taller and more confident than Chris, and sister Tonya (Imani Hakim), who gets all the parents' attention. Chris' rough, cost-conscious father Julius (Terry Crews) works numerous jobs to properly support his family. Sassy mom Rochelle (Tichina Arnold) runs the household on a tight budget, is very strict, and works part-time in a small real estate office. With his mom determined to see him in a good school, though Drew and Tonya go to the same school in their old neighborhood, Chris reluctantly faces multiple bus transfers every day to attend Corleone Junior High in the fiercely Italian neighborhood, South Shore. Despite being an immediate target for bullies, Chris' innate charm and sharp wit enable him to make new friends, like Greg (Vincent Martella), another smart, nice kid... who can't fight, by the way. As Chris Rock pointedly looks back, his younger self is set to find what his family already knows: Chris' sharp, scrappy character is going to take him places. But first, he's going to have to think, talk, or run his way through one growing experience after another at home and school... and on any number of buses along the way &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0460637/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0460637/&lt;/a&gt;",
  "parsed": {
    "xt": "urn:btih:b46641893348c97d5e133940c835af774a0728d2",
    "dn": "Everybody Hates Chris complete season 1-4",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "b46641893348c97d5e133940c835af774a0728d2",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        180,
        102,
        65,
        137,
        51,
        72,
        201,
        125,
        94,
        19,
        57,
        64,
        200,
        53,
        175,
        119,
        74,
        7,
        40,
        210
      ]
    },
    "name": "Everybody Hates Chris complete season 1-4",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 132,
  "peers": 123,
  "last_updated": "2016-12-27T10:48:23.817Z"
}