{
  "title": "HDD Regenerator 2011 Incl Crack [TorDigger]",
  "uid": 9192291,
  "size": 12155502,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:b4e47f069427d712085760dcf7c2abe9e2fcdef8&amp;dn=HDD+Regenerator+2011+Incl+Crack+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 259,
  "leechers": 2,
  "uploader": "TorDigger",
  "files": 13,
  "time": 1384414492,
  "description": "HDD Regenerator\n\nHard disk drive is an integral part of every computer. It stores all your information. One of the most prevalent defects of hard drives is bad sectors on the disk surface. Bad sectors are a part of the disk surface which contains not readable, but frequently necessary information. As a result of bad sectors you may have difficulties to read and copy data from your disk, your operating system becomes unstable and finally your computer may unable to boot altogether. When a hard drive is damaged with bad sectors, the disk not only becomes unfit for use, but also you risk losing information stored on it. The HDD Regenerator can repair damaged hard disks without affecting or changing existing data. As a result, previously unreadable and inaccessible information is restored.\n\nProgram features:\n\nFast hard drive problems detection.\n-Ability to detect physical bad sectors on a hard disk drive surface.\n-Ability to repair bad sectors (magnetic errors) on a hard disk surface using Hysteresis loops generator.*\n\nNo data losses in any mode!\n\nCorrupted data recovery (making unreadable data readable)\n-User friendly intuitive interface\n\nEasy to use, no complex settings. You do not need to change a lot of complicated and unnecessary settings. We have already set up the product for you for best performance and results.\n-The product ignores file system, scans disk at physical level. It can be used with FAT, NTFS or any other file system, and also with unformatted or unpartitioned disks.\n-Drive statistics\n-Starting process directly under Windows XP/Vista/ 7 / 8\n\nBootable regenerating flash can be created from the program and used to automatically start regenerating process.\n-Bootable regenerating CD / DVD allows starting regenerating process under DOS automatically.\n-Working with any existing file system without losses of any data\n-Working with any operating system without losses of any data (bootable regenerating CD / DVD or flash should be used for non-Windows operating systems)\n\nPrescan mode (very useful for fast determination of bad sectors location, if a hard drive has a large number of bad sectors. Saves your time. Bad hard drives are scanned in this mode even faster than good drives!)\n-Normal scan mode has faster scanning speed\n-4K sector size support\n\nAutomatic process resume in any mode (except CD/DVD)\n-Multiple hard drives better support\n\nReal-time hard drive status monitor. HDD Regenerator realtime monitor is more poweful and precise than ever in timely prediction of hard drive problems.\n\nSupported OS:\n\nWindows XP/Vista/ 7 / 8\n\nHomepage: http://www.dposoft.net/hdd.html\n\nInstallation Instructions: \n\n- Install program.\n- Copy content from crack folder and paste into default installation directory.\n- Register Application with given serial/name.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.",
  "parsed": {
    "xt": "urn:btih:b4e47f069427d712085760dcf7c2abe9e2fcdef8",
    "dn": "HDD Regenerator 2011 Incl Crack [TorDigger]",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "b4e47f069427d712085760dcf7c2abe9e2fcdef8",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        180,
        228,
        127,
        6,
        148,
        39,
        215,
        18,
        8,
        87,
        96,
        220,
        247,
        194,
        171,
        233,
        226,
        252,
        222,
        248
      ]
    },
    "name": "HDD Regenerator 2011 Incl Crack [TorDigger]",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 50,
  "peers": 209,
  "last_updated": "2016-12-27T10:51:20.369Z"
}