{"title":"The.Chronicles.of.Riddick.Assault.on.Dark.Athena.[Updated.Crack]","uid":10676478,"size":4542620933,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b7e8a8409d5630d153709682c5a15281ac897305&amp;dn=The.Chronicles.of.Riddick.Assault.on.Dark.Athena.%5BUpdated.Crack%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":73,"leechers":12,"uploader":"Taker009","files":-1,"time":1406954971,"description":"The.Chronicles.of.Riddick.Assault.on.Dark.Athena.[Updated.Crack].Repack-R.G.Mechanics\n\n\n\n\n\nRelease Info:\n\nYear: 2009\nGenre: Action (Shooter) / 3D / 1st Person / 3rd Person / Stealth\nDeveloper: Starbreeze Studios and Tigon Studios\nPublisher: Atari\nPublication Type: RePack\nGame Language: Eng |Rus\nVoice Language: Eng |Rus\nCrack: Included [ENPY Studio v1.10]\n\n\n\n\nSystem Requirements:\n\nOperating system: Windows XP, Windows Vista, Windows 7\nProcessor: Intel Pentium D 805 or AMD Athlon X2 3800+\nMemory: 1 GB (XP) / 2 GB (Vista)\nVideo: Ati Radeon HD 2600 XT or Nvidia Geforce 6800 Ultra\nSound Card: Sound device compatible with DirectX 9.0\nFree hard drive space: 9 GB\n\nGame information:\n\n\nThe collection contains both the original The Chronicles of Riddick:\nEscape From Butcher Bay, and the continuation of this amazing stealth\naction Â«Chronicles of Riddick: Assault on Dark AthenaÂ»! In the Escape\nFrom Butcher Bay you are in prison maximum security Butcher Bay,\nlocated on a remote penal colony for extraterrestrial. No prisoner\nhad never been able to escape from there. Institution consists of\nseveral wings to the rising level of protection, and underground\nmine development inhabit dangerous aggressive creatures.\n\nThe main hero of the game is Richard B. Riddick, played and announced\nthat a key character of both films, which ushered in the franchise -\nVin Diesel. Riddick caught a bounty hunter William J.. Jones, is\na psychopath killer, who was recently transferred to Butcher Bay,\nand who intends to use all means available to it for a long time not\nto linger. To do this he will have to pass three circles of hell that\nterrible institution (zone single-max, double-max, and finally triple-max,\nin which prisoners were placed in cryogenic sleep and wake up every day\njust two minutes to perform the necessary procedures), as well as to meet\nwith the sinister inhabitants of the sewers and mines.\n\nThe plot Assault on Dark Athena begins immediately after the events of\nthe first part. It so happened that Jones, who brought the original\nRiddick in Butcher Bay, and helped him escape from there. On his ship,\nin a state of suspended animation, they are tightened to Dark Athena -\na giant ship of mercenaries controlled Gale Revas and her Deputy Skinner.\nRiddick avoids capture, then he will try to free the captives,\nincluding former captain of the Dark Athena, and also help the little\ngirl Lynne, hiding in ventilation shafts. And when Riddick after the\nordeal finally able to leave the evacuation shuttle scored the eyeballs\nautomated soulless drone ship, fate once again causing him a heavy blow ...\nDoes he have to go back to Dark Athena?\n\n\nGame Features:\n\nYou have to go more than 30 gaming scenes of varying complexity\nin three areas of the prison Butcher Bay and the ship Dark Athena.\n\nChoose your own path to freedom: wade in dark corridors and narrow\ntunnels, climb stairs, or enter a fierce exchange of fire in open spaces.\n\nRiddick withstand more than 20 types of enemies that will appear as\nthe game progresses. Will have to fight not only to guard the prison,\nbut prisoners, robots.\n\nEscape to freedom hero help 15 weapons - from the Â«originalÂ» knives,\nhooks up to assault rifles, shotguns and explosives.\n\nRepack Features:\n\nThe Chronicles of Riddick: Assault on Dark Athena\nVersion of the game - 1.01\nDo not cut / recoded\nAmateur crack from ENPY Studio v1.10","torrent":{"xt":"urn:btih:b7e8a8409d5630d153709682c5a15281ac897305","amp;dn":"The.Chronicles.of.Riddick.Assault.on.Dark.Athena.%5BUpdated.Crack%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7e8a8409d5630d153709682c5a15281ac897305","infoHashBuffer":{"type":"Buffer","data":[183,232,168,64,157,86,48,209,83,112,150,130,197,161,82,129,172,137,115,5]},"announce":[],"urlList":[]}}