{
  "title": "The Sims 3 70s 80s and 90s Stuff-FLT",
  "uid": 8054350,
  "size": 3319734272,
  "categoryP": "games",
  "categoryS": "pc",
  "magnet": "?xt=urn:btih:b970a62f89389d7226f095813541eb76906404e6&amp;dn=The+Sims+3+70s+80s+and+90s+Stuff-FLT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 64,
  "leechers": 4,
  "uploader": "HeroMaster",
  "files": -1,
  "time": 1358924068,
  "description": "ANSiJEDACiD\n\nIn Their 26th Year Of Glory, FairLight Released #1064\n\nThe Sims 3 - 70s, 80s &amp; 90s Stuff (c) EA\n\nSupplied by: FAIRLIGHT              Release Date: 23-01-2013\nCracked by:  FAIRLIGHT              Game Type:    Sims\nPackaged by: FAIRLIGHT              Image Format: ISO\n-----\nDISCS: 1 DVD                        Protection: Disc-Checks\n\nSystem Requirements : Grandma's PC\n\nScene Notes\n============\n\nWe want to reply to your words SKIDROW The fact  we  released  our  proper\nrelease 41 days after your crack simply has to do with the  fact  that  our\nmembers have a real life too and don't spend all their  time  playing  each\nand every game pred the day or week  they  are  out.  We  did  notice  your\npathetic crack a few weeks afterwards when one of our  members  decided  to\ntry the game, using your release. The entire proper crack for this  release\nwas done in about two days and then thoroughly tested for  two  more.  Your\nreaction it is not suitable to release a proper after such a long  time  is\nunderstandable but nevertheless it doesn't change  the  fact  your  release\nscreamed for a &quot;crapfix&quot;, old doesn't mean forgotten\n\nNext, you mix up a fact that a loader  is  technically  the  same  like  an\nemulation and try to claim everybody is only releasing unclean cracks. What\nwas it about the evolution ladder guys? It  seems  your  lab  monkeys  have\ntaken over the entire leadership of the group since the real  SKIDROW  died\nin 1993. This can be the only reason you have come to the conclusion that a\nmodified startup flow  is  the  same  like  the  immitated  behavior  of  a\nprotection, like an EMU does it\n\nSo say what you want, you can talk all day but the simple fact remains, you\nmade a pathetic excuse for a xlive crack that would make any true  reverser\nfeel sick to his stomach. You then try to change the subject and move focus\n(understandable as this must be embarrassing for you)  to Steam CEG cracks\nAll those who are interested in the next generation of your famous work can\nexamine Hitman Absolution, here you really teach the whole scene about  the\nart of reversing by releasing an unmodifed protected exe (if you need proof\ncheck  the  authenticode  signature  of  the  exe,  signed  by  valve)\nwhich is nothing but a 100% Authentic loader solution\n\nWe thought since you love the Sims series so much, here  is  another  addon\nalso for you guys. Enjoy\n\nGame information\n=================\n\nGive your Sims the hottest looks and coolest  dcor  from  yesteryear  with\nThe Sims 3 70s, 80s, &amp; 90s Stuff\n\nSport a 70s disco look with a wide collared jacket and bellbottom pants, go\n80s glam with shoulder pads and bangle earrings,  or  throw  on  a  rumpled\nflannel shirt for a wild 90s grunge look. Rock all-new outfits,  hairstyles\nand facial hair, retro objects, and more\n\nFeatures\n\nThe Groovy 70s Fashion - Pump the tunes on your Sims' stereo system and\nshow off their moves--and their righteous threads. From flared jeans\nand bellbottoms to halter top catsuits and platforms shoes, your Sims\nare ready to boogie the night away in style Dcor--Add some righteous\ndcor to your Sims' home with a console stereo system, minimalist\nfurnishings, a far out disco ball, and more. Can your dig it\nThe Awesome 80s Fashion - Don some legwarmers, a leotard, and a headband\nand your Sim is ready to get physical--at the gym, that is Outfitted in\na vibrant structured suit with shoulder pads, they're set to bound up\nthe career ladder. Whatever their activity, with the awesome 80s attire,\nthey're dressed for success, for sure Dcor--Set your Sims up with\nradical pinup wall art, tubular arcade games, and a totally slick\nentertainment system--and let the shimmies start shaking\nThe Grunge 90s Fashion - Whether your Sims are sporting the anti-fashion\ngrunge look in tattered jeans and layered tops or a casual-chic outfit\nfeaturing an asymmetrical handkerchief hemline skirt, they're sure to\nget mad props for their 90s fashion sense. Dcor--Drag out the distressed\nfurniture for an industrial metal look that says you  don't care about\nthe establishment--even if secretly you do\n\nInstallation Information\n=========================\n\nBurn or mount\nInstall using our keygen ( requires the Sims 3 main game installed\nCopy the cracked content from the Fairlight folder\nto your 'The Sims 3' installation\nPlay the game\n\nNOTE: As usual, block the game exe in your firewall\n\n/TEAM FAiRLIGHT\n\n-  QUALITY, TRADITION  AND PRIDE -\n\n\nPoster:\n\n &lt;a href=&quot;\nhttp://i.imgur.com/lnv1Duy.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/lnv1Duy.jpg&lt;/a&gt;\n\n\nScreenshots:\n\n  &lt;a href=&quot;\nhttp://i.imgur.com/6HOKHhF.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/6HOKHhF.jpg&lt;/a&gt;\n\n  &lt;a href=&quot;\nhttp://i.imgur.com/WKqmWWH.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/WKqmWWH.jpg&lt;/a&gt;\n\n  &lt;a href=&quot;\nhttp://i.imgur.com/sAjsZHu.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/sAjsZHu.jpg&lt;/a&gt;\n\n\nSEED AND ENJOY!\t\t",
  "parsed": {
    "xt": "urn:btih:b970a62f89389d7226f095813541eb76906404e6",
    "dn": "The Sims 3 70s 80s and 90s Stuff-FLT",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "b970a62f89389d7226f095813541eb76906404e6",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        185,
        112,
        166,
        47,
        137,
        56,
        157,
        114,
        38,
        240,
        149,
        129,
        53,
        65,
        235,
        118,
        144,
        100,
        4,
        230
      ]
    },
    "name": "The Sims 3 70s 80s and 90s Stuff-FLT",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 68,
  "peers": 60,
  "last_updated": "2016-12-25T12:08:57.921Z"
}