{"title":"Black And White 2 + Battle Of The Gods [CDKey, ISO, Patches]","uid":8339911,"size":3450106245,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ba856bf80908633444b54ebec5ada5eb58c6d32d&amp;dn=Black+And+White+2+%2B+Battle+Of+The+Gods+%5BCDKey%2C+ISO%2C+Patches%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":87,"leechers":8,"uploader":"pussiple","files":15,"time":1365073751,"description":"\tBlack And White 2 + Black And White 2 - Battle Of The Gods\n\n\nBlack And White 2\n\tCDKey: 6FVD-NGUB-QDXE-24L7-ZSSM\n\nBlack And White 2 - Battle Of The Gods\n\tCDKey: CYF7-RZ56-XPM8-TYKN-XT3E\n\n\nI have also included both the 'BW2v1.1exe' and 'BW2v1.2.exe' official patches.\n\nBlack And White 2 No CD Cracks v1.0 and v1.2 &lt;a href=&quot;\nhttp://www.freeinfosociety.com/site.php?postnum=894&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.freeinfosociety.com/site.php?postnum=894&lt;/a&gt;\n\nPlease use caution on this site with any links or content that may be present. Try NOT to click on EVERY link presented on such sites as these, some may prove to have undesirable results.\n\n\nOriginal uploader of files by 'Dark_Downloader'. Thank you for the upload.\n\n\nTorrent Details;\n\tOriginal Torrent\t | My Torrent\n\tBW2 BOTG.mdf\t783.05MB | BW2 BOTG.iso\t\t655.1MB\n\tBW2 BOTG.mds\t2.99KB\n\tBW2_DISC1.mdf\t783.05MB | BW2_DISC1.iso\t655.1MB\n\tBW2_DISC1.mds\t2.99KB\n\tBW2_DISC2.mdf\t776.76MB | BW2_DISC2.iso\t649.8MB\n\tBW2_DISC2.mds\t494b\n\tBW2_DISC3.mdf\t776.76MB | BW2_DISC3.iso\t649.8MB\n\tBW2_DISC3.mds\t494b\n\tBW2_DISC4.mdf\t648.02MB | BW2_DISC4.iso\t542.1MB\n\tBW2_DISC4.mds\t494b\n\t\ttotal: 3767.64MB | \t\ttotal: 3151.9MB\t\n\n\nSystem Requirements (for both game and expansion);\n\tOS: Windows XP, 2k\n\t    (not listed but most likely will run on; Windows Vista, Win7 and Win8)\n\tCPU: 1.6GHz\n\tRAM: 512MB\n\tHDD: 3.5GB\n\tVideo: DirectX 9.0C Compatible\n\tSound: DirectX 9.0C Compatible\n\tGraphics: 64MB Video RAM and support Pixel Shader v1.1\n\tSupported Chipsets: Nvidia GeForce 4 Ti series, GeForce FX series, 6200 or greater.\n\t\t\t    ATI Radeon 8500, 9100, 9200 series or greater, X300 or greater.\n\nI have downloaded and converted the following files into .iso formats. These files are exact matches to the discs, using MD5 CheckSum. Now you may burn the disc images as a working cd copy if you like.\n\n\nInstructions / Troubleshooting; \n1. Download an application that supports the burning and/or mounting of .iso files.\nThere are many of them out there to choose from; DaemonTools Lite, AstroBurn Lite, NeroBurn Lite/Essentials, MagicISO.\n\nI personally recommend DaemonTools or AstroBurn, some of the most popular and easiest to use.\n\n2. After installing the application, run it. (I'm not sure which app. you have chosen to use), but from the user interface it should be very straight forward and easy to figure out what to do.\n\nIf you choose; TO MOUNT IMAGES\nDaemonTools Lite - will allow you to mount the images, .iso files, to a virtual drive. You may than run the image just as if you had a physical copy of the cd from your computer. The virtual drive will even show up as another ROM drive under 'My Computer'. (assuming you are using windows).\n1. Open DaemonTools and mount the first .iso file of the game. (The game may automatically launch, if not go to 'My Computer', find the BW2 icon and double click it.) On a side note, I recommend running the diagnostics option on the game menu before installing the game to insure compatibility with your computer.\n2. Click the 'Install' button on the game menu. The game will begin installing. When it asks for the next disk, simply unmount the current .iso file from the virtual drive, using the application you have downloaded and installed, and mount the next disc that it is asking for and click the 'Ok' button to continue installing.\n3. If you would like to install the Battle Of The Gods expansion, do that right after you get done installing BW2 using the same instructions in the above steps. After installing the games be sure to apply the official patches, these will solve a bunch of problems you will probably experience during game-play without them.\n4. In order to launch and play the game after installation, you will need to mount the 'Main' game disc to the virtual drive, &quot;disc1&quot;, again. The disc is required to be inserted, or in this instance mounted, in order to run the game.\n\nNOTE - If you experience the following issue with the population of adults not dying, or the population of children not growing up and having no adult population or rather any strange population glitch in the game. You will need to run the game from an actual physical disc. (See steps below for burning images to CDs). DO NOT USE A 'NO-CD CRACK' OF ANY KIND. This will guarantee such glitches in the game. Trust me on this one I have had to deal with this a few times in the past.\n\nIf you choose; TO BURN IMAGES TO CD\nAstroBurn Lite - will allow you to burn the images, .iso files, to a disc. These discs will run perfectly as they are exact duplicates of the orignal retail discs, (Including the DRM track).\n1. Open AstroBurn. Insert a blank CD, not dvd. Select the 'Image' tab at the top left. Within the image tab, select the browse button and find the image you wish to burn. To the left of the program, it should show you the current status about the size of your project, very straight forward.\n2. Be sure to select the proper burning device, and set the burn speed to no higher than 16x. Be sure to check the 'Verify' box to verify rather or not the image was burned to the disc correctly. Burn all images to a CD, not dvd or other media format.\n\nIf you experience any more problems with burning or getting the disc to properly read, please send me an email letting me know. I will try to help you some more.\n\nFor more troubleshooting, please read old comments; follow below link...\n\n\nLink to Original Torrent: http://thepiratebay.se/torrent/7475638/Black_And_White_2___Battle_Of_The_Gods_[ISO]\n\nOriginal torrent replaced by this one. Original torrent removed on 10/17/2013. All original comments have been posted to this torrent.","torrent":{"xt":"urn:btih:ba856bf80908633444b54ebec5ada5eb58c6d32d","amp;dn":"Black+And+White+2+%2B+Battle+Of+The+Gods+%5BCDKey%2C+ISO%2C+Patches%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba856bf80908633444b54ebec5ada5eb58c6d32d","infoHashBuffer":{"type":"Buffer","data":[186,133,107,248,9,8,99,52,68,181,78,190,197,173,165,235,88,198,211,45]},"announce":[],"urlList":[]}}