{
  "title": "Zumba Fitness - ZIN Zumba Gold - Vol. 9 [2012, fitness, DVDRip, ",
  "uid": 8229492,
  "size": 466493440,
  "categoryP": "video",
  "categoryS": "other",
  "magnet": "?xt=urn:btih:bbff00c2d97e75eb4a6ead67ded417b209c1986f&amp;dn=Zumba+Fitness+-+ZIN+Zumba+Gold+-+Vol.+9+%5B2012%2C+fitness%2C+DVDRip%2C+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 95,
  "leechers": 2,
  "uploader": "biscuitboy",
  "files": -1,
  "time": 1362692517,
  "description": "Description : This is - one of the tutorial series Zumba Instructor Network (ZIN).\nShow your age, who's in charge, doing the program Zumba Â® Gold! You can attend a dance workout Zumba Gold in one of the fitness center and enjoy the fiery rhythms of Latin and ethnic music. Or you can arrange an exciting dance party home with the DVD-set of Zumba Â® Gold LIVE IT UP â„¢. Moving to the beat of the music, you will feel an unprecedented mental and physical growth. The program Zumba Â® Gold You can enjoy life at any age!\nWhat is Zumba Gold?\nZumba Gold is a revolutionary program of dance aerobics, which is suitable for anyone, regardless of their level of training and age. This exciting fitness program embodies a fundamentally new concept of a brilliant genius Alberto (Beto) Perez. Training is designed for those new to fitness, people with physical limitations, as well as older people who want to stay physically active. This system is easier than the main system of Zumba, but just as catchy. All movements have been carefully designed with the intention that they could easily repeat the people of any size and age. \nThis workout is guaranteed to help you to safely and effectively work through the whole body! In this case you'll experience a fun atmosphere around the holiday, and easily move to the windup music. In training uses dance moves and rhythms of cumbia, salsa, merengue, tango, rumba, cha-cha, and many other areas of incendiary. \nYou can do the program Zumba Gold, even if you have physical limitations. Training is based on safe, unstressed movements, the rhythm of which aligned to the older people, and those who are just beginning to move into the world of fitness and healthy living. However, the program retains all the known elements party fitness Zumba: fiery rhythms of latin, ethnic music, movement and simple refreshing invigorating holiday atmosphere. \nZumba Gold program is designed for those new to fitness, pregnant women, active seniors, etc. . \nZumba Gold - is the way to good health through dance!\n\n\nQuality : DVDRip Format: AVI Video: 720x400 (1.80:1), 23.976 fps, XviD build 65 ~ 1657 kbps avg, 0.24 bit / pixel Audio: 48 kHz, AC3 Dolby Digital, 2/0 (L, R) ch, ~ 192 kbps",
  "parsed": {
    "xt": "urn:btih:bbff00c2d97e75eb4a6ead67ded417b209c1986f",
    "dn": "Zumba Fitness - ZIN Zumba Gold - Vol. 9 [2012, fitness, DVDRip, ",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "bbff00c2d97e75eb4a6ead67ded417b209c1986f",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        187,
        255,
        0,
        194,
        217,
        126,
        117,
        235,
        74,
        110,
        173,
        103,
        222,
        212,
        23,
        178,
        9,
        193,
        152,
        111
      ]
    },
    "name": "Zumba Fitness - ZIN Zumba Gold - Vol. 9 [2012, fitness, DVDRip, ",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 5,
  "peers": 2,
  "last_updated": "2016-12-27T11:35:20.037Z"
}