{
  "title": "Marilyn Manson - The Pale Emperor (Deluxe Edition) (2015)ak",
  "uid": 11675628,
  "size": 157813672,
  "categoryP": "audio",
  "categoryS": "music",
  "magnet": "?xt=urn:btih:bc4efc4c52bac4d1e476c8e5e280f477618c31f5&amp;dn=Marilyn+Manson+-+The+Pale+Emperor+%28Deluxe+Edition%29+%282015%29ak&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 226,
  "leechers": 5,
  "uploader": "analogkid6103",
  "files": 13,
  "time": 1422852622,
  "description": "\nimage\n\n\nThe Pale Emperor is the ninth studio album by Marilyn Manson. It will be released on January 16, 2015 by Marilyn Manson's Hell, etc. vanity label. The Pale Emperor is the band's shortest-running studio album. Its title is a reference to the moniker bestowed on Constantius I, the 54th Emperor of the Roman Empire, by his people.\n\nThe first description of the Pale Emperor sessions came in May 2013, when Manson compared a song written the night before to Prince, and others to Revolting Cocks. He later described the material as &quot;still personal but different,&quot; and that touring with Alice Cooper triggered nostalgia for his Portrait of an American Family days. After the band's previous album Born Villain, Manson began a chain of television cameos in Californication and Sons of Anarchy, meeting Pale Emperor co-producer Tyler Bates while working on the former. Sons of Anarchy creator Kurt Sutter announced his lyrics for an unused Shooter Jennings song were given to Manson, who expressed interest in using them on the album. Sutter, who heard demos of the new songs, spoke positively of the lyrics and music, which felt &quot;more personal and raw and less theatrical.&quot; Drummer Gil Sharone confirmed his role in an Instagram photo, replacing Jason Sutter who played his last show with the band on July 21, 2013.\n\nAfter recording The Pale Emperor, Manson rediscovered a book about Roman emperor Elagabalus, entitled Heliogabalus; or, the Crowned Anarchist, given as a gift from Johnny Depp in 2000. Manson referred to the identity of the historical Pale Emperor as Elagabalus in early interviews for the album, though it was not Elagabalus but instead Constantius I, who was given the name Constantius the Pale. Manson described him as earning the Pale Emperor moniker because of his complexion and thought it was an appropriate title for the album.\n\nThe first song heard by the public was &quot;Cupid Carries a Gun,&quot; shortened for the opening titles of the television series Salem. Ironically, &quot;Cupid Carries a Gun&quot; was the last song completed for The Pale Emperor. Bates elaborated by saying he and Manson began writing the song before Bates started scoring Salem. Bates later showed Manson the Salem opening, which inspired the two to complete the song. Finally, Bates played &quot;Cupid Carries a Gun&quot; for Salem showrunner Brannon Braga, who called it the &quot;perfect tone and attitude&quot; for the show's opening.\n\nWhile promoting the band's June 27 and June 29, 2014 performances in Russia, Manson told Russia's Radio RockFM station that Bates had imbued the new songs with &quot;the spirit of rock 'n' roll,&quot; particularly the Doors, and that his background in film soundtrack scores resulted in an album that &quot;sounds like a movie.&quot; He also confirmed the large presence of references to Greek mythology in the lyrics. Eventually both of these Russia concerts were cancelled by a bomb threat and Christian Orthodox protest respectively.\n\nAs the months progressed, it became apparent in interviews that the album sounded inspired by or related to blues music. Manson compared the sound not directly to &quot;the Black Keys and Jack White&quot; but to the heart and soul of the blues. Manson mused that even after covering Screamin' Jay Hawkins' &quot;I Put a Spell on You&quot; and living in New Orleans, he could never identify with how to play genuine blues music previously. He admitted that The Pale Emperor did explore the blues, though &quot;there was no point where I said, I'm going to make a blues record.&quot;\n\nThe next song and first to be revealed in its entirety was &quot;Third Day of a Seven Day Binge.&quot; Confirmed as a single, this song was available to download online for free between October 26 and November 9, after which it was sold on iTunes in anticipation of The Pale Emperor, which was also confirmed as the album's title on November 9. In addition to its standard release, a limited Definitive Box edition will also contain the album in vinyl, CD and MP3 formats with collector packaging, lithographs and a shirt. The last song released before the complete album was &quot;Deep Six,&quot; which received the first music video of the Pale Emperor era.\n\n\n1. Killing Strangers (5:36)\n\n2. Deep Six (5:02)\n\n3. Third Day of a Seven Day Binge (4:26)\n\n4. The Mephistopheles of Los Angeles (4:57)\n\n5. Warship My Wreck (5:57)\n\n6. Slave Only Dreams to be King (5:20)\n\n7. The Devil Beneath My Feet (4:16)\n\n8. Birds of Hell Awaiting (5:05)\n\n9. Cupid Carries a Gun (4:59)\n\n10. Odds of Even (6:22)\n\n11. Day 3 (Bonus) (4:11)\n\n12. Fated, Faithful, Fatal (Bonus) (4:41)\n\n13. Fall Of The House Of Death (Bonus) (4:31)\n\nCDrip CBR320, properly tagged (iTunes ready) + 700x700 HD cover art attached to mp3 files.\nGenre: Rock\nSubgenre: Alternative Rock\nBitrate: 320 k\nSize: 150.50 MB\nShow/Hide Files:\n13 files",
  "parsed": {
    "xt": "urn:btih:bc4efc4c52bac4d1e476c8e5e280f477618c31f5",
    "dn": "Marilyn Manson - The Pale Emperor (Deluxe Edition) (2015)ak",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "bc4efc4c52bac4d1e476c8e5e280f477618c31f5",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        188,
        78,
        252,
        76,
        82,
        186,
        196,
        209,
        228,
        118,
        200,
        229,
        226,
        128,
        244,
        119,
        97,
        140,
        49,
        245
      ]
    },
    "name": "Marilyn Manson - The Pale Emperor (Deluxe Edition) (2015)ak",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 232,
  "peers": 50,
  "last_updated": "2016-12-27T11:36:46.277Z"
}