{
  "title": "Learn Calligraphy The Complete Book of Lettering and Design by M",
  "uid": 9234645,
  "size": 27202852,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:bd77e3704f489af037280b2cd668c50b2af685d6&amp;dn=Learn+Calligraphy+The+Complete+Book+of+Lettering+and+Design+by+M&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 71,
  "leechers": 1,
  "uploader": "420weedman",
  "files": 3,
  "time": 1385147592,
  "description": "In an age of myriad computer fonts and instant communication, your handwriting style is increasingly a very personal creation. In this book, Margaret Shepherd, America's premier calligrapher, shows you that calligraphy is not simply a craft you can learn, but an elegant art form that you can make your own.\nCalligraphy remains perennially popular, often adorning wedding invitations, diplomas, and commercial signs. Whether it is Roman, Gothic, Celtic, Bookhand, or Italic style, calligraphy conveys class and elegance. Margaret Shepherd makes this ancient art form accessible in a completely hand-lettered technical guide that will:\n* Provide context for calligraphy as an art, exploring the rich tradition of hand-lettering and mapping the evolution of the most popular styles.\n* Give detailed technical advice on choosing pens, paper, and inks, setting up your workspace, mastering various pen angles, along with step-by-step illustrations to guide you as you practice.\n* Explain which alphabets are appropriate for different forms of writing. For example, the Roman alphabet works well for short, unpunctuated passages, while the Italic alphabet is more suited to informal everyday communication.\n* Encourage you to personalize your lettering by using variant strokes and interpreting how you would like the words to look on the page.\n* Inspire you with carefully chosen illustrations and examples, which bring letters to life.\nIn Margaret Shepherd's own words, &quot;Calligraphy trains not only your eye and hand, but your mind as well.&quot; Learn Calligraphy is the authoritative primer for this age-old craft, and will help develop a new appreciation for lettering as you discover your creative personality.",
  "parsed": {
    "xt": "urn:btih:bd77e3704f489af037280b2cd668c50b2af685d6",
    "dn": "Learn Calligraphy The Complete Book of Lettering and Design by M",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "bd77e3704f489af037280b2cd668c50b2af685d6",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        189,
        119,
        227,
        112,
        79,
        72,
        154,
        240,
        55,
        40,
        11,
        44,
        214,
        104,
        197,
        11,
        42,
        246,
        133,
        214
      ]
    },
    "name": "Learn Calligraphy The Complete Book of Lettering and Design by M",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 72,
  "peers": 124,
  "last_updated": "2016-12-25T12:33:57.077Z"
}