{"title":"Encyclopedia of Geoarchaeology - 1st Ed - 2017 Ed (2016) Gooner","uid":15955699,"size":69469049,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bd9636633b267378b54bc256f49963c37c776243&amp;dn=Encyclopedia+of+Geoarchaeology+-+1st+Ed+-+2017+Ed+%282016%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":46,"leechers":15,"uploader":"GoonerTPB","files":2,"time":1475616554,"description":"Encyclopedia of Geoarchaeology - 1st Edition - 2017 Edition (2016) (Pdf) Gooner\r\n\r\nPublisher: Springer; 1st ed. 2017 edition (15 Sept. 2016)\r\nLanguage: English\r\nISBN-10: 9400748272\r\nISBN-13: 978-9400748279\r\n\r\nGeoarchaeology is the archaeological subfield that focuses on archaeological information retrieval and problem solving utilizing the methods of geological investigation. Archaeological recovery and analysis are already geoarchaeological in the most fundamental sense because buried remains are contained within and removed from an essentially geological context. Yet geoarchaeological research goes beyond this simple relationship and attempts to build collaborative links between specialists in archaeology and the earth sciences to produce new knowledge about past human behavior using the technical information and methods of the geosciences.\r\n\r\nThe principal goals of geoarchaeology lie in understanding the relationships between humans and their environment. These goals include (1) how cultures adjust to their ecosystem through time, (2) what earth science factors were related to the evolutionary emergence of humankind, and (3) which methodological tools involving analysis of sediments and landforms, documentation and explanation of change in buried materials, and measurement of time will allow access to new aspects of the past.\r\n\r\nThis encyclopedia defines terms, introduces problems, describes techniques, and discusses theory and strategy, all in a format designed to make specialized details accessible to the public as well as practitioners. It covers subjects in environmental archaeology, dating, materials analysis, and paleoecology, all of which represent different sources of specialist knowledge that must be shared in order to reconstruct, analyze, and explain the record of the human past. It will not specifically cover sites, civilizations, and ancient cultures, etc., that are better described in other encyclopedias of world archaeology","torrent":{"xt":"urn:btih:bd9636633b267378b54bc256f49963c37c776243","amp;dn":"Encyclopedia+of+Geoarchaeology+-+1st+Ed+-+2017+Ed+%282016%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd9636633b267378b54bc256f49963c37c776243","infoHashBuffer":{"type":"Buffer","data":[189,150,54,99,59,38,115,120,181,75,194,86,244,153,99,195,124,119,98,67]},"announce":[],"urlList":[]}}