{
  "title": "Marvel's Civil War - Digital Collection (2006-2007|Empire+)",
  "uid": 10020067,
  "size": 651176275,
  "categoryP": "other",
  "categoryS": "comics",
  "magnet": "?xt=urn:btih:bd9c5c9320ae3bb13423b23c157a30b15f4743ca&amp;dn=Marvel%27s+Civil+War+-+Digital+Collection+%282006-2007%7CEmpire%2B%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 72,
  "leechers": 6,
  "uploader": "VikTSlick",
  "files": -1,
  "time": 1398192008,
  "description": "When the b-list Nitro gets in over his head and goes supernova in Stamford, Connecticut, he ends up killing tons of people caught in his blast radius including 60 schoolchildren. Spurred by the mother of one of the victims and Tony Stark's support, the government passes the Superhuman Registration Act - forcing the heroes of the Marvel Universe to either go on record with S.H.I.E.L.D. or be considered fugitives. There are those who quickly fall in line with Iron Man's decision and pledge support for the reform - including, at first, a gung-ho Spider-Man, who publicly unmasks - and those who don't feel that the superheroes should be stooges of the government or forced to register, led by a fully rebellious Captain America. Thus begins Civil War, Mark Waid's all-encompassing event that would have major consequences for the Marvel Universe for years to come; affecting the stories of nearly all characters involved (most especially, the significant players like the X-Men, Fantastic Four, Avengers and so on) and directly feeding into the crossovers that followed. Waid's primary seven-issue miniseries is well-written and carefully considers the impact of the devastating events, and tightly plotted with little fluff. Steve McNiven's art is also terrific, with strong battle compositions and facial expressions to tell the tale. The event would become one of the biggest financial successes in Marvel Comics history, and though it has many detractors and a long and bloated list of mostly unnecessary tie-ins, the main storyline is quite well done in my opinion and well worth reading - for the sake of greater understanding of the modern Marvel mythos at least, if nothing else.\n\nThis is a collection of digital releases related to Civil War proper by Empire scanners; this is NOT every tie-in and so on in reading order. There are plenty of torrents for that. Rather, this is the core TPB, the Road To Civil War TPB which lays the groundwork for the event, and a selection of excellent one-shots that serve to compliment what is happening in the plot. \n\nThese full contents are:\nCivil War (2006) (Digital TPB) (Zone-Empire)\nCivil War - The Road To Civil War (2007) (Collected Edition) (Digital) (Nahga-Empire)\n\nOne-Shots, which has:\n-Civil War - Casualties of War - Iron Man-Captain America (2007) (Digital) (Cypher-Empire)\n-Civil War - Choosing Sides (2006) (Digital) (Cypher-Empire)\n-Civil War - The Confession 001 (2007) (Digital) (Cypher-Empire)\n-Civil War - The Initiative 001 (2007) (Digital) (Cypher-Empire)\n-Civil War - The Return 001 (2007) (Digital) (Cypher-Empire)\n-Civil War - War Crimes 001 (2006) (Digital) (Cypher-Empire)\n\nThere are also digital releases for CW: House of M and CW: X-Men, but I will post those in separate torrents. I wanted this package to be more or less the essentials that are available. There are also recent versions of the one-shots by Minutemen-InnerDemons, but I thought it would make more sense to group the Empire stuff together and MM scanners haven't done the TPBs as yet. Thanks to Cypher, Nahga and Zone-Empire for their outstanding work. Please seed and enjoy! :-)",
  "parsed": {
    "xt": "urn:btih:bd9c5c9320ae3bb13423b23c157a30b15f4743ca",
    "dn": "Marvel's Civil War - Digital Collection (2006-2007|Empire )",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "bd9c5c9320ae3bb13423b23c157a30b15f4743ca",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        189,
        156,
        92,
        147,
        32,
        174,
        59,
        177,
        52,
        35,
        178,
        60,
        21,
        122,
        48,
        177,
        95,
        71,
        67,
        202
      ]
    },
    "name": "Marvel's Civil War - Digital Collection (2006-2007|Empire )",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 78,
  "peers": 31,
  "last_updated": "2016-12-25T12:35:05.353Z"
}