{
  "title": "Whistlestop: My Favorite Stories from Presidential Campaign Hist",
  "uid": 15892865,
  "size": 12541991,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:bdfdbcf82070150c5b87b73dae211ea7f2ef6c86&amp;dn=Whistlestop%3A+My+Favorite+Stories+from+Presidential+Campaign+Hist&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 39,
  "leechers": 3,
  "uploader": "Dr.Soc",
  "files": 1,
  "time": 1474769741,
  "description": "John Dickerson, &quot;Whistlestop: My Favorite Stories from Presidential Campaign History&quot;\r\nEnglish | ISBN: 145554048X | 2016 | EPUB | 464 pages | 12 MB\r\n\r\nFrom Face the Nation moderator and Slate columnist John Dickerson come the stories behind the stories of the most memorable moments in American presidential campaign history.\r\n\r\nThe stakes are high. The characters full of striving and ego. Presidential campaigns are a contest for control of power in the most powerful country on earth. The battle of ideas has a clear end, with winners and losers, and along the way there are sharp turning points-primaries, debates, conventions, and scandals that squeeze candidates into emergency action, frantic grasping, and heroic gambles. As Mike Murphy the political strategist put it, &quot;Campaigns are like war without bullets.&quot;\r\n\r\nWHISTLESTOP tells the human story of nervous gambits hatched in first-floor hotel rooms, failures of will before the microphone, and the cross-country crack-ups of long-planned stratagems. At the bar at the end of a campaign day, these are the stories reporters rehash for themselves and embellish for newcomers. In addition to the familiar tales, WHISTLESTOP also remembers the forgotten stories about the bruising and reckless campaigns of the nineteenth century when the combatants believed the consequences included the fate of the republic itself. Some of the most modern-feeling elements of the American presidential campaign were born before the roads were paved and electric lights lit the convention halls-or there were convention halls at all. \r\n\r\nWHISTLESTOP is a ride through the American campaign history with one of its most enthusiastic conductors guiding you through the landmarks along the way",
  "parsed": {
    "xt": "urn:btih:bdfdbcf82070150c5b87b73dae211ea7f2ef6c86",
    "dn": "Whistlestop: My Favorite Stories from Presidential Campaign Hist",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "bdfdbcf82070150c5b87b73dae211ea7f2ef6c86",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        189,
        253,
        188,
        248,
        32,
        112,
        21,
        12,
        91,
        135,
        183,
        61,
        174,
        33,
        30,
        167,
        242,
        239,
        108,
        134
      ]
    },
    "name": "Whistlestop: My Favorite Stories from Presidential Campaign Hist",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 9,
  "peers": 16,
  "last_updated": "2016-12-27T11:47:18.363Z"
}