{
  "title": "Focus T25 Alpha, Beta, Gamma - x256 - MP4 - DVDrip",
  "uid": 8755422,
  "size": 4078541410,
  "categoryP": "other",
  "categoryS": "other",
  "magnet": "?xt=urn:btih:be373216a357d56f3dbf9e9b9e3c6437a9848dba&amp;dn=Focus+T25+Alpha%2C+Beta%2C+Gamma+-+x256+-+MP4+-+DVDrip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 597,
  "leechers": 52,
  "uploader": "MrTVGuy",
  "files": -1,
  "time": 1375144202,
  "description": "FOCUS T25 ALPHA, BETA, GAMMA - X264 - MP4 - DVDRIP\n\nFully compatible with Softmodded Wii, Ipad, Iphone and many other devices that support x256 in MP4 container. Encoding was designed for maximum compatibility, good quality and high compression. Have Fun. Get Fit and SEED.\n\n25 Minutes. 5 Days a Week. 100% Results.\nThe only thing standing between you and the results you want is TIME. Shaun T experimented for the last year to design a program that delivers the same kind of results you'd expect from an hour-long program, in under 30 minutes. He's pulled out the rest to give you everything you need, nothing you don't. The result is FOCUS T25 and the name implies the intent: If you focus your intensity for 25 minutes, and you do it 5 days a week, you WILL get results.\n\nProduct Info: &lt;a href=&quot;\nhttp://www.beachbody.com/product/fitness_programs/focus-t25-workout.do&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.beachbody.com/product/fitness_programs/focus-t25-workout.do&lt;/a&gt;\n\nYour FOCUS T25 program includes:\n\nALPHA CYCLE WORKOUTS\n\nCARDIO\n25 minutes of calorie-burning, sweat-drenching cardio.\n\nSPEED 1.0\nIgnite your quickness. Burn the fat. Fast-paced for fast results.\n\nTOTAL BODY CIRCUIT\nFocus on strength and resistance without lifting a single weight.\n\nAB INTERVALS\nCardio and ab intervals that shred the fat from your midsection.\n\nLOWER FOCUS\nFocus on your lower-body muscles is the key to burning fat and kicking up your metabolism.\n\nSTRETCH\nAfter 5 days of hard work, stretch it out and enjoy this one! You deserve it.\n\nBETA CYCLE WORKOUTS\n\nCORE CARDIO\nGet your sweat on! This progressive cardio-core workout is about you getting shredded fast.\n\nSPEED 2.0\nRev it up with Shaun's calorie-scorching, core-focused speed drills.\n\nRIP'T CIRCUIT\nCardio, upper body, legs, abs ... repeat! This is how you get ripped in 25 minutes.\n\nDYNAMIC CORE\nYou'll go from vertical to horizontal and back again in this dynamic, crazy core routine.\n\nUPPER FOCUS\nShaun will help you develop the upper body of your dreams. All you have to do is FOCUS.\n\nGAMMA CYCLE WORKOUTS\n\nRIP'T UP\nStrengthen and streamline your biceps, triceps, shoulders, back, and chest with Shaun's 360Â° upper-body moves.\n\nEXTREME CIRCUIT\nBuild lean muscle and burn fat at the same time! In this one, the weights never leave your hands. Not even for the warm-up.\n\nTHE PYRAMID\nAccelerate your reps as time progresses. This is your 25-minute cardio and strength endurance test.\n\nSPEED 3.0 WORKOUT\nFaster pace. More sweat. Serious results. You won't want to miss this 25-minute high-speed challenge.\n\nBONUS WORKOUT INCLUDED:\n\nCORE SPEED\nA strong, flexible core underpins almost everything you do in your workout. If you want to enhance your balance, improve your stability, and crank up your fat-burning intensity, all you have to do is load up Core Speed and Push Play! Every motion you make either originates in your core or moves through it. That's why Shaun developed this revolutionary set of non-stop drills that specifically tighten and strengthen every muscle throughout your core, so you can get the best results of your life. You get in. You push hard. And you stay focused! This is Shaun's way of getting your core ready to take on any challenge, and at the same time melting off your pounds from head-to-toe. Core Speed. You'll be amazed at the difference in how you look and how you perform. You can use this workout instead of SPEED 2.0 anywhere it appears.\n\nALSO INCLUDED:\n\nALPHA, BETA, GAMMA WORKOUT CALANDER\nFull Alpha, Beta, Gamma Hybrid Workout Calendar\n\nWHAT IS NOT INCLUDED:\n\nQUICK START GUIDE\nGET IT DONE NUTRITION GUIDE\n5-DAY FAST TRACK\n\n\nRECOMMENDED EQUIPMENT:\nMAT\nResistance Bands\nChin-Up Bar\nChin-Up MAX",
  "parsed": {
    "xt": "urn:btih:be373216a357d56f3dbf9e9b9e3c6437a9848dba",
    "dn": "Focus T25 Alpha, Beta, Gamma - x256 - MP4 - DVDrip",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "be373216a357d56f3dbf9e9b9e3c6437a9848dba",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        190,
        55,
        50,
        22,
        163,
        87,
        213,
        111,
        61,
        191,
        158,
        155,
        158,
        60,
        100,
        55,
        169,
        132,
        141,
        186
      ]
    },
    "name": "Focus T25 Alpha, Beta, Gamma - x256 - MP4 - DVDrip",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 100,
  "peers": 50,
  "last_updated": "2016-12-27T11:48:40.627Z"
}