{
  "title": "Written in Blood: A History of Forensic Detection",
  "uid": 15896980,
  "size": 1898373,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:bf04756a448a87fa8bda5764373e51c731b32d56&amp;dn=Written+in+Blood%3A+A+History+of+Forensic+Detection&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 55,
  "leechers": 6,
  "uploader": "marty14",
  "files": 1,
  "time": 1474820018,
  "description": "Written in Blood: A History of Forensic Detection - Colin Wilson [epub]\r\n\r\nIn 44 B.C. a Roman doctor named Antistius performed the first autopsy recorded in history—on the corpse of murder victim Julius Caesar. However, not until the nineteenth century did the systematic application of scientific knowledge to crime detection seriously begin, so that the tiniest scrap of evidence might yield astonishing results—like the single horsehair that betrayed the sex murderer in New York’s 1936 Nancy Titterton case.\r\n\r\nIn this massive and compelling history of forensic detection, the internationally recognized criminologist Colin Wilson charts the progress of criminalistics from the first attempts at detecting arsenic to the development of an impressive array of such modern techniques as ballistic analysis, blood typing, voice printing, textile analysis, psychological profiling, and genetic fingerprinting.\r\n\r\nWilson also explores the alarmingly modern phenomenon of serial sex crime with a discussion of notorious cases that includes Jack the Ripper, Lucie Berlin, Mary Phagan, the Black Dahlia, Charles Manson, and Peter Sutcliffe, the so-called Yorkshire Ripper. Wilson shows how the continual sophistication of forensic detection and the introduction of computerized information retrieval has increasingly stacked the odds against the sex killer. Whatever the case, Written in Blood never fails to enlighten and intrigue",
  "parsed": {
    "xt": "urn:btih:bf04756a448a87fa8bda5764373e51c731b32d56",
    "dn": "Written in Blood: A History of Forensic Detection",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "bf04756a448a87fa8bda5764373e51c731b32d56",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        191,
        4,
        117,
        106,
        68,
        138,
        135,
        250,
        139,
        218,
        87,
        100,
        55,
        62,
        81,
        199,
        49,
        179,
        45,
        86
      ]
    },
    "name": "Written in Blood: A History of Forensic Detection",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 61,
  "peers": 7,
  "last_updated": "2016-12-25T12:43:07.247Z"
}