{
  "title": "The Bingo Theory (2016) (Epub) Gooner",
  "uid": 15908690,
  "size": 1378772,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:bf9a818e7d8b9a39ba60098f25e791415b2575be&amp;dn=The+Bingo+Theory+%282016%29+%28Epub%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 47,
  "leechers": 4,
  "uploader": "GoonerTPB",
  "files": 2,
  "time": 1475080604,
  "description": "The Bingo Theory - A Revolutionary Guide to Love, Life and Relationships (2016) (Epub) Gooner\r\n\r\nPublisher: Dreamers &amp; Creators Ltd.; First Edition edition (25 April 2016)\r\nLanguage: English\r\nISBN-10: 099546040X\r\nISBN-13: 978-0995460409\r\n\r\nThe Bingo Theory unites us all. Men are not from Mars and Women are not from Venus. We are all from Planet Earth.\r\n\r\nThe traditional view of masculine and feminine energy is very black and white. If you are a woman, you are considered to be feminine, and similarly if you are man- you are considered to be masculine. This outdated and inadequate mindset has lead to a tremendous imbalance both internally in our lives, as well as externally in our world.\r\n\r\nThe Bingo Theory breaks through this traditional gender-polarized idea of man and woman, by providing a new fresh view and understanding of masculine and feminine energies and the important role both of these energies play in our lives.\r\n\r\nEvery single human on this planet has two energies living within them: the masculine and the feminine.The masculine energy helps us to operate in the outer world; it makes us strong, independent, and confident. The feminine energy, on the other hand, helps us love and connect to others. It’s what makes us creative and intuitive.\r\n\r\nIn this book you will learn how to balance the masculine and feminine energies within you so that you can be a Bingo. What is a Bingo? A Bingo is a winning combination of both of masculine and feminine energies. This inner balance is crucial in order to have a better relationship with yourself, attract your perfect romantic partner, improve your existing relationship, as well as have a fulfilling career.\r\n\r\nIn this book you will:\r\n\r\n• Discover the groundbreaking medical research that has proven that, biologically, we are all a blend of masculine and feminine strengths. \r\n\r\n• Take a quiz that helps you to determine if your strength energy is masculine or feminine. This alone is a huge eye opener. It will allow you to see clearly what amazing strengths you posses and will also highlight the areas you need to work on. \r\n\r\n• Learn simple, actionable tips to help you balance your energies. \r\n\r\n• Learn how to attract a Bingo relationship if you are single. \r\n\r\n• Learn how to transform your existing relationships (whether romantic or otherwise) using the principles of masculine and feminine energies",
  "parsed": {
    "xt": "urn:btih:bf9a818e7d8b9a39ba60098f25e791415b2575be",
    "dn": "The Bingo Theory (2016) (Epub) Gooner",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "bf9a818e7d8b9a39ba60098f25e791415b2575be",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        191,
        154,
        129,
        142,
        125,
        139,
        154,
        57,
        186,
        96,
        9,
        143,
        37,
        231,
        145,
        65,
        91,
        37,
        117,
        190
      ]
    },
    "name": "The Bingo Theory (2016) (Epub) Gooner",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 34,
  "peers": 34,
  "last_updated": "2016-12-27T11:56:38.315Z"
}