{
  "title": "Foraging (2016) (Epub) Gooner",
  "uid": 15955747,
  "size": 157962,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:c21c219cd07e09b63d70a3b153cc31d976156abc&amp;dn=Foraging+%282016%29+%28Epub%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 50,
  "leechers": 4,
  "uploader": "GoonerTPB",
  "files": 2,
  "time": 1475617245,
  "description": "Foraging - How to Find, Identify, Harvest and Use Wild Mushrooms, Wild Edible and Medical Herbs! (2016) (Epub) Gooner\r\n\r\nPublisher: CreateSpace Independent Publishing Platform (27 Sept. 2016)\r\nLanguage: English\r\nISBN-10: 1539096181\r\nISBN-13: 978-1539096184\r\n\r\nForaging\r\n\r\nHow to Find, Identify, Harvest and Use Wild Mushrooms, Wild Edible and Medical Herbs!\r\n\r\nThe following book is a comprehensive guide on foraging of mushrooms, berries, wild plants etc. The book covers several aspects of foraging for wild edibles. It contains a chapter on the medicinal properties of mushrooms so that you can know what kind of mushrooms have nutritious and medicinal values. It talks about all the cancer reducing, cholesterol lowering properties of mushrooms. The next chapter goes on to talk about the different types of mushrooms- how they are classified, main examples of each types with vivid description and some important attributed of each of them. Then there is a chapter on how to identify the several edible varieties of mushrooms by looking at their distinct anatomical features that give it the unique shape and color. There is a chapter within this book that also deals extensively with the art of foraging. How to prepare for it and how to slowly grow by learning from the experts and following simple rules of what to do and what not do. It is all about getting familiar with what you are doing and the rest is all about experience and practice. You can start with simple and easy identifications and then move on to much more elusive varieties of wild edibles as your confidence level goes up. The final chapter explains the different types of berries and how they are to be harvested. These berries are seasonal in nature and bright in color but beware of the poisonous look-alikes that can make you very sick if not kill you. In conclusion, this book is fun to read and informative. It is a must read for all beginners who want to be a part of this growing culture of foraging",
  "parsed": {
    "xt": "urn:btih:c21c219cd07e09b63d70a3b153cc31d976156abc",
    "dn": "Foraging (2016) (Epub) Gooner",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "c21c219cd07e09b63d70a3b153cc31d976156abc",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        194,
        28,
        33,
        156,
        208,
        126,
        9,
        182,
        61,
        112,
        163,
        177,
        83,
        204,
        49,
        217,
        118,
        21,
        106,
        188
      ]
    },
    "name": "Foraging (2016) (Epub) Gooner",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 54,
  "peers": 53,
  "last_updated": "2016-12-25T13:02:00.598Z"
}