{"title":"Snoop Dogg - Doggystyle (1993) - (Remastered)","uid":9986962,"size":106147901,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:c360c8872efbafe6cc2dbd684ac3e82106e7a935&amp;dn=Snoop+Dogg+-+Doggystyle+%281993%29+-+%28Remastered%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":37,"leechers":1,"uploader":"A7XmattA7X","files":13,"time":1397802256,"description":"Doggystyle is the debut album from American rapper Snoop Dogg, then known as Snoop Doggy Dogg, released by Death Row Records on November 23, 1993. The album was recorded soon following the release of Dr. Dre's landmark debut album The Chronic (1992), to which Snoop Dogg contributed significantly. The style he developed for Dre's album was continued on Doggystyle.[1] Critics have praised Snoop Dogg for the lyrical &quot;realism&quot; he delivers on the album and for his distinctive vocal flow.[1][2]\n\nDespite some mixed criticism of the album initially upon its release, Doggystyle has earned recognition from many music critics as one of the most significant albums of the 1990s, as well as one of the most important hip hop albums ever released.[3] Much like The Chronic, the distinctive sounds of Doggystyle helped introduce the hip hop style of G-funk to a mainstream audience, bringing forward West Coast hip hop as a dominant force in the early 1990s.[1][4] As of 2008, the Recording Industry Association of America (RIAA) has certified Doggystyle quadruple platinum in sales, and it serves as Snoop Dogg's highest-selling album.\n\nDoggystyle debuted at number one on the Billboard 200 chart, and sold 802,858 copies in its first week alone, which was the record for a debuting artist and the fastest-selling album ever until Eminem's The Marshall Mathers LP in 2000. Doggystyle is included in The Source magazine's list of the 100 Best Rap Albums, as well as Rolling Stone magazine's list of Essential Recordings of the 90s.[3] About.com placed the album in number 19 of the greatest hip hop/rap albums of all time.[5]\n\nBitrate - 256kbps\n\nTracklisting:\n1. Bathtub\n2. G-Funk Intro\n3. Gin and Juice\n4. Tha Shiznit\n5. Lodi Dodi\n6. Murder Was the Case\n7. Serial Killa\n8. Who Am I (What's My Name?)\n9. For All My Niggas &amp; Bitches\n10. Ain't No Fun (If the Homies Can't Have None)\n11. Doggy Dogg World\n12. G'z and Hustla's\n13. Pump Pump\n\nAlbum ripped from my CD copy! ","torrent":{"xt":"urn:btih:c360c8872efbafe6cc2dbd684ac3e82106e7a935","amp;dn":"Snoop+Dogg+-+Doggystyle+%281993%29+-+%28Remastered%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c360c8872efbafe6cc2dbd684ac3e82106e7a935","infoHashBuffer":{"type":"Buffer","data":[195,96,200,135,46,251,175,230,204,45,189,104,74,195,232,33,6,231,169,53]},"announce":[],"urlList":[]}}