{"title":"Prison Architect Alpha 31b","uid":11779488,"size":136775493,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c383955bcb39447abd2b7ef6babe182daba1b6ab&amp;dn=Prison+Architect+Alpha+31b&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":42,"leechers":0,"uploader":"dauphong","files":1,"time":1427506576,"description":"New staff : The Lawyer\nUnlocked in the usual way through Bureaucracy, and requires his own office.\nThe lawyer grants access to a variety of legal loopholes and new facilities for your prison.\n\n- Minimum cell size removal\nPrison Cells can be built to any size - they are no longer to obey the legal minimum\nof 3x2 metres. Note they must still contain a bed and a toilet.\n\n- Indeterminate sentences\nPrisoners can now be assigned lockup or solitary confinement that remains in place\nuntil you say otherwise. This is a massive breach of their human rights, but the Lawyer\nwill allow you to skirt the issue and do it anyway.\n\n- Death Row\nOpens up the opportunity and responsibility of executing prisoners sentenced to death.\n\n\nDeath row\nTo receive Death Row prisoners, you must:\n- Unlock Death Row through the lawyer\n- Build an execution facility - a room with an Electric chair, and chairs for the witnesses\n- Build cells nearby and flag then as &quot;Death Row Only&quot; in the security deployment screen\n\nDeath Row prisoners will then begin show in your Intake screen - although they are quite rare.\nThey must stay in a Death Row designated cell, and they do not follow the regime.\n\n- They are effectively locked down 24 hours a day, with two exceptions:\n1. They can receive family visitors in Visitation\n2. They can attend their Appeals process to try to have their sentences commuted.\n\n- New program : Death row appeals process\nEvery Death Row prisoner has a chance to try to clear his name, or have his sentence commuted.\nHe will attend the appeals process, and each time has a chance to be released, or downgraded to max-sec.\n\n- All Death Row prisoners have an estimated chance of clemency, visible in their Rap Sheet.\nThis represents your staff's best estimate at his chances at clemency.\nEach time he fails the appeals process, his estimated chance of clemency is HALVED.\nThe more appeals you allow for a prisoner, the more certain you can be of his guilt.\n\n\nExecutions\nOnce you are satisfied a Prisoner has had sufficient chance to appeal, you may schedule an Execution.\nThis can be done from his Rap Sheet, and once begun it will take over your view until over.\n\nA process must be followed for each execution:\n- Prison lockdown : All prisoners return to their cells\n- The chair is electrically tested, putting your prison under high electrical load.\nIn addition, the prisoner must be able to walk to the facility.\n- Witnesses are escorted to the facility and will sit in seats provided, if available\n- The Warden, the Chief, and the prisoners chosen Spiritual Leader will gather in the condemned man's Cell\n- The prisoner will be escorted to the execution room, along with the Warden/Chief/Priest\n- Execution\n- The staff and witnesses are dismissed and may leave\n\nOnce completed, you will be given a report on the success or failure of your execution.\nIf justice was done, you will receive a $10,000 bonus for your work.\n\n- WARNING: If you push ahead with an execution before sufficient appeals have occurred,\nyou will be held personally responsible if evidence comes to light which later exonerates the prisoner.\nYou will be fined $50,000 instantly.\nThe intake queue of Death Row prisoners will immediately empty.\nIn addition, any Death Row inmates within your facility will be immediately transfered away by bus.\nIf this happens 3 times, you will be fired.\n\nNOTE: The state sanctioned &quot;safe level&quot; for chance of clemency is 5%.\nIn other words, if you wait until a prisoners clemency chance is below 5%, you will not be held liable\nfor any miscariages of justice that may later come to light.\nYour Lawyer can raise this threshold to 10% if you instruct him to do so.\n\n\nNew room : Reception\nAn optional room, that gives Prisoners a dedicated arrival point (replacing Deliveries)\nOnce built, all new prisoner arrivals will go through this room.\n\n- Prisoners must be escorted into the Reception room, then strip-searched. Any contraband will be found.\n- They are then given fresh uniforms.\n- Guards then escort them (still shackled) to their destination - either a cell or a holding cell.\n- The process requires lots of available guards, but is much more secure than arrivals through Deliveries.\n\nNOTE: The Laundry Logistics system will assign one of your laundries to handle the clean uniform requirements.\n\n\n- Using the Bangup emergency option will no longer rapidly raise the 'temperature' of your prison.\nHowever, having lots of prisoners shackled (in their cells or in solitary) will contribute to the 'temperature'.\n\n\nBug Fixes\n- Fixed: The 'criminal negligence' failure case had become broken in alpha 30 - your avatar was not spawned correctly\n- 0007974: [AI &amp; Behaviour] Crash loading game with PhoneBooth redefined to be non-wired by a mod\n- 0007967: [AI &amp; Behaviour] Crash with prisoners unloading from prisoner bus\n- 0007932: [AI &amp; Behaviour] Guards not taking prisoners to (available) solitary cells","torrent":{"xt":"urn:btih:c383955bcb39447abd2b7ef6babe182daba1b6ab","amp;dn":"Prison+Architect+Alpha+31b","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c383955bcb39447abd2b7ef6babe182daba1b6ab","infoHashBuffer":{"type":"Buffer","data":[195,131,149,91,203,57,68,122,189,43,126,246,186,190,24,45,171,161,182,171]},"announce":[],"urlList":[]}}