{
  "title": "Tame Impala - Discography 2008-2012 [FLAC]",
  "uid": 9383121,
  "size": 997490709,
  "categoryP": "audio",
  "categoryS": "flac",
  "magnet": "?xt=urn:btih:c46172b7b9f0540a4fecb59ed80a20806654919b&amp;dn=Tame+Impala+-+Discography+2008-2012+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 77,
  "leechers": 43,
  "uploader": "rudown78",
  "files": 91,
  "time": 1387743355,
  "description": "Tame Impala - Discography 2008-2012 [FLAC]\n\n\nKevin Parker (vocals/guitar) and Dominic Simper (bass) formed Tame Impala as 13 year olds in Perth in 1999, sticking to bedroom recordings until 2007, when Jay Watson joined them on drums and backing vocals. Their sound was pure late '60s, but wasn't the sound of any specific band from the era. They were as likely to be channeling the Nazz as the Jimi Hendrix Experience. Cocooned away inside walls of psychedelic fuzz in Western Australia, they re-created their preferred period one song at a time with the aid of gear and production techniques that sounded like they hadn't been dusted off since 1968. Like a lot of the buzz bands of the late 2000s Tame Impala's story involves MySpace. The social networking website rocketed them from a teenage garage band to the sought-after trophy in a multiple-label bidding war. It started when Modular Records sent them a message after hearing several songs on their MySpace page and asked for more. Tame Impala sent them a demo with 20 songs, which led to requests and offers from everyone under the sun. After consideration, they stuck with the label who had shown first interest, and signed with Modular in 2008.\n\nIn September of that year they released their first self-titled EP. There was some confusion among reviewers, several of whom referred to the release as &quot;Antares, Mira, Sun&quot; after the notes written on the artwork, a representation of the Orion Nebula drawn by bandleader and songwriter Kevin Parker. As well as drawing the art, the perfectionist Parker micro-managed the recording, performing every instrument himself. The EP went to number ten on the ARIA charts and number one on the independent label charts. Though Parker played each instrument on the EP, live they functioned as a real band, though at their early gigs they were famously unprepared and never wore shoes. At one such shambolic gig for a Vice Magazine party in Melbourne, indie electro-pop band MGMT's label manager caught their act and was impressed enough to offer them the support slot when his band toured Australia. That year they also supported the Black Keys and You Am I on national tours. In 2010, Tame Impala made their full-length debut with the Dave Fridmann-mixed Innerspeaker. Shortly after the release, Parker returned to his home studio in Perth to begin work on new material, and in 2012, the band followed up with their less guitar-focused sophomore effort, Lonerism.\n\n\n2008 - Tame Impala [EP]\n2010 - Innerspeaker\n2012 - Lonerism\n\n\nEach album contains full artwork and rip logs. Enjoy!!!!!!!!!!!!!!!!!!!!!!!!!!",
  "parsed": {
    "xt": "urn:btih:c46172b7b9f0540a4fecb59ed80a20806654919b",
    "dn": "Tame Impala - Discography 2008-2012 [FLAC]",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "c46172b7b9f0540a4fecb59ed80a20806654919b",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        196,
        97,
        114,
        183,
        185,
        240,
        84,
        10,
        79,
        236,
        181,
        158,
        216,
        10,
        32,
        128,
        102,
        84,
        145,
        155
      ]
    },
    "name": "Tame Impala - Discography 2008-2012 [FLAC]",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 95,
  "peers": 22,
  "last_updated": "2016-12-27T12:26:50.179Z"
}