{
  "title": "Faster, Better, Cheaper in the History of Manufacturing (2016)",
  "uid": 15948143,
  "size": 49564646,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:c51b78cd33c912e9d48d31b342ffc33ba59697ef&amp;dn=Faster%2C+Better%2C+Cheaper+in+the+History+of+Manufacturing+%282016%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 51,
  "leechers": 13,
  "uploader": "GoonerTPB",
  "files": 2,
  "time": 1475535814,
  "description": "Faster, Better, Cheaper in the History of Manufacturing - From the Stone Age to Lean Manufacturing and Beyond (2016) (Pdf) Gooner\r\n\r\nPublisher: Productivity Press (5 Aug. 2016)\r\nLanguage: English\r\nISBN-10: 1498756301\r\nISBN-13: 978-1498756303\r\n\r\nThe industrial revolution, mechanization, water and steam power, computers, and automation have given an enormous boost to manufacturing productivity. &quot;Faster, Better, Cheaper&quot; in the History of Manufacturing shows how the ability to make products faster, better, and cheaper has evolved from the stone age to modern times. It explains how different developments over time have raised efficiency and allowed the production of more and better products with less effort and materials, and hence faster, better, and cheaper. In addition, it describes the stories of inventors, entrepreneurs, and industrialists and looks at the intersection between technology, society, machines, materials, management, and – most of all – humans.\r\n\r\n&quot;Faster, Better, Cheaper&quot; in the History of Manufacturing follows this development throughout the ages. This book covers not only the technical aspects (mechanization, power sources, new materials, interchangeable parts, electricity, automation), but organizational innovations (division of labor, Fordism, Talyorism, Lean). Most of all, it is a story of the people that invented, manufactured, and marketed the products.\r\n\r\nThe book shows how different developments over time raised efficiency and allowed production of more with less effort and materials, which brought us a large part of the wealth and prosperity we enjoy today. The stories of real inventors and industrialists are told, which includes not only their successes but also their problems and failures. The effect of good or bad management on manufacturing is a recurring theme in many chapters, as is the fight for intellectual property through thrilling tales of espionage. This is a story of successes and failures. It is not only about technology but also about social aspects. Ultimately, it is not a book about machines but about people!",
  "parsed": {
    "xt": "urn:btih:c51b78cd33c912e9d48d31b342ffc33ba59697ef",
    "dn": "Faster, Better, Cheaper in the History of Manufacturing (2016)",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "c51b78cd33c912e9d48d31b342ffc33ba59697ef",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        197,
        27,
        120,
        205,
        51,
        201,
        18,
        233,
        212,
        141,
        49,
        179,
        66,
        255,
        195,
        59,
        165,
        150,
        151,
        239
      ]
    },
    "name": "Faster, Better, Cheaper in the History of Manufacturing (2016)",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 47,
  "peers": 38,
  "last_updated": "2016-12-27T12:31:31.241Z"
}