{
  "title": "Google Earth Pro 7.1.5.1557 Final + Key [4realtorrentz]",
  "uid": 11961299,
  "size": 31579572,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:c57108c40991be0fab94fbeff3ea88685ed3864f&amp;dn=Google+Earth+Pro+7.1.5.1557+Final+%2B+Key+%5B4realtorrentz%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 169,
  "leechers": 1,
  "uploader": "menin1",
  "files": 1,
  "time": 1432564536,
  "description": "\nGoogle Earth a fresh assembly of the popular client software to work with three-dimensional model of the Earth, created on the basis of high resolution satellite images. Using genuine opportunity to change the scale of images (sometimes down to individual houses), and much more, including the coordinates of an object. The map can be rotated to any angle, most of the maps these are ordinary 2D-pictures, but some objects (settlements) are presented in the form of three dimensional models. Google Earth gives you a wealth of photographic, geographic and astronomical information.\n\nGoogle Earth combines satellite imagery, maps and the power of Google Search to put the world?s geographic information at your fingertips. Fly from space to your neighborhood. Type in an address and zoom right in. Search for schools, parks, restaurants, and hotels. Get driving directions. Tilt and rotate the view to see 3D terrain and buildings. Save and share your searches and favorites. Even add your own annotations.\n\nGoogle Earth lets you do smooth sailing flybyes of the entire Earth. You can easily fly to any spot on the globe, by entering any associated data, like street addresses, place names or lat/long coordinates. There are overlays that put additional information on the map, like roads, international boundaries, terrain, 3D buildings, crime statistics, schools, stadiums, any number of interesting stuff. You can do Local searches in the program, with icons on the map and a display on the side showing your results.\n\nYou can leave notes, called &quot;placemarks&quot; all over the map, so you can remember where all sorts of places are. Searches and placemarks can be saved as bookmarks in &quot;My Places&quot;. Everything can be output in an XML format called KML, that will allow the vast popularity of Google Maps to continue in Earth. You can also email a JPEG of the map, or send a KMZ file if you know the recipient has Earth installed.\n\n\nimage\n\n\nFeatures:\n- Sophisticated streaming technology delivers the data to you as you need it.\n- Imagery and 3D data depict the entire earth - Terabytes of aerial and satellite imagery depict cities around the world in high-resolution detail.\n- Local search lets you search for restaurants, hotels, and even driving directions. Results show in your 3D earth view. Easy to layer multiple searches, save results to folders, and share with others.\n- Layers show parks, schools, hospitals, airports, retail, and more.\n- Overlays ? import site plans, design sketches and even scanned blueprints.\n- Annotate the view with lines and polygons.\n- Spreadsheet import - ingest up to 2,500 locations by address or lat/lon.\n- KML ? data exchange format let your share useful annotations.\n\nUse it for:\n- Planning a trip\n- Getting driving directions\n- Finding a house or apartment\n- Finding a local business\n- Exploring the world\n\nOS : \nWindows XP, Windows Vista, Windows 7, Windows 8\n\nLanguage :\nMultilingual\n\n\nInstructions:\n\n1.Unpack and install\n2.Use given name and key to register\n3.Done",
  "parsed": {
    "xt": "urn:btih:c57108c40991be0fab94fbeff3ea88685ed3864f",
    "dn": "Google Earth Pro 7.1.5.1557 Final   Key [4realtorrentz]",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "c57108c40991be0fab94fbeff3ea88685ed3864f",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        197,
        113,
        8,
        196,
        9,
        145,
        190,
        15,
        171,
        148,
        251,
        239,
        243,
        234,
        136,
        104,
        94,
        211,
        134,
        79
      ]
    },
    "name": "Google Earth Pro 7.1.5.1557 Final   Key [4realtorrentz]",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 200,
  "peers": 0,
  "last_updated": "2016-12-27T12:33:27.658Z"
}