{
  "title": "Photodex ProShow Gold 8.0.3648 Incl Activator / Portable",
  "uid": 15450907,
  "size": 148935002,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:c5b6d309413089f41eedd2cff9d03f911888d708&amp;dn=Photodex+ProShow+Gold+8.0.3648+Incl+Activator+%2F+Portable&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 49,
  "leechers": 4,
  "uploader": "SadeemPC",
  "files": 2,
  "time": 1469941065,
  "description": "Photodex ProShow Gold 8.0.3648 + Portable\r\n\r\nCreate instant shows on your desktop with unlimited photos, videos and music. Customize easily. Share online or on TV. Build slideshows fast with the automatic wizard. Add photos, videos + text. Enhance with built-in FX. Built-in music library and editing tools. Share finished videos on TV, online and more.\r\n\r\nCombine photos, videos + music.\r\nCreate slideshows with as many photos, videos and songs as you want. Add from your computer or import fromFlickr, Picasa, Instagram and more. Add multiple photos to one slide for fun, multi-layered effects. ProShow makes working with video just as easy as using photos. Finally something to do with all those clips from your camera or cellphone.\r\n\r\nFast and easy to use\r\nUse the wizard to create instant shows. Just pick a theme and the wizard automatically creates a great-looking slideshow for you, timed perfectly to your music. Ready to watch or fine-tune in just moments. Browse hundreds of royalty-free tracks in the built-in music library to quickly find the perfect soundtrack for your show. When you're ready to take a little more control, ProShow makes it easy to work with your show. You can get started with just a few clicks, with more advanced features always within reach.\r\n\r\nAnimate with fun effects\r\nAdd cool effects and animations to your photos and videos with ProShow's slide styles and transitions. Simulate page turns, create multi-photo montages and more. Just click to preview an effect and apply to any slide in your show. You'll get fun and creative effects in an instant! Feeling creative? You can also customize motion effects for your photos and videos. Zoom into a point of interest, add some 3D, pan across a panoramic image or rotate any photo.\r\n\r\nEdit photos and videos in a flash\r\nProShow offers a sea of built-in editing tools. Fix flaws on the spot with crop, auto-correct and red-eye removal tools. Transform a color photo or video into dramatic black and white. You can even trim video clips!\r\n\r\nStyles &amp; transitions\r\nOver 650 built-in effects for your photos and videos.\r\n\r\nPan, zoom, 3D, rotate\r\nJust click and drag to create your own motion effects.\r\n\r\nTiming control\r\nSet times for slides and effects. Trim video + song length.\r\n\r\nInstant show creation\r\nLet ProShow do all the work with the show wizard.\r\n\r\nImage editing\r\nCrop, remove red-eye, color correct and more.\r\n\r\nMusic library\r\n300+ royalty free tracks for personal &amp; commercial shows.\r\n\r\nCustom captions\r\nAdd titles to any slide in your show. Choose your own font, color and size. Use cool effects to bring captions to life, simulate rolling credits, add fade-ins and outs, and create unique intro captions. Go beyond simple fly-in/ fly-out effects with custom caption motion effects.\r\n\r\nMusic and voiceovers\r\nProShow Gold comes stocked with a library of royalty-free music, instantly available to use in your shows. 280+ songs and 25 sound FX hand-picked to fit every occasion and licensed for personal and commercial use. Use built-in audio controls to crop songs, crossfade multiple tracks, record voiceovers and set custom fades. Record and add voiceovers to narrate your shows.\r\n\r\nShare on any screen\r\nSharing shows is easy, with over 40 popular formats for watching on TV, online, and devices. Easily post shows onand YouTube. Burn directly to DVD, Blu-ray, AVCHD and CD. Send slideshows to your iOS device with the free ProShow Remote app. Add a personal touch with Hollywood-style movie menus.\r\n\r\nMinimum Requirements:\r\n- Windows Vista, 7, 8, 10\r\n- 1024 x 768 display\r\n- 1GHz+ processor or better\r\n- 2GB system memory\r\n- Accelerated 3D graphics – 64MB ram\r\n- DirectX 8.0 or better\r\n- DVD+R/RW/-R/RW writer\r\n- 70 MB hard drive space\r\n\r\nWhat's New in ProShow Gold 8.0 \nhttp://www.photodex.com/proshow/gold#new",
  "parsed": {
    "xt": "urn:btih:c5b6d309413089f41eedd2cff9d03f911888d708",
    "dn": "Photodex ProShow Gold 8.0.3648 Incl Activator / Portable",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "c5b6d309413089f41eedd2cff9d03f911888d708",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        197,
        182,
        211,
        9,
        65,
        48,
        137,
        244,
        30,
        237,
        210,
        207,
        249,
        208,
        63,
        145,
        24,
        136,
        215,
        8
      ]
    },
    "name": "Photodex ProShow Gold 8.0.3648 Incl Activator / Portable",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 53,
  "peers": 50,
  "last_updated": "2016-12-25T13:24:59.352Z"
}