{
  "title": "Sony Sound Forge Pro 2.0.0 Mac osx intel-Dynamics [ChingLiu]",
  "uid": 9557921,
  "size": 95424730,
  "categoryP": "applications",
  "categoryS": "mac",
  "magnet": "?xt=urn:btih:c7027e15afda8872238430084eb5b7fbc77e0a4e&amp;dn=Sony+Sound+Forge+Pro+2.0.0+Mac+osx+intel-Dynamics+%5BChingLiu%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 37,
  "leechers": 1,
  "uploader": "Ching_Liu",
  "files": -1,
  "time": 1391382699,
  "description": "Flawless editing in OSÂ® X\n\nGenerate flawless audio files with Sound Forgeâ„¢ Pro Mac. New features include in-depth metering utilities, top-tier vocal processing, and the freestanding Convrtâ„¢ Batch Processing Automation Tool. Seamless integration with SpectraLayersâ„¢ Pro 2 provides the finishing touch, delivering the ultimate in waveform and spectral editing program integration. Employ Sound Forge Pro Mac in your studio workstream and open smooth new pathways to audio excellence in OS X.\n\nFocused editing - Sound Forge Pro Mac is the second-generation audio editing application designed exclusively for OS X, with expanded editing features incorporated by popular demand. Configurable viewing panels allow you to toggle to any project view you need in seconds see everything at once or toggle your view to see only the features you want, when you want. Easily navigate the entire interface and work quickly, even on laptops.\n\nRecord high-resolution audio - Assigning hardware, metering input signals, arming tracks, and recording high-resolution multichannel audio is a simple and fluid process in Sound Forge Pro Mac. Route your inputs, position the Record tool, click Record, and you're off. \n\nUser interface\n\nEditor panels - Maintaining concentration on editing tasks while managing many files at once is a demanding task. Sound Forge Pro Mac features two discrete audio editor panels, each with their own overview bar, file tabs, and transport controls. View the panels stacked or side by side, and drag tabbed files between them for editing.\n\nMedia browser - Locating files is easy in Sound Forge Pro Mac. Navigate in OS X style directly from the Media Browser tool. Find compatible audio files anywhere in your system and audition them by clicking dedicated buttons next to each one. Navigate your entire system without leaving the application.\n\nMeters - Place meters in the location and orientation that suits your style. Sound Forge Pro Mac features new options including CALM (Commercial Advertisement Loudness Mitigation Act) compliant metering that helps you follow the new rules while maximizing the dynamic range potential of your audio.\n\nPlug-in chooser - Fast access to available plug-ins, easy previewing and processing, and logical preset management are hallmarks of a quality audio-editing platform. Sound Forge Pro Mac features a dedicated panel for offline plug-in processing. Bring it into view with a single click to access plug-ins, plug-in presets, and search functionality.\n\nPlug-in chainer - Plug-in chains make sophisticated, nondestructive signal and effects processing operations possible, resulting in finished audio master files ready for duplication or broadcast. Establish a chain, apply and adjust plug-in parameter control envelopes, and render out precisely optimized master files.\n\nSignal and effects processing \n\nEnjoy a full range of native processes including volume, fade, flip, mute, normalize, and reverse. Enhance and repair audio with iZotope plug-ins including the complete Nectar Elements vocal processing engine. Easily solve time and pitch problems with artifact-free Zplaneâ„¢ algorithms. Access your entire plug-in collection for both offline and nondestructive processing. \n\nA one-stop audio mastering solution\n\nGenerate perfect master files straight away with Sound Forge Pro Mac. iZotope's Mastering and Repair Suite, the complete iZotope Nectar Elements Vocal Processing plug-in, and a host of native tools come standard. Simply drop them into the application's Plug-In Chain tool and process for broadcast-ready audio.\n\nWhat's new in Sound Forge Pro Mac 2\n\nInteroperability with SpectraLayers Pro 2 - Transfer audio data between Sound Forge Pro Mac and SpectraLayers Pro 2.1 and experience the thrill of working freely across the world's premiere waveform and spectral editing applications. Open a large file in Sound Forge Pro Mac and transfer selections of any size to SpectraLayers Pro 2.1 for fast, precise editing, then bring the result back to the source file in Sound Forge Pro Mac.\n\nEvent Mode improvements - Convert regions to events. Lock event markers, region markers, and envelope points to events. Automatically ripple successive events forward in time while editing.\n\nCALM-targeted metering - Win the volume war with new metering options available in Sound Forge Pro Mac. CALM (Commercial Advertisement Loudness Mitigation Act) compliant metering features help you follow the new rules while maximizing the dynamic range potential of your audio.\n\nFLAC file format support - Generate files in this popular lossless format that features space-saving compression and comprehensive metadata-handling capabilities.\n\nConvrtâ„¢ Batch Processing Automation Tool - New for Sound Forge Pro Mac 2, the Convrtâ„¢ Batch Processing Automation Tool is a freestanding utility for mass file format conversions, plug-in signal and effects processing treatments, and file metadata attachments including art. Simply import your files, create a script, and let Convrt do the rest. Convrt handles repetitive chores in the background while you continue recording and editing audio in the Sound Forge Pro Mac workspace.\n\nAuto Trim/Crop tool - Automatically remove unnecessary silence in a sound file while fading the edges of program segments in and out with user-controlled fade lengths.\n\nVolume plug-in - Modify the volume of a selection using this convenient process dialog.\n\nCustomizable toolbar - Cluster and access frequently used functions in a single convenient location.\n\niZotope Nectar Elements - The included Nectar Elements plug-in makes vocal treatment a snap. Whether you're recording or mixing, get great results quickly by loading one of Nectar's professionally designed Style presets in genres like rock, pop, folk, soul, and voiceover &amp; dialogue. From there, easily customize your sound by adjusting dedicated controls like Presence, Drive and Grit. Need to fix pitch problems, perform de-essing, or reduce room noise in your recording? Nectar Elements has you covered there as well, offering simple, intelligent controls that let you focus on your sound, not your setup.\n\nSystem requirements\n\n-Mac OS X 10.7 (Lion), 10.8 (Mountain Lion) or 10.9 (Mavericks)\n-IntelÂ® dual core processor\n-2 GB RAM\n-200 MB of free hard disk space for installation\n\nLanguage : English\n\nHomepage :  &lt;a href=&quot;\nhttp://www.sonycreativesoftware.com/soundforgepromac&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sonycreativesoftware.com/soundforgepromac&lt;/a&gt;",
  "parsed": {
    "xt": "urn:btih:c7027e15afda8872238430084eb5b7fbc77e0a4e",
    "dn": "Sony Sound Forge Pro 2.0.0 Mac osx intel-Dynamics [ChingLiu]",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "c7027e15afda8872238430084eb5b7fbc77e0a4e",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        199,
        2,
        126,
        21,
        175,
        218,
        136,
        114,
        35,
        132,
        48,
        8,
        78,
        181,
        183,
        251,
        199,
        126,
        10,
        78
      ]
    },
    "name": "Sony Sound Forge Pro 2.0.0 Mac osx intel-Dynamics [ChingLiu]",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 17,
  "peers": 17,
  "last_updated": "2016-12-27T12:44:39.548Z"
}