{"title":"Primitive Culture, Volume II","uid":15896913,"size":2762176,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c749bc7487e2581176695bbe1920b963237637d2&amp;dn=Primitive+Culture%2C+Volume+II&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":42,"leechers":5,"uploader":"marty14","files":1,"time":1474819298,"description":"Primitive Culture, Volume II - Edward Burnett Tylor [epub]\r\n\r\nThe first Professor of Anthropology at the University of Oxford, Edward B. Tylor, defined the term &quot;culture&quot; for modern readers in this groundbreaking work. Initially published in 1871, this classic two-volume study explores the full range of learned human behavior patterns in terms of the beliefs, wisdom, laws, artistic achievements, and mores that constitute a society. The formation of anthropology as a scientific discipline began with this work, which continues to exercise a profound influence on anthropologic studies.\r\n\r\nThe shared history of all humans, a common ground that evolved from primitive roots, constitutes the basis for Tylor's model of development. Drawing upon a worldwide variety of beliefs, rituals, and languages, the author illustrates an all-inclusive pattern of progress. His methods inaugurated the use of statistical data in anthropology, a standard procedure today but a landmark for his time. Volume I of Primitive Culture examines social evolution, language, and myth. The focus of this second volume is animism in society, which explores the tremendous diversity of thinking related to the concepts of the soul and religion as well as the marked similarities of spiritual beliefs","torrent":{"xt":"urn:btih:c749bc7487e2581176695bbe1920b963237637d2","amp;dn":"Primitive+Culture%2C+Volume+II","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c749bc7487e2581176695bbe1920b963237637d2","infoHashBuffer":{"type":"Buffer","data":[199,73,188,116,135,226,88,17,118,105,91,190,25,32,185,99,35,118,55,210]},"announce":[],"urlList":[]}}