{"title":"Victoria 2 Heart of Darkness.3DM","uid":8385383,"size":457290073,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c783dc11fc7d841dc8992c146119a113276891b4&amp;dn=Victoria+2+Heart+of+Darkness.3DM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":74,"leechers":5,"uploader":"binoklis","files":1,"time":1366279574,"description":"Victoria II: Heart of Darkness, the second expansion for the grand strategy/ political simulator focuses on the Scramble for Africa as you compete with other colonial powers and experience international crises which require Great Power mediation if the world is to avoid war. \nBecome a truly great power by the dawn of the 20th century in Victoria II, an experience crafted by Paradox Development Studio, the masters of Grand Strategy. \n\nFeatures \n\nExperience a brand new colonization system: Use your navy to expand your empire, compete against other colonial powers and struggle to maintain your overseas control. Colonial conflicts can spiral out of control and become international crises where they will have to be decided by diplomatic negotiations or risk costly wars. \nBattle your enemies in the new naval combat system: Together with the new colonization system, your navies are more important than ever. We have revamped the entire naval combat system and made it much more detailed and exciting with a new system of gun ranges and maneuvering into positions for battles. New powerful battleships join the other classes of ships to bridge the gap to Dreadnoughts. \nPrepare for International Crises: Around the world international crises continually call on the Great Powers to mediate and compromise, with war always being the last resort. As one of the lesser powers, use your influence to stir up the local flash points so you can use fleet footed diplomacy to get the Great Powers to right the wrongs that have been committed against your nation! \nFollow the global events with the new newspaper system: You will receive reports on local and global events as well as the world's changing situation to keep up to date and get a greater sense of immersion. Over 60 newspapers, both historic and otherwise, periodically present you with the latest news reports of war, major events, royal gossip and other matters of interest. \n\n1.Extract \n2.Play\n\nP.S\nI havent tested this very much. Played for a few minutes and it worked. Instalation was in chinese so I put this so people doesnt bitch about language.","torrent":{"xt":"urn:btih:c783dc11fc7d841dc8992c146119a113276891b4","amp;dn":"Victoria+2+Heart+of+Darkness.3DM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c783dc11fc7d841dc8992c146119a113276891b4","infoHashBuffer":{"type":"Buffer","data":[199,131,220,17,252,125,132,29,200,153,44,20,97,25,161,19,39,104,145,180]},"announce":[],"urlList":[]}}