{
  "title": "The Complete Blackest Night + Ex (2009-2010, Dgtl+S, Emp+MM)",
  "uid": 9532510,
  "size": 2721446230,
  "categoryP": "other",
  "categoryS": "comics",
  "magnet": "?xt=urn:btih:c7e77a590972544b5d374f14d084a41536043ab8&amp;dn=The+Complete+Blackest+Night+%2B+Ex+%282009-2010%2C+Dgtl%2BS%2C+Emp%2BMM%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 38,
  "leechers": 6,
  "uploader": "VikTSlick",
  "files": -1,
  "time": 1390868299,
  "description": "For more information about this event, please check out the following wiki entries: &lt;a href=&quot; http://en.wikipedia.org/wiki/Blackest_Night&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://en.wikipedia.org/wiki/Blackest_Night&lt;/a&gt;   &amp;   &lt;a href=&quot; http://dc.wikia.com/wiki/Blackest_Night&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://dc.wikia.com/wiki/Blackest_Night&lt;/a&gt;\n\nBlackest Night is a major DC event/crossover that involves the entire DC Universe, and primarily the Green Lantern Corps and the various other &quot;spectrum of light&quot; Corps that have sprung up around the mythos. All major players in DC were involved in this large scale event, including but not limited to: Batman, Superman, The Flash, Wonder Woman, JSA, JLA, Teen Titans, Outsiders, Secret Six, Suicide Squad, and assorted other groups and individuals. The main plot revolves around events foreshadowed long ago in the Oa Book of Prophecy, and specifically the existence of a Black Lantern Battery whose power is unleashed by Black Hand, in the service of Nekron - and these BL rings can more or less raise the dead and control them! Suffice to say, there are a LOT of dead heroes and villains from the past that spring up the past to haunt and taunt the primary cast. Blackest Night's main story was a huge commercial and critical success which built on the previous Sinestro Corps War (which I have uploaded here: &lt;a href=&quot; http://thepiratebay.se/torrent/9527469&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/torrent/9527469&lt;/a&gt;  ) and the various tie-ins also had varying degrees of positive feedback. Geoff Johns, the regular Green Lantern writer, was the primary architect/writer of the crossover. \n\nThis torrent includes ALL (yes, ALL) issues that DC officially considers part of the Blackest Night reading order, as seen via this image: &lt;a href=&quot; http://imgur.com/Qrxty&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://imgur.com/Qrxty&lt;/a&gt;   . I have numbered every file accordingly for reading convenience.\n\nI have made no alterations to that list, however an alternative reading list that varies slightly is here, for your comparison: http://www.readingorders.com/GreenLantern/BlackestNight\n\nThe two additional files on that list, Titans 15 and Solomon Grundy 7, are found in the &quot;Miscellaneous Prologue Materials&quot; folder. That folder also includes the 8-page Blackest Night intro in Adventure Comics written by Geoff Johns; Threshold Presents: Larfleeze, which serves as a good introduction to his character; and Final Crisis: Rage of the Red Lanters, which is another great set-up piece for Atrocitus and his group as well as revealing Saint Walker of the Blue Lanterns near the end. You should also have read or at least be familiar with the Sinestro Corps War, and Green Lantern v4 39-42 (&quot;Agent Orange&quot;) along with Green Lantern Corps v2 33-38 (&quot;Emerald Eclipse&quot;) are considered the Prelude to Blackest Night.\n\nThis release contains EVERY digital copy of the issues that exist as of 1/27/14; for those without digital copies, the high quality Minutemen scans are provided instead. Blackest Night 02 curiously does not have a Kingpin-Empire scan, so I have used the ZOOM scan instead. All scanners deserve MASSIVE credit for this torrent - thank you - and they are labeled on the files. Empire digital copies are via Kingpin, Zoom and Monafekk, and Minutemen scanners are DTs, Sha-Hic!, Calamity Coyote and others. Thanks SO MUCH, seriously, and credit to ALL the great original uploaders as well, especially - shipjolly for the hitlists, gesserit for the main Blackest Night copies, Ahlat for the Larfleeze one-shot and so, so many &quot;other sources&quot; I can't even begin to name and list. They really make torrenting worthwhile! :-)\n\nThanks to you as well for reading this wall of text/release information, and I hope you enjoy downloading and reading these. Please do the community the favor of SEEDING as long as you can, even if only in parts. It really helps. Enjoy! :-0",
  "parsed": {
    "xt": "urn:btih:c7e77a590972544b5d374f14d084a41536043ab8",
    "dn": "The Complete Blackest Night   Ex (2009-2010, Dgtl S, Emp MM)",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "c7e77a590972544b5d374f14d084a41536043ab8",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        199,
        231,
        122,
        89,
        9,
        114,
        84,
        75,
        93,
        55,
        79,
        20,
        208,
        132,
        164,
        21,
        54,
        4,
        58,
        184
      ]
    },
    "name": "The Complete Blackest Night   Ex (2009-2010, Dgtl S, Emp MM)",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 3,
  "peers": 0,
  "last_updated": "2016-12-27T12:50:02.604Z"
}