{
  "title": "Police State: How Americas Cops Get Away with Murder (2015)",
  "uid": 15870963,
  "size": 938161,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:c84a9eeac04c5048288a02808eb38278a5583a76&amp;dn=Police+State%3A+How+Americas+Cops+Get+Away+with+Murder+%282015%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 41,
  "leechers": 0,
  "uploader": "Dr.Soc",
  "files": 1,
  "time": 1474425065,
  "description": "Police State: How America's Cops Get Away with Murder By Gerry Spence\r\n2015 | 352 Pages | ISBN: 1250073456 | EPUB | 2 MB\r\n\r\n\r\nHow does America, founded on the promise of freedom for all, find itself poised to become a police state? In Police State, legendary &quot;country lawyer&quot; Gerry Spence reveals the unnerving truth of our criminal justice system. In his more than sixty years in the courtroom, Spence has never represented a person charged with a crime in which the police hadn't themselves violated the law. Whether by hiding, tampering with, or manufacturing evidence; by gratuitous violence and even murder, those who are charged with upholding the law too often break it. Spence points to the explosion of brutality leading up to the murder of Freddie Gray in Baltimore, insisting that this is the way it has always been: cops get away with murder. Nothing changes. Police State narrates the shocking account of the Madrid train bombings - how the FBI accused an innocent man of treasonous acts they knew he hadn't committed. It details the rampant racism within Chicago's police department, which landed teenager Dennis Williams on death row. It unveils the deliberately coercive efforts of two cops to extract a false murder confession from frightened and mentally fragile Albert Hancock, along with other appalling evidence from eight of Spence's most famous cases. We all want to feel safe. But how can we be safe when the very police we pay to protect us instead kill us, maim us, and falsify the evidence against us? Can we accept the argument that cops may occasionally overstep their boundaries, but only when handling guilty criminals and never with us? Can we expect them to investigate and prosecute themselves when faced with allegations of misconduct? Can we believe that they are acting for our own good? Too many innocent are convicted; too many are wrongly executed. The cost has become too high for a free people to bear. In Police State, Spence issues a stinging indictment of the American justice system. Demonstrating that the way we select and train our police guarantees fatal abuses of justice, he also prescribes a challenging cure that stands to restore America's promise of liberty and justice for all",
  "parsed": {
    "xt": "urn:btih:c84a9eeac04c5048288a02808eb38278a5583a76",
    "dn": "Police State: How Americas Cops Get Away with Murder (2015)",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "c84a9eeac04c5048288a02808eb38278a5583a76",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        200,
        74,
        158,
        234,
        192,
        76,
        80,
        72,
        40,
        138,
        2,
        128,
        142,
        179,
        130,
        120,
        165,
        88,
        58,
        118
      ]
    },
    "name": "Police State: How Americas Cops Get Away with Murder (2015)",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 41,
  "peers": 30,
  "last_updated": "2016-12-25T13:42:27.100Z"
}