{"title":"Divergent (Audiobook) [Chapterized]","uid":8967384,"size":740439153,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c8a64a2efc02c7287f584958cc10b22ddffeaa44&amp;dn=Divergent+%28Audiobook%29+%5BChapterized%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":60,"leechers":3,"uploader":"Audio023","files":-1,"time":1380246612,"description":"Chapterized\nUnabridged\n144 kbps\n\nIn Beatrice Prior's dystopian Chicago world, society is divided into five factions, each dedicated to the cultivation of a particular virtue--Candor (the honest), Abnegation (the selfless), Dauntless (the brave), Amity (the peaceful), and Erudite (the intelligent). On an appointed day of every year, all sixteen-year-olds must select the faction to which they will devote the rest of their lives. For Beatrice, the decision is between staying with her family and being who she really is--she can't have both. So she makes a choice that surprises everyone, including herself.\n\nDuring the highly competitive initiation that follows, Beatrice renames herself Tris and struggles alongside her fellow initiates to live out the choice they have made. Together they must undergo extreme physical tests of endurance and intense psychological simulations, some with devastating consequences. As initiation transforms them all, Tris must determine who her friends really are--and where, exactly, a romance with a sometimes fascinating, sometimes exasperating boy fits into the life she's chosen. But Tris also has a secret, one she's kept hidden from everyone because she's been warned it can mean death. And as she discovers unrest and growing conflict that threaten to unravel her seemingly perfect society, Tris also learns that her secret might help her save the ones she loves . . . or it might destroy her.","torrent":{"xt":"urn:btih:c8a64a2efc02c7287f584958cc10b22ddffeaa44","amp;dn":"Divergent+%28Audiobook%29+%5BChapterized%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8a64a2efc02c7287f584958cc10b22ddffeaa44","infoHashBuffer":{"type":"Buffer","data":[200,166,74,46,252,2,199,40,127,88,73,88,204,16,178,45,223,254,170,68]},"announce":[],"urlList":[]}}