{
  "title": "Heroes III Complete + WoG 3.58f",
  "uid": 4508447,
  "size": 875236195,
  "categoryP": "games",
  "categoryS": "pc",
  "magnet": "?xt=urn:btih:cb3ba8f621f099db0b0f60269c31c18b4d19501b&amp;dn=Heroes+III+Complete+%2B+WoG+3.58f&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 39,
  "leechers": 1,
  "uploader": "asdrre",
  "files": 1,
  "time": 1226684476,
  "description": "Heroes III Complete + WoG 3.58f \n\n(RoE, AB, SoD, WoG)\n\n\n\nUnpack and play no install needed cracked and ready\n\nStart the game with (h3wog.exe) to play Wake of Gods\n\nScanned with Eset NOD32 Antivirus\n\n\n\n\n\nThe Wake of Gods (WoG for short) is an unofficial fan-created add-on to Heroes of Might &amp; Magic III Complete\n\n    * ERM Scripting Language: ERM (Event Related Model) is an extensive and powerful scripting language. ERM scriptwriters can simulate new objects, artifacts, creature abilities, rules of play, and so much more. ERM can be used by map makers to create story-driven adventures, or by players to create and share global scripts that may be used in every game they play.\n\n    * WoGification: WoG Team members have already written dozens of complex scripts using ERM that may be individually turned on or off for a given game. Existing Heroes maps, including random maps, can be &quot;wogified&quot; to include these scripts chosen by the player, some of which may even add new scripted objects or artifacts to the game. No two WoG games ever need be the same with the thousands upon thousands of script combinations available.\n\n    * New Monsters, New Artifacts and New Objects: WoG includes about two dozen new hard-coded monsters (although many are currently based on existing creatures) and several new unique objects (such as preprogrammed riddle Sphinxes) and new artifacts (like the new combination artifact know as the Barbarian Lord's Axe of Ferocity) as well as a selection of new &quot;blank&quot; objects and artifacts, ideal for scripting.\n\n    * New Features: WoG includes many new and exciting hard-coded features such as Commanders (a battlefield creature that gains experience and player-selected skills, and can even use special Commander Artifacts), Town Demolition (rebuild it into another town type when it's fully destroyed), Arrow Tower Experience (defend a town long enough and its towers will be truly formidable!), Creature Stack Experience (every stack will accumulate experience from battle and advance in ranks, gaining higher stats and new abilities), and even more! These hard-coded features may be selected in the same way that WoGify scripts are chosen or they may enabled by map makers for custom-created maps.\n\nEnjoy",
  "parsed": {
    "xt": "urn:btih:cb3ba8f621f099db0b0f60269c31c18b4d19501b",
    "dn": "Heroes III Complete   WoG 3.58f",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "cb3ba8f621f099db0b0f60269c31c18b4d19501b",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        203,
        59,
        168,
        246,
        33,
        240,
        153,
        219,
        11,
        15,
        96,
        38,
        156,
        49,
        193,
        139,
        77,
        25,
        80,
        27
      ]
    },
    "name": "Heroes III Complete   WoG 3.58f",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 75,
  "peers": 28,
  "last_updated": "2016-12-27T13:11:27.106Z"
}