{
  "title": "Rocky Complete Collection Part I, II, III, IV, V, VI + Extras DV",
  "uid": 6956200,
  "size": 4460418694,
  "categoryP": "video",
  "categoryS": "movies",
  "magnet": "?xt=urn:btih:ccf1fe365dc94004691c7f054eb0633041737980&amp;dn=Rocky+Complete+Collection+Part+I%2C+II%2C+III%2C+IV%2C+V%2C+VI+%2B+Extras+DV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 37,
  "leechers": 15,
  "uploader": "TSV",
  "files": -1,
  "time": 1326585856,
  "description": "Rocky is a 1976 American sports drama film directed by John G. Avildsen and both written by and starring Sylvester Stallone. It tells the rags to riches American Dream story of Rocky Balboa, an uneducated but kind-hearted debt collector for a loan shark in the city of Philadelphia, Pennsylvania. Rocky starts out as a club fighter who later gets a shot at the world heavyweight championship. It also stars Talia Shire as Adrian, Burt Young as Adrian's brother Paulie, Burgess Meredith as Rocky's trainer Mickey Goldmill, and Carl Weathers as the champion, Apollo Creed.\n\nThe film, made on budget of less than $1 million and shot in 28 days, was a sleeper hit; it made over $225 million the highest grossing film of 1976, and won three Oscars, including Best Picture. The film received many positive reviews and turned Stallone into a major star. It spawned five sequels: Rocky II, III, IV, V and Rocky Balboa.\n\n\nAll 6 films DVDRip. Please seed at a decent speed.\n\n\n\n\nLet me tell you something you already know. The world ain't all sunshine and rainbows. It's a very mean and nasty place and I don't care how tough you are it will beat you to your knees and keep you there permanently if you let it. You, me, or nobody is gonna hit as hard as life. But it ain't about how hard ya hit. It's about how hard you can get it and keep moving forward. How much you can take and keep moving forward. That's how winning is done! Now if you know what you're worth then go out and get what you're worth, seed this for months.",
  "parsed": {
    "xt": "urn:btih:ccf1fe365dc94004691c7f054eb0633041737980",
    "dn": "Rocky Complete Collection Part I, II, III, IV, V, VI   Extras DV",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "ccf1fe365dc94004691c7f054eb0633041737980",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        204,
        241,
        254,
        54,
        93,
        201,
        64,
        4,
        105,
        28,
        127,
        5,
        78,
        176,
        99,
        48,
        65,
        115,
        121,
        128
      ]
    },
    "name": "Rocky Complete Collection Part I, II, III, IV, V, VI   Extras DV",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 52,
  "peers": 49,
  "last_updated": "2016-12-25T14:12:22.926Z"
}