{"title":"Call of Duty: Black Ops - 1.15 [Native][MacAppStore]","uid":7692102,"size":12939877363,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:cd4e7e7d459e109726991080ad9c56c34bf6bf8a&amp;dn=Call+of+Duty%3A+Black+Ops+-+1.15+%5BNative%5D%5BMacAppStore%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":85,"leechers":30,"uploader":"dangreen","files":2,"time":1349270425,"description":"Call of Duty: Black Ops Includes First Strike DLC! Enjoy 4 additional multiplayer maps and an additional zombie experience. Play the Rezurrection DLC, available via in-app purchase, offering 4 re-mastered levels of spooky Zombie lore, plus an all new Moon level!\n\nCall of Duty: Black Ops for the Mac takes players to conflicts across the globe as elite Black Ops forces fight in the deniable operations and secret wars that occurred under the veil of the Cold War. The included First Strike DLC gives you 5 additional incredibly diverse maps, including 4 new multiplayer maps and a chilling new Zombie experience. Call of Duty: Black Ops features an epic single-player campaign, an incredibly deep Mac-to-Mac multiplayer experience and expanded co-op gameplay. Call of Duty: Black Ops offers amazing enhanced graphics, streaming texture technology, and superior lighting effects.\n\nBonus Content\nThe included First Strike DLC gives you 5 incredibly diverse maps spanning the globe, including 4 new multiplayer maps and a chilling new Zombie experience, all at no extra charge!\n\nThe hallmark intensity of Call of Duty returns with an impressive single-player campaign that takes players deep behind enemy lines as an elite Black Ops soldier engaging in covert warfare, classified operations, and explosive conflicts across the globe.\n\nZOMBIES! For the first time on the Mac, fight to survive in one of the most thrilling and critically acclaimed co-op experiences in gaming.\n\nExpanding on the series ultimate multiplayer experience, Call of Duty: Black Ops takes competitive play to new heights. Expect the fast-paced, action-packed combat you love with more features than ever before.\n\nby CNC: multiplayer is work! ZOMBIE DLC is added!","torrent":{"xt":"urn:btih:cd4e7e7d459e109726991080ad9c56c34bf6bf8a","amp;dn":"Call+of+Duty%3A+Black+Ops+-+1.15+%5BNative%5D%5BMacAppStore%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd4e7e7d459e109726991080ad9c56c34bf6bf8a","infoHashBuffer":{"type":"Buffer","data":[205,78,126,125,69,158,16,151,38,153,16,128,173,156,86,195,75,246,191,138]},"announce":[],"urlList":[]}}