{"title":"Call of Duty Advanced Warfare v 1.18.1281374.0 PC RiP Decepticon","uid":12659452,"size":29983978276,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:cda184a29a3aede6f109ea91d7ad7d4ee3f89441&amp;dn=Call+of+Duty+Advanced+Warfare+v+1.18.1281374.0+PC+RiP+Decepticon&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":165,"leechers":67,"uploader":"16saviour61","files":12,"time":1446282129,"description":"Year: 2014\r\nGenre: Action (shooter), 3D, 1st person\r\nDeveloper: Sledgehammer Games, High Moon Studios\r\nPublisher: Activision\r\nPublication Type: RiP\r\nPlatform: PC\r\nLanguage: Russian, English\r\nLanguage: Russian, English\r\nCrack: enclosing (3DM)\r\n\r\nSystem requirements:\r\nOperating System: Windows 7/8 / 8.1 (64-bit only)\r\nProcessor: Core i3 2.93 GHz / Phenom II X4 810 2.60 GHz\r\nMemory: 6 GB\r\nVideo: 1 GB, GeForce GTS 450 / Radeon HD 5870, DirectX 11\r\nSound card: compatible with DirectX 11\r\nFree space on HDD: 37 GB\r\n\r\nDescription:\r\nThe future knows no mercy. On the ruins of the old world that has survived the collapse of the usual geopolitical and military structures, a new force - the private military company, whose leadership wants to bring to mankind the hope for a decent life. Technique against anarchy, iron order against chaos. Welcome to 2054, where there is a war.\r\nCall of Duty: Advanced Warfare was developed over three years, taking into account all the features of the new generation of gaming systems. This new approach to the creation of games will apply the new tactics. Advanced military technology and unique exoskeleton help to survive where ordinary soldiers would not last five minutes! In addition, you expect an exciting storyline and new characters, one of which is the role played winner &quot;Oscar&quot; Kevin Spacey.\r\n\r\nFeatures:\r\nImproved world:\r\nThe plot Call of Duty: Advanced Warfare developing in the expected future, which proved largely predetermined by the penetration of technological progress in the military sphere.\r\nIn this carefully crafted world of the future, private military corporations (PMCs) have become the dominant force for many countries, attracting the army side, redraw borders and rewriting the rules of war.\r\nJonathan Irons, founder and president of the world's largest PMCs - Atlas Corporation - is the epicenter of events.\r\n\r\nImproved soldiers:\r\nPowerful exoskeletons completely change the concept of training soldiers, making them deadly in battle and eliminating the need for separate military specializations.\r\nThe introduction of this element of the game has improved the mechanics of movement of players, add high jumps and clinging, a system of invisibility and biomechanics, providing unmatched strength, perception, endurance and speed.\r\nWith the development of improved and new exoskeleton armor and weapons each soldier takes unprecedented tactical freedom, regardless of the terrain, which reverses the usual players Call of Duty game design in all modes.\r\n\r\nEnhanced arsenal:\r\nUsing the power of next generation platforms, Call of Duty: Advanced Warfare will bring the players on the battlefield of the future with high-tech arsenal of advanced and a set of skills, providing them with a completely new equipment, technologies, and perks such techniques as hoverbayki and specialized drones.\r\nPlayers will also be able to choose between conventional ammunition and a unique energy weapon, which completely changes the dynamics of the gameplay.\r\nWith exoskeletons that give unprecedented power and tactical freedom, Call of Duty: Advanced Warfare makes evolution in the genre of shooters.\r\n\r\nFeatures RiP'a:\r\nThe basis is taken license content\r\n- Do not recoded\r\n- Removed the multiplayer\r\n- Archives of the game is not affected\r\n- Ability to download just the right location &quot;game-rus-1 (2) .bin (Russian), game-eng-1 (2) .bin (English)&quot;\r\n- Version of the game: 1.18.1281374.0\r\n- Installation time: ~ 30 minutes | It depends on the capacity of the computer\r\nDLC:\r\n* SP Exo Upgrade\r\nAuthor RiP'a: Decepticon","torrent":{"xt":"urn:btih:cda184a29a3aede6f109ea91d7ad7d4ee3f89441","amp;dn":"Call+of+Duty+Advanced+Warfare+v+1.18.1281374.0+PC+RiP+Decepticon","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cda184a29a3aede6f109ea91d7ad7d4ee3f89441","infoHashBuffer":{"type":"Buffer","data":[205,161,132,162,154,58,237,230,241,9,234,145,215,173,125,78,227,248,148,65]},"announce":[],"urlList":[]}}