{"title":"Street Legal Racing Redline SLRR","uid":4532282,"size":558032345,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ce323a8cb1f1f182373e7a2d33432b227df5ea27&amp;dn=Street+Legal+Racing+Redline+SLRR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":53,"leechers":2,"uploader":"zer0tribe","files":1,"time":1227601905,"description":"This is a cd image of Street Legal Racing Redline.\nThere are two patches included with this torrent.\n\nThe first is to bring it up to the latest pacth released from Activison. 2.2.1\n\nThe Second is a patch made by some one who knows what there doing and I personally like it better it has more engines and the parts catolog is easier to use. The garage is just a little different to. LE 2.3.0\n\nNow I use demon tools lite to mount this .cue but, I have also used magic iso.\n\nThis is an old game but I love it simply for building the engine up and wrecking the car. In this game you have damage parts can fly off and our engine even can come out if you hit something fast enough. There are two main races in this game. First is driving down the road and just street racing. Second is in the middle of the night Drag Races. There are 3 clubs to level up threw and the higher the club there more money people will bet. After getting threw the three clubs there is a ROC race. The Race Of Champions has 4 cars you race against on a different track. These cars are tuned to the max and the skills are the hardest in the game to beat. When you win you get a supercar with 1000+ hp and light as can be.\n\nWell enough idle explaining of the game I&amp;#039;ll be releasing another torrent later that has editors to this game to model script and make you own cars or engines or anything thing you want. Please keep in mind that doing this is very time consuming and difficult without javascript knowledge or 3d modeling knowledge. There is a wide variety of cars out there already modeled and avalible for download. I will also be downloading these myself and put them out for you all.\n\nThanks and enjoy the game.\nZer0tribe","torrent":{"xt":"urn:btih:ce323a8cb1f1f182373e7a2d33432b227df5ea27","amp;dn":"Street+Legal+Racing+Redline+SLRR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce323a8cb1f1f182373e7a2d33432b227df5ea27","infoHashBuffer":{"type":"Buffer","data":[206,50,58,140,177,241,241,130,55,62,122,45,51,67,43,34,125,245,234,39]},"announce":[],"urlList":[]}}