{
  "title": "Incomedia WebSite X5 Professional v11.0.5.24 + Keygen - [FirstUp",
  "uid": 11735451,
  "size": 297247906,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:d05ed75f808619af849bdef061e7be8d7a18e5d5&amp;dn=Incomedia+WebSite+X5+Professional+v11.0.5.24+%2B+Keygen+-+%5BFirstUp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 78,
  "leechers": 2,
  "uploader": "FirstUploads",
  "files": 5,
  "time": 1425556037,
  "description": "Incomedia WebSite X5 Professional v11.0.5.24 + Keygen - [FirstUploads]\n\n\n\nWebSite X5 Professional 11 is the Perfect Solution for Creating Websites, Blogs and Online Stores. Optimized for search engines and fully functional on tablets and smartphones. In addition, it is complete with an app for mobile devices!\n\nDesigned for those who need to create professional websites, WebSite X5 Professional 11 maintains the structure of a guided tour, but has loads of extra tools and advanced features. The result is an amazing combination of simplicity and power.\n\nMAIN FEATURES\n\nThis app offers a value-added service: a website that displays and functions correctly on a mobile device, and complete with an app.\nThe FeedReady app is ready and free for both iOS and Android: link it to your blog or RSS feeds and invite users to download it so they can receive all your news on their tablets and smartphones.\n\nImport the product list and create the catalog, configuring all the necessary information: descriptions, costs, variants, photos, availability, etc. You have all the tools you need to present products in their best light and set up the purchasing process, deciding on delivery and payment methods and current promotions, using coupons, if you want.\n\nUse the Dynamic contents feature so that others can update them, as for the CMS, working directly online. You maintain complete control over the project, with the advantage that clients don't have to depend on you for small changes.\n\nLet users register online to members' areas so that, once they have validated their e-mail address, they can access the areas that require a login and password. You can store the data in a database and handle registration through the online Control Panel.\n\nUse the available options to improve the optimization of website pages and contents: pictures, videos, products, etc. Before going online, use the project analysis features to further improve optimization.\n\nActivate the bundled web-hosting service: 12 months of web space, broadband, databases and unlimited e-mails, as well as hosting and managing all the domains you want through the control panel",
  "parsed": {
    "xt": "urn:btih:d05ed75f808619af849bdef061e7be8d7a18e5d5",
    "dn": "Incomedia WebSite X5 Professional v11.0.5.24   Keygen - [FirstUp",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "d05ed75f808619af849bdef061e7be8d7a18e5d5",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        208,
        94,
        215,
        95,
        128,
        134,
        25,
        175,
        132,
        155,
        222,
        240,
        97,
        231,
        190,
        141,
        122,
        24,
        229,
        213
      ]
    },
    "name": "Incomedia WebSite X5 Professional v11.0.5.24   Keygen - [FirstUp",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 4,
  "peers": 3,
  "last_updated": "2016-12-27T13:43:37.454Z"
}