{
  "title": "The Blue Book of Grammar and Punctuation (11th Ed)(gnv64)",
  "uid": 10159759,
  "size": 25280173,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:d13138e2327064869d1ea5da65c60a86092d7b81&amp;dn=The+Blue+Book+of+Grammar+and+Punctuation+%2811th+Ed%29%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 38,
  "leechers": 0,
  "uploader": "gnv65",
  "files": -1,
  "time": 1400233281,
  "description": "The Blue Book of Grammar and Punctuation: An Easy-to-Use Guide with Clear Rules, Real-World Examples, and Reproducible Quizzes (11th Ed)\nby Jane Straus, Lester Kaufman and Tom Stern\nWiley | February 2014 | ISBN-10: 1118785568 | ePUB/True PDF | 1.53/22.5 mb\n\nA revised and updated new edition of the bestselling workbook and grammar guide.\nThe Blue Book of Grammar and Punctuation is a concise, entertaining workbook and guide to English grammar, punctuation, and usage. This user-friendly resource includes simple explanations of grammar, punctuation, and usage; scores of helpful examples; dozens of reproducible worksheets; and pre- and post-tests to help teach grammar to students of all ages. Appropriate for virtually any age range, this authoritative guide makes learning English grammar and usage simple and fun. This updated Eleventh Edition reflects the latest updates to English usage and grammar and features a fully revised two-color design and lay-flat binding for easy photocopying.\n\n- Clear and concise, easy-to-follow, offering &quot;just the facts&quot;\n- Fully updated to reflect the latest rules in grammar and usage along with new quizzes\n- Ideal for students from seventh grade through adulthood in the US and abroad\n\nFor anyone who wants to understand the major rules and subtle guidelines of English grammar and usage, The Blue Book of Grammar and Punctuation offers comprehensive, straightforward instruction.\n\nAbout the Author\nJane Straus (1954-2011) was an educator and best-selling author. She taught English grammar, punctuation, and writing classes to corporate as well as state and federal government employees. She developed her own materials that conveyed the rules of English in plain English. She continued to refine her materials, eventually turning them into The Blue Book of Grammar and Punctuation. When the Internet was born, she launched a website, GrammarBook.com, which has helped millions of people all over the world improve their English grammar. Straus became a sought-after speaker in the fields of grammar, public speaking, and life coaching. Her other book is Enough Is Enough! Stop Enduring and Start Living Your Extraordinary Life (Jossey-Bass, 2005).\n\nFollowing Straus's untimely passing in early 2011, her husband, Lester Kaufman, assumed management of GrammarBook.com and maintained Jane's legacy by continuing to issue weekly e-newsletters containing grammar tips to help people improve their English skills, and answering reader's questions in, as much as possible, the same light, direct, and instructive tone that Jane used. In collaboration with Tom Stern, he also undertook an update and revision of the Blue Book which was published in February 2014.\n\nBRIEF CONTENTS\nPreface and Acknowledgments xv\nAbout the Authors xvii\nIntroduction xix\n1 GRAMMAR 1\n2 PUNCTUATION 25\n3 CAPITALIZATION 49\n4 WRITING NUMBERS 57\n5 CONFUSING WORDS AND HOMONYMS 61\n6 QUIZZES 125\n7 ANSWERS TO QUIZZES 161\nIndex 195",
  "parsed": {
    "xt": "urn:btih:d13138e2327064869d1ea5da65c60a86092d7b81",
    "dn": "The Blue Book of Grammar and Punctuation (11th Ed)(gnv64)",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "d13138e2327064869d1ea5da65c60a86092d7b81",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        209,
        49,
        56,
        226,
        50,
        112,
        100,
        134,
        157,
        30,
        165,
        218,
        101,
        198,
        10,
        134,
        9,
        45,
        123,
        129
      ]
    },
    "name": "The Blue Book of Grammar and Punctuation (11th Ed)(gnv64)",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 50,
  "peers": 57,
  "last_updated": "2016-12-27T13:48:28.416Z"
}