{
  "title": "Beachbody Body Beast Workout (HEVC x265)",
  "uid": 15421427,
  "size": 3145954413,
  "categoryP": "other",
  "categoryS": "other",
  "magnet": "?xt=urn:btih:d21804a2bea8826e9f1e5be803d8a86ee5f7bec8&amp;dn=Beachbody+Body+Beast+Workout+%28HEVC+x265%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 41,
  "leechers": 5,
  "uploader": "MrTVGuy",
  "files": 25,
  "time": 1469643350,
  "description": "Body Beast conditioning system is capable of adding ten pounds of lean muscle in 90 days\r\nIncludes four DVDs with 12 workouts, &quot;Book of the Beast&quot; workout and nutrition/supplement guide, and two-sided training schedule\r\n\r\nSchedule has the &quot;HUGE&quot; schedule on front and the &quot;LEAN&quot; schedule on back to tailor your workouts for desired results\r\n\r\nBuilt on concept of Dynamic Set Training, a specific sequence of sets and reps which maximizes muscle's time under tension with goal of exhausting muscle and &quot;recruiting&quot; more muscle fiber\r\nDynamic Set Training also designed to help enhance your body's testosterone production; testosterone is primary hormone responsible for developing muscle mass.\r\n\r\nWhat is Body Beast?\r\n\r\nBody Beast is a powerful fat-burning, muscle-defining, weight-training program that can help you get completely ripped and chiseled in just 90 days. Created by Sagi Kalev, world-renowned trainer and former two-time Mr. Israel, Body Beast combines extreme workouts, groundbreaking nutrition, and scientifically advanced supplementation. Whether you’re new to lifting weights or are a certified gym rat, Body Beast will deliver results beyond what you imagined possible.\r\n\r\nBody Beast is the first training regimen designed to get you a head-turning physique—in the comfort of your home. You don’t need to join a gym, hire a spotter, or have an Olympic weight-lifting set. With dumbbells, the correct nutrition, and the desire to work hard, Body Beast will help you get completely shredded and help you carve sexy, contoured muscles, without spending thousands on a personal trainer or an expensive gym membership.\r\n\r\nAnd the best part is, Sagi Kalev will motivate and inspire you, as he has done for countless professional bodybuilders over the last few decades.\r\n\r\nBody Beast includes 12 different cutting-edge workouts that fuse the best of old-school resistance training with a new breakthrough in sports science called Dynamic Set Training.\r\n\r\nIncreases in resistance, power, tempo, and volume lead to greater lean muscle gain and fast results.\r\n\r\nThe Body Beast Eating Plan (Included inside 'The Book of the Beast' helps you strip away the fat, while carving lean muscle.\r\n\r\nThe Workouts\r\n\r\n1. Build: Chest/Tris - Focused on the muscles of your chest and triceps, a combination of Super, Giant, and Single Sets will create strength and definition (49 minutes).\r\n\r\n2. Build: Shoulders - Focused on creating stunning deltoids, this workout begins to round out the shoulders to start putting shape in your new upper body (38 minutes).\r\n\r\n3. Build: Legs - Shed fat, Build muscle, and tone up. Focused on Building powerful quads, hamstrings, calves, and glutes (38 minutes).\r\n\r\n4. Build: Back/Bis - Create more defined lats, traps, rhomboids, and biceps for a sexy and defined backside. Get ready to pull and curl (50 minutes).\r\n\r\n5. Bulk: Chest - Uses Super Sets, Force Sets, Progressive Sets, Combo Sets, and Multi-Sets with an increase in resistance to help define your pecs. Different angles and exercises hit different fibers of the fan-shaped muscle. The addition of Progressive Sets really focuses on muscular hypertrophy (30 minutes).\r\n\r\n6. Bulk: Back - Uses Super Sets and Force Sets with an increase in resistance to create a well-defined back. The addition of Force Sets creates a focus on hypertrophy (29 minutes).\r\n\r\n7. Bulk: Legs - Progressive Sets, Force Sets, and Super Sets help your legs burn fat while significantly cutting and defining the muscles (40 minutes).\r\n\r\n8. Bulk: Shoulders - Super Sets and Progressive Sets focus more on the posterior delt (or back of the shoulder), creating an even more 3-D appearance. Added weight and lower reps help pronounce the hypertrophy effect (35 minutes).\r\n\r\n9. Bulk: Arms - Focused training with Progressive Sets, Force Sets, and Super Sets to create ripped biceps and triceps (36 minutes).\r\n\r\n10. Beast: Abs - A strong core not only helps you lift heavier weight safely, it helps improve your posture too (11 minutes).\r\n\r\n11. Beast: Cardio - This new-school, performance-oriented, cardio workout not only helps cut you up, it increases your ability to shred more fat and get more defined (30 minutes).\r\n\r\n12. Beast: Total Body - A circuit routine for your entire body. Good to have when reality sets in and you need to (*gulp*) miss a workout day . .. or two (39 minutes).\r\n\r\nMeet the Trainer - Sagi Kalev\r\n\r\nSagi Kalev started his fitness journey over 25 years ago, back home in Israel, and made his mark in the industry by earning the coveted title of Mr. Israel—twice. But Sagi is more than a big, buff guy. He's one heck of a brainiac too. Not only does he hold a degree in physical education with a minor in nutrition from the University of Central Florida, Sagi's a clinical nutritionist as well as a functional medicine practitioner. And what that means for you is that since Sagi is an expert on how the human body operates and what you need to do in order to achieve rapid results, he's the go-to guy for total-body transformation. You'll learn how to unleash your body's natural power to build muscle as well as carve incredibly defined lines. Sagi has appeared in thousands of bodybuilding magazines, and has been featured on more than 50 international magazine covers, including appearing on the cover of Muscle &amp; Fitness magazine an amazing 11 times. He is a Master Professional Personal Trainer and a member of the IFBB Propta Hall of Fame",
  "parsed": {
    "xt": "urn:btih:d21804a2bea8826e9f1e5be803d8a86ee5f7bec8",
    "dn": "Beachbody Body Beast Workout (HEVC x265)",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "d21804a2bea8826e9f1e5be803d8a86ee5f7bec8",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        210,
        24,
        4,
        162,
        190,
        168,
        130,
        110,
        159,
        30,
        91,
        232,
        3,
        216,
        168,
        110,
        229,
        247,
        190,
        200
      ]
    },
    "name": "Beachbody Body Beast Workout (HEVC x265)",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 46,
  "peers": 75,
  "last_updated": "2016-12-25T14:44:09.172Z"
}