{
  "title": "Marijuana Horticulture - The Indoor &amp; Outdoor Medical Grower",
  "uid": 9433861,
  "size": 520595440,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:d28c36ceff3af85a0314663f6681253381ab8295&amp;dn=Marijuana+Horticulture+-+The+Indoor+%26amp%3B+Outdoor+Medical+Grower&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 52,
  "leechers": 0,
  "uploader": "GoonerTPB",
  "files": 6,
  "time": 1388858607,
  "description": "With 512 full-color pages and 1120 full-color photographs and illustrations, Marijuana Horticulture: The Indoor/Outdoor Medical Grower's Bible is the most complete cultivation book available. The Fifth Edition of the former Indoor Marijuana Horticulture: The Indoor Bible was originally published in 1983, when it immediately became a best-seller. More than 500,000 copies of The Indoor Bible are in print in Dutch, English, French, German, and Spanish.\n\nNew greenhouse and outdoor growing chapters make this new edition a book indoor and outdoor growers will keep under thumb. These two new chapters complement the existing fifteen chapters, which have been rewritten, significantly expanded, and updated with the most current information. Dr. John McPartland contributed a new medical section, and ten cannabis web sites were profiled. All chapters pertaining to plant growth's seeds, seedlings, clones, vegetative growth, flowering, and harvesting doubled or tripled in length and detail. Hydroponic and organic growing sections are new and greatly expanded. The twentynine-page Hash and Oil Making chapter explains dry-sieve and water hash production in simple, pictorial detail. The thirty-page Breeding chapter, written by expert breeder Chimera from Chimera Seeds, is straightforward and easy for all growers to understand and apply.\n\nAccording to the author, about forty percent of the text from the Fourth Edition was adapted for the new Bible. More pages and images, a new condensed typeface that allows twice as many words per page, and new research make the Fifth Edition a completely new book rather than a simple rewrite.\n\nThe book's credits list more than three hundred contributors and reads like a who's who in the world of cannabis cultivation. Any grower, casual or serious, will find hours of instruction and indispensable, tried-and-true help within the Bible's pages.",
  "parsed": {
    "xt": "urn:btih:d28c36ceff3af85a0314663f6681253381ab8295",
    "dn": "Marijuana Horticulture - The Indoor &amp; Outdoor Medical Grower",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "d28c36ceff3af85a0314663f6681253381ab8295",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        210,
        140,
        54,
        206,
        255,
        58,
        248,
        90,
        3,
        20,
        102,
        63,
        102,
        129,
        37,
        51,
        129,
        171,
        130,
        149
      ]
    },
    "name": "Marijuana Horticulture - The Indoor &amp; Outdoor Medical Grower",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 52,
  "peers": 14,
  "last_updated": "2016-12-25T14:46:39.793Z"
}