{"title":"Suits Season 2 Complete 720p HDTV x264","uid":8181525,"size":16324455993,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:d6263198fc20ce68562f7d31c6748196859b23de&amp;dn=Suits+Season+2+Complete+720p+HDTV+x264&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":67,"leechers":41,"uploader":"mattyfaz","files":-1,"time":1361636135,"description":"Suits (2011 - )\n\nTV Series  -  45 min  -  Comedy | Drama\n\nIMDB Rating: 8.9/10.0 from 61,694 users   \n\nOn the run from a drug deal gone bad, Mike Ross, a brilliant college-dropout, finds himself a job working with Harvey Specter, one of New York City's best lawyers.\n\n###################################################################################\n\nFiles:\n\nSuits.S02E01.720p.HDTV.x264-AVS.mkv\t\t\t1.04 Gb\nSuits.S02E02.720p.HDTV.x264-IMMERSE.mkv\t\t\t981.99 Mb\nSuits.S02E03.720p.HDTV.x264-IMMERSE.mkv\t\t\t1.01 Gb\nSuits.S02E04.720p.HDTV.x264-IMMERSE.mkv\t\t\t1021.68 Mb\nSuits.S02E05.PROPER.720p.HDTV.x264-2HD.mkv\t\t937.23 Mb\nSuits.S02E06.720p.HDTV.x264-EVOLVE.mkv\t\t\t864.37 Mb\nSuits.S02E07.PROPER.720p.HDTV.x264-EVOLVE.mkv\t\t857.87 Mb\nSuits.S02E08.720p.HDTV.x264-EVOLVE.mkv\t\t\t1.01 Gb\nSuits.S02E09.720p.HDTV.x264-IMMERSE.mkv\t\t\t1.08 Gb\nSuits.S02E10.720p.HDTV.x264-IMMERSE.mkv\t\t\t1.08 Gb\nSuits.S02E11.720p.HDTV.x264-IMMERSE.mkv\t\t\t749.60 Mb\nSuits.S02E12.720p.HDTV.x264-IMMERSE.mkv\t\t\t817.40 Mb\nSuits.S02E13.720p.HDTV.x264-EVOLVE.mkv\t\t\t1002.69 Mb\nSuits.S02E14.720p.HDTV.x264-IMMERSE.mkv\t\t\t926.97 Mb\nSuits.S02E15.720p.HDTV.x264-IMMERSE.mkv\t\t\t939.48 Mb\nSuits.S02E16.720p.HDTV.x264-EVOLVE.mkv\t\t\t1.09 Gb\n\n###################################################################################\n\nEpisode Listing:\n\nS2, Ep1\nJun. 14, 2012 She Knows\nWhen Jessica learns about Mike, she tells Harvey, thinking that he doesn't know, and tells him to fire him. But Harvey tries to stall hoping to find a way not to. And when Daniel Hardman, the Harman in Pearson Hardman decides to return to the firm and Jessica is not happy about that.\n \nS2, Ep2\nJun. 21, 2012 The Choice\nAs Hardman makes it clear he's back to stay, Jessica tasks Harvey with helping shore up support for her within the firm - but Harvey's penchant for winning may create more enemies than friends. Mike confronts Rachel with the fact that he heard her message.\n \nS2, Ep3\nJun. 28, 2012 Meet the New Boss\nWhen Hardman comes in, he tries to ingratiate himself by asking Jessica to let him handle a case wherein they're trying to keep some nurses from going on strike by negotiating a contract. But Jessica says that she already gave it to Harvey which was a lie. And Hardman tries to horn in by getting Mike to give him some info. And Jessica tells Louis that Harvard is considering not allowing them to recruit because the firm's approval rating is low. So he brings in someone from Harvard to check them out but she tells Louis something that he doesn't like.\n \nS2, Ep4\nJul. 12, 2012 Discovery\nTravis Tanner returns and he is suing a client of Harvey's and Harvey claiming they deliberately withheld information and slandered someone. Harvey claims he did nothing but Tanner shows him a document which Harvey claims he never saw. So Harvey tries to sort it out by having Donna look for the document and talking to the client. But when the client hires another lawyer as a precaution, Harvey gets into an argument with him which ends with Harvey getting fired. Jessica doesn't want Hardman to know and Harvey agrees. Louis asks Harvey for Mike and initially refuses but...\n \nS2, Ep5\nJul. 19, 2012 Break Point\nHarvey balks when Jessica puts him in the passenger seat on a lawsuit that could make or break the firm, and his back seat driving may have far reaching consequences. Mike takes the lead on a case that pits a tennis phenom against his trainer who also happens to be the athlete's father.\n \nS2, Ep6\nJul. 26, 2012 All In\nHarvey's personal history with a client forces he and Mike to take on an unorthodox case from which they'd normally walk away. Louis and Rachel team up to save a mutually beloved institution from ruin. Jessica runs into an unexpected roadblock while defending the firm against a lawsuit.\n \nS2, Ep7\nAug. 2, 2012 Sucker Punch\nAs the fallout continues to reverberate from the pending lawsuit against Pearson Hardman, Harvey turns to a former colleague, with whom he has a thorny past, for help in proving the firm's case.\n \nS2, Ep8\nAug. 9, 2012 Rewind\nWith the vote for managing partner approaching, Harvey decides to take off but before leaving he gives Mike an assignment. We then take a look at of how things were 5 years ago; Harvey is an associate and Hardman was still managing partner and Jessica learns that someone in the firm is stealing so she has Harvey find out who. Mike is struggling to make ends meet after getting kicked out of school and how he and Trevor first met Jenny and how her friend takes a special interest in Mike.\n \nS2, Ep9\nAug. 16, 2012 Asterisk\nHarvey and Jessica get ready for the vote. They learn that the vote is split after Hardman got rid of one of Jessica's supporters and that Hardman made Lewis a Senior Partner and as a result is the deciding vote. Jessica wants Harvey to get him to vote for her. Harvey and Mike are working on a case wherein a reporter is being sued by a baseball player when he accuses the man of using steroids. The reporter claims the story is accurate because he has a source whom he will not reveal. And Mike's grandmother comes to the office.\n \nS2, Ep10\nAug. 23, 2012 High Noon\nFinally, the voting occurs and, seems Hardman wins by the vote of Louis. Hardman and Louis make Harvey's life hell and Mike goes wayward with death of his granny. Having a night-out with Mike, Harvey catches Louis in his office and the whole conspiracy game by Hardman comes out. Mike throws a trick and Hardman gets voted out of the firm. The unfolding of the conspiracy makes a really interesting climax...\n \nS2, Ep11\nJan. 17, 2013 Blind-Sided\nMike gets too emotional when Harvey asks him to negotiate a hit-and-run settlement, and Louis runs into trouble as he tries to hire his first associate.\n\nS2, Ep12\nJan. 24, 2013 Blood in the Water\n \nS2, Ep13\nJan. 31, 2013 Zane vs. Zane\nThe Firm is representing a woman who is suing the company she worked for, for sexual discrimination for not promoting her in favor of men. And the Firm representing the company is headed by Rachel's father. She then asks Mike to work on it. And Harvey decides to use her against her father which only infuriates him. And Katrina Bennett, the D.A. Harvey hired starts at the firm and Louis who is still irate that he wasn't allowed to hire the lawyer he wanted makes her life miserable.\n \nS2, Ep14\nFeb. 7, 2013 He's Back\nHardman is now representing Folsom foods in their gender discrimination case, so he has a meeting with Jessica and Harvey. But he reveals that he bringing a wrongful dismissal suit against them for their dismissal of Monisa Eaton 5 years ago. Harvey wants to settle because if they lose it will hurt their case against Folsom but Jessica doesn't want to. But they can't use Daniel's past deeds because Jessica signed a confidentiality agreement when he left. And Rachel applies to Harvard.\n \nS2, Ep15\nFeb. 14, 2013 Normandy\nHarvey joins forces with and old familiar face to take down Daniel Hardman, Mike and Katrina play a sneaky game of one-upsmanship, and Rachel gets some bad news about her Harvard application.\n \nS2, Ep16\nFeb. 21, 2013 War\n\n###################################################################################\n \t\t","torrent":{"xt":"urn:btih:d6263198fc20ce68562f7d31c6748196859b23de","amp;dn":"Suits+Season+2+Complete+720p+HDTV+x264","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6263198fc20ce68562f7d31c6748196859b23de","infoHashBuffer":{"type":"Buffer","data":[214,38,49,152,252,32,206,104,86,47,125,49,198,116,129,150,133,155,35,222]},"announce":[],"urlList":[]}}