{"title":"Crusader.Kings.II-SKIDROW","uid":7022852,"size":578591751,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d67e6f2b1640a38ead7fb19edad99717ce6e387b&amp;dn=Crusader.Kings.II-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":51,"leechers":1,"uploader":"MsB1982","files":4,"time":1328902633,"description":"S  K  I  D  R  O  W\n.the leading force.\n\nproudly presents\nCrusader Kings II (c) Paradox Interactive\n\n10-02-2012........Release Date - Protection...............Steam\nStrategy.............Game Type - Disk(s)...................1 CD\n\nRELEASE NOTES\n\nThe Dark Ages might be drawing to a close, but Europe is still in\nturmoil. Petty lords vie against beleaguered kings who struggle to\nassert control over their fragmented realms. The Pope calls for a\nCrusade to protect the Christians in the Holy Land even as he refuses\nto relinquish control over the investiture of bishops - and their\nriches. Now is the time for greatness. Expand your demesne and secure\nthe future of your dynasty. Fill your coffers, appoint vassals, root\nout traitors and heretics, introduce laws and interact with hundreds\nof nobles, each with their own agenda.\n\nA good lord will always need friends to support him. But beware, as\nloyal vassals can quickly turn to bitter rivals, and some might not be\nas reliable as they seem. Stand ready, and increase your prestige\nuntil the world whispers your name in awe. Do you have what it takes\nto become a Crusader King?\n\nCrusader Kings II explores one of the defining periods in world history\nin an experience crafted by the masters of Grand Strategy. Medieval\nEurope is brought to life in this epic game of knights, schemes, and\nthrones.\n\nFeatures:\n\nStart a game at any point between 1066 and 1337 and play until 1453\n\nPick a Christian lord and make sure his dynasty survives as you play a\nsuccession of his descendants through the ages\n\nGain Prestige for every successive character you play, furthering the\nglory of your Dynasty\n\nExpand your feudal domain - and keep it from falling apart\n\nUnravel the plots of your courtiers and vassals, each with their own\nopinions and agendas\n\nTake up the Cross and fight the Moor, the Heathen and the Heretic.\n\nDefend against the onslaught of the Mongol Horde\n\nStruggle with the Pope for control of the bishops\n\nRelive the Middle Ages with up to 32 other players in a competitive\nmultiplayer mode\n\nINSTALL NOTES\n\n1. Unpack the release\n2. Mount or burn image\n3. Install\n4. Copy everything from the SKIDROW folder into the game installation\n5. Play the game\n6. Support the companies, which software you actually enjoy","torrent":{"xt":"urn:btih:d67e6f2b1640a38ead7fb19edad99717ce6e387b","amp;dn":"Crusader.Kings.II-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d67e6f2b1640a38ead7fb19edad99717ce6e387b","infoHashBuffer":{"type":"Buffer","data":[214,126,111,43,22,64,163,142,173,127,177,158,218,217,151,23,206,110,56,123]},"announce":[],"urlList":[]}}