{
  "title": "Wondershare MobileTrans v7.4.6.429 Final + Serials {B4tman}",
  "uid": 13099315,
  "size": 38150404,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:d7d51b409e1eeaf68d336ae04f0473acb47493f5&amp;dn=Wondershare+MobileTrans+v7.4.6.429+Final+%2B+Serials+%7BB4tman%7D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 44,
  "leechers": 0,
  "uploader": "AliPaK",
  "files": 5,
  "time": 1451201756,
  "description": "Wondershare MobileTrans v7.4.6.429 Final + Serials {B4tman}\r\n \nhttp://s30.postimg.org/6osua9njl/image.png \nhttp://s30.postimg.org/az7i5usmo/image.jpg\r\n\r\nDescription:-\r\n\r\n1-Click Content Transfer, 100% Safe and Risk-free. Whether you’re upgrading phones, switching to a different device or changing carriers, only some cell phone companies might help you transfer contacts – but what about everything else? Wondershare MobileTrans makes it extremely easy for you to take everything, including contacts, photos, text messages, music, calendarNew icon, video, apps and call logs, with you in 1 click. It’s safe and risk-free, and all content it transfers is 100% the same as the original one. \r\n\r\nFeatures:-\r\n\r\nTransfer Content between iOS, Android, WinPhone and Nokia Symbian:-\r\n\r\nIt does well in transferring content between phones running iOS, Android (Fully support Android 6.0 MarshmallowNew icon), WinPhone and Nokia Symbian. Besides, when transferring contacts , it not just transfers names and numbers, but moves job title, email address, company name, and more. \r\n\r\nBackup and Restore Later:-\r\n\r\nJust have one phone in your hand? It doesn't matter. You can backup your phone to the PC first and then restore to any other supported phone whenever you want.\r\n\r\nRetrieve Phone Backup for iPhone/Android Phone\r\n\r\nDitch your old phone for iPhone or Android phone? Now, this mobile transfer lets you retrieve backups created by iCloud, iTunes, Samsung Kies (3) and BlackBerry® Desktop Suite, and transfer contacts, messages, etc. to iPhone and Android phone.\r\n\r\nKeep Phone Data Secured:-\r\n\r\nYou can easily backup the data on your iPhone/iPad/iPod touch, Android phone,WinPhone or Nokia (Symbian) phone to the PC, keeping all the important data safe and secured.\r\n\r\nRetrieve Data from iCloud Backup to Android (New):-\r\n\r\nYou can retrieve data from iCloud backup to any supported Android phone, transfer contacts, text messages, photos, videos, calendar and more.\r\n\r\nTransfer iTunes to Any Supported Device:-\r\n\r\nYou can retrieve iTunes Backup and transfer contacts, text messages, photos, video, etc. to any supported mobile device.\r\n\r\nSupport for 3,000+ Phones and Different Networks:-\r\n\r\nIt works perfectly with Apple, Samsung, Nokia, HTC, LG, Sony, Google, HUAWEI, Motorola, ZTE, and more mobile models. Additionally, it's fully compatible with major providers: AT&amp;T, Verizon, Sprint and T-Mobile.\r\n\r\nPermanently Erase Your Old Phone (New):-\r\n\r\nDecide to sell or donate your old Android phone, but want to keep your personal data out of the wrong hands? Wondershare MobileTrans helps to protect your personal data by erasing all of them from your old Android phone, safely and permanently.\r\nErase Your Old Phone: Wipe off everything on your Android phone in 1 click",
  "parsed": {
    "xt": "urn:btih:d7d51b409e1eeaf68d336ae04f0473acb47493f5",
    "dn": "Wondershare MobileTrans v7.4.6.429 Final   Serials {B4tman}",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "d7d51b409e1eeaf68d336ae04f0473acb47493f5",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        215,
        213,
        27,
        64,
        158,
        30,
        234,
        246,
        141,
        51,
        106,
        224,
        79,
        4,
        115,
        172,
        180,
        116,
        147,
        245
      ]
    },
    "name": "Wondershare MobileTrans v7.4.6.429 Final   Serials {B4tman}",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 44,
  "peers": 88,
  "last_updated": "2016-12-25T15:18:26.062Z"
}