{
  "title": "SmithMicro Poser Pro 2014 10.0.4.27796 (serials CORE) [ChingLiu]",
  "uid": 10775702,
  "size": 597058512,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:d96c800cd8f580494dd2762b6dcda397dbe346d2&amp;dn=SmithMicro+Poser+Pro+2014+10.0.4.27796+%28serials+CORE%29+%5BChingLiu%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 82,
  "leechers": 2,
  "uploader": "Ching_Liu",
  "files": -1,
  "time": 1408118957,
  "description": "FEATURES\n\nPixar Subdivision Surfaces - We've integrated Pixar's OpenSubdiv library to provide Pixar Subdivision Surfaces, with user definable subdivision levels per prop, figure or even individual body part. Subdivision improves bending fidelity, smooths polygonal surfaces and improves performance by enabling lighter poly-count content. Poser includes a new Unimesh skinning method to support subdivision on figures with compliant geometry.\n\nRendering Speed Improvements - The Firefly render engine has been optimized for faster performance when Raytracing.\n\nBullet Physics - Bullet Physics simulates Rigid Body dynamics, Soft Body dynamics, and dynamic strand based hair. Create rigid simulations with constraints to build complex mechanical interactions. Paint softbody constraint weights to animate. Add jiggle and bounce to any prop or character. Use the Live Simulation mode to preview dynamics in realtime, or calculate simulations to include in rendered animations.\n\nComic Book Preview Mode - Use Poser's exciting new Color and B&amp;W Comic Book Preview for static or animated toon imagery. This feature will enable you to create comic art with fantastic line control and color, or clean black and white outlines with persistent shading even when rotating or animating your point of view.\n\n9 New Human and Cartoon Figures - Also included are two new humans utilizing magnets with weight maps and polygonal detailing optimized for SubD. Seven new 3D cartoon figures with incredible facial expressions and personality, worthy of an on-screen cameo in Hollywood, are part of the included content.\n\nMagnet and Deformer Weight Map Support - Poser's Magnets and Deformers have always been a powerful tool for modifying and animating figures and props. Now with Weight Maps, deformers are even more useful with extraordinary vertex level precision. \n\nMagnet and Deformer Weight Map Painting Tools - Control the power of Poser's new Magnet and Deformer Weight Maps with painting tools that enable vertex by vertex editing. With the added precision of Weight Maps, deformers can be subtly edited to create brilliant content.\n\nInteractive Raytrace Preview - Preview every scene change you make with the new Interactive Raytrace Preview with a fast raytraced display. It's a great way to see changes to camera angle, lights, shadows with all the benefits of the optimized Firefly Raytrace engine including transparency and reflections.\n\nOpenGL Speed Optimization - OpenGL has been optimized for on screen performance so you can create and preview scenes changes and lights faster than ever\n\nGrouping Tool Improvements - Selecting polygons for group editing is easier now by painting, add or remove polygons by group or material and mirror selections across X, Y and Z axes.\n\nMorph Brush Improvements - New Morph Brush methods make it easier to tighten, loosen, sag, flatten smooth and restore any mesh, whether it's a prop, figure or conforming figure. The new Goal feature lets you select a target to morph towards for precise fitting to any figure. Fine tune the morph creation process with the user definable Pokethrough Margin. Use arrow keys to change brush radius and magnitude.\n\nMaterial Compound Nodes - Create and distribute complicated materials in a simpler fashion with Compound Nodes. Select any group of individual material nodes and combine them into a single block. Users can expand Compound Nodes to edit the individual nodes, or leave them collapsed.\n\nGamma Correction - Gamma Correction is now in both Poser 10 and Pro 2014 so gamma controlled content can be developed and delivered to every Poser user, supporting uniform materials across versions.\n\nNew Poser Pro 2014 Only Features\n\nFitting Room - Interactively fit clothing and props to any Poser figure and create new conforming clothing using five intelligent modes that automatically loosen, tighten, smooth and preserve soft and rigid features. Paint maps on the mesh to control the exact areas that you want to modify. Use pre-fit tools to direct the mesh around the goal figure's shapes. With a single button, generate a new conforming item using the goal figure's rig, complete with full morph transfer\n\nCopy Morphs from Figure to Figure - When creating new content for Poser figures, morph transfer enables conforming clothing developers more easily support a wide array of figures and include both full body and partial body morphs that can be driven by the base figure.\n\nPowerful Parameter Controls - To provide Poser content developers more power, display hidden parameters so they can be interactively modified. Drag and drop parameters to change channel and parameter order calculation for control of how operations such as physics simulations, morphs, bends and deformers interact. \n\nSystem Requirements\n\n-Windows XP, Vista, 7, 8 or 8.1 (64-bit OS required for 64-bit installation)\n-1.3 GHz Pentium 4 or newer, Athlon 64 or newer (1.65 GHz or faster recommended)\n-1 GB system RAM (4 GB or more recommended)\n-OpenGL enabled graphics card or chipset recommended (recent NVIDIA GeForce and ATI Radeon required for advanced real-time preview features)\n-24-bit color display, 1440 x 900 minimum resolution\n-3 GB free hard disk space (6 GB recommended)\n-DVD-ROM drive (Physical product only)\n-Internet connection required for Content Paradise\n-WindowsÂ® Internet ExplorerÂ® 7 or newer\n-AdobeÂ® FlashÂ® Player 11 or newer\n-AdobeÂ® AIRÂ® (external library)\n-Hosting plugins require a valid English language installation of their respective host application:\n-Maxon CINEMA 4D R10-15\n-Autodesk 3ds Max 2012 - 2015*\n-Autodesk Maya 2012 - 2015*\n-Newtek Light Wave 3D 9 - 11\n-ZBrush 4 or later required for GoZ interoperability\n-3ds Max and Maya 2015 support coming soon \n\nLanguages : English, Japan, German \n\nHomepage :  &lt;a href=&quot;\nhttp://poser.smithmicro.com/poser.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://poser.smithmicro.com/poser.html&lt;/a&gt;",
  "parsed": {
    "xt": "urn:btih:d96c800cd8f580494dd2762b6dcda397dbe346d2",
    "dn": "SmithMicro Poser Pro 2014 10.0.4.27796 (serials CORE) [ChingLiu]",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "d96c800cd8f580494dd2762b6dcda397dbe346d2",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        217,
        108,
        128,
        12,
        216,
        245,
        128,
        73,
        77,
        210,
        118,
        43,
        109,
        205,
        163,
        151,
        219,
        227,
        70,
        210
      ]
    },
    "name": "SmithMicro Poser Pro 2014 10.0.4.27796 (serials CORE) [ChingLiu]",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 15,
  "peers": 48,
  "last_updated": "2016-12-27T14:38:40.758Z"
}