{
  "title": "Transformers 1, 2, 3, 4 - Action Sci-Fi 2007-2014 Eng Subs 720p ",
  "uid": 12050944,
  "size": 6978765212,
  "categoryP": "video",
  "categoryS": "hd___movies",
  "magnet": "?xt=urn:btih:dcbc7ab0ceafb32821352bd4478b2ef271a8cf7c&amp;dn=Transformers+1%2C+2%2C+3%2C+4+-+Action+Sci-Fi+2007-2014+Eng+Subs+720p+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 46,
  "leechers": 27,
  "uploader": "eyezin",
  "files": 32,
  "time": 1434990888,
  "description": ".....................................................\n..:+++++++++++++++++++++++++++++++++++++++++++++++:..\n..:+++++++++++++++++Transformers++++++++++++++++++:..\n..:++++++Transformers Revenge of the Fallen+++++++:..\n..:++++++++Transformers Dark of the Moon++++++++++:..\n..:+++++++Transformers Age of Extinction++++++++++:..\n..:+++++++++++++++++++++++++++++++++++++++++++++++:..\n.....................................................\n\nTransformers 2007.\nThe interstellar battle between the Autobots and Decepticons rains \ndestruction down on planet Earth as director Michael Bay adapts Hasbro and \nTakara's popular Transformers franchise into a big-budget, live-action summer \ntentpole extravaganza in this ambitious sci-fi action feature starring Shia \nLaBeouf, Tyrese Gibson, Bernie Mac, John Turturro, Jon Voight, and, of course, \nOptimus Prime and Megatron. Long ago, on the planet of Cybertron, a massive, \npowerful alien race divided into two factions, the noble Autobots, and the \ndevious Decepticons. They fought for the sole access to a talisman known as \nthe Allspark, a cube with the capacity to grant infinite power, and eventually \nthe Autobots smuggled it off the planet's surface, hiding it in an unknown \nlocation on Earth. Now, hundreds of years later, the Deceptacons have come \nlooking for it, and if the Autobots don't find it first, the Earth will be \nenslaved or destroyed by the evil aliens' use of its massive power. The \nAutobots don't know where the cube was hidden, but the information may be \nstored in the most unlikely of sources, as a gangly young Earthling named \nSam Witwicky (LaBeouf) who's just picked up his first car, has a strange \nconnection to the Allspark's history, making him the unlikely ally of these \nenormous creatures, as they fight for humankind's survival and the chance to \nreturn home.\n\nStars.\n=&gt;-Shia LaBeouf.\n=&gt;-Megan Fox.\n=&gt;-Josh Duhamel.\n\nDirector.\n=&gt;-Michael Bay.\n\nTransformers Revenge Of The Fallen 2009.\nTwo years after saving the world with the Autobots, Sam Witwicky \n(Shia LaBeouf) is away at college when an ancient Decepticon named The Fallen \nreturns to Earth on a mission of vengeance. With the Allspark destroyed, the \nAutobots lose all hope of returning to their home planet of Cybertron, and \nbegin working with an elite military known as NEST to hunt down any remaining \nDecepticons. But even as they fight for humanity alongside Major Lennox \n(Josh Duhamel) and USAF Master Sergeant Epps (Tyrese Gibson), the Autobots \nare acutely aware that not all humans are thrilled by their presence on planet \nEarth. When National Security Advisor Theodore Galloway (John Benjamin Hickey) \nwages a heated campaign aimed at exiling the giant robots back into space, \nhead Autobot Optimus Prime agrees to comply with the voice of the people, \nwhile warning them of the potential consequences of leaving the planet \nunprotected. Meanwhile, Sam contends with an overly cocky college roommate, \nand attempts to remain faithful to Mikaela (Megan Fox) by fending off advances \nfrom pretty -- and persistent -- coed Alice (Isabel Lucas). Just as Sam begins \nadjusting to the quirks of campus life, a series of inexplicable visions \nleaves him convinced that the struggle between good and evil is far from over. \nAnd he's correct, too, because the Decepticons have just discovered that Sam \nis the one human who possesses the ability to tip the balance of power to the \nAutobots' advantage, and they're determined to gain the upper hand by \ndispensing with him once and for all. Now, as Sam and Mikaela unearth a secret \nabout the Transformers that alters the entire course of human history, the \nDecepticon known as The Fallen prepares to return -- and reclaim the plant \nonce and for all.\n\nStars.\n=&gt;-Shia LaBeouf.\n=&gt;-Megan Fox.\n=&gt;-Josh Duhamel.\n\nDirector.\n=&gt;-Michael Bay.\n\nTransformers Dark Of The Moon 2011.\nAutobots Bumblebee, Ratchet, Ironhide, Mirage (aka Dino), Wheeljack (aka Que) \nand Sideswipe led by Optimus Prime, are back in action taking on the evil \nDecepticons, who are eager to avenge their recent defeat. The Autobots and \nDecepticons become involved in a perilous space race between the United States \nand Russia, to reach a hidden Cybertronian spacecraft on the moon and learn \nits secrets, and once again Sam Witwicky has to come to the aid of his robot \nfriends. The new villain Shockwave is on the scene while the Autobots and \nDecepticons continue to battle it out on Earth.\n\nStars.\n=&gt;-Shia LaBeouf.\n=&gt;-Rosie Huntington-Whiteley.\n=&gt;-Tyrese Gibson.\n\nDirector.\n=&gt;-Michael Bay.\n\nTransformers Age Of Extinction 2014.\nFive years after defeating Sentinel Prime and Megatron in Chicago, the Autobots \nhave gone into hiding after the government deemed all Transformers as threats, \nand thus, began to hunt them all down. The government have thus replaced the \nAutobots with their own Transformers using technology from the fallen \nTransformers. For a reward, Texas mechanic Cade Yeager finds a truck that \nturns out to be the leader of the Autobots known as Optimus Prime. As the \ngovernment hunts down all Transformers, Cade and his family are involved in \nthe business between a bounty hunter and Optimus.\n\nStars.\n=&gt;-Mark Wahlberg.\n=&gt;-Nicola Peltz.\n=&gt;-Jack Reynor.\n\nDirector.\n=&gt;-Michael Bay.\n\nInfo.\n=&gt;-Genre......................: Adventure : Sci-Fi : Action.\n=&gt;-Release Date...............: 2007 : 2009 : 2011 : 2014.\n=&gt;-Language...................: English.\n=&gt;-File Size..................: 1.52 GiB : 1.59 GiB : 1.64 GiB : 1.75 GiB.\n=&gt;-Overall bit rate...........: 1 517 Kbps.\n=&gt;-Movie Runtime..............: 2h 23mn : 2h 30mn : 2h 34mn : 2h 45mn.\n=&gt;-Transformers 1.............: http://www.rottentomatoes.com/m/transformers_the_movie/\n=&gt;-Transformers 2.............: http://www.imdb.com/title/tt1055369/\n=&gt;-Transformers 2.............: http://www.rottentomatoes.com/m/transformers_revenge_of_the_fallen/\n=&gt;-Transformers 3.............: http://www.imdb.com/title/tt1399103/\n=&gt;-Transformers 3.............: http://www.rottentomatoes.com/m/transformers_dark_of_the_moon/\n=&gt;-Transformers 4.............: http://www.imdb.com/title/tt2109248/\n=&gt;-Transformers 4.............: http://www.rottentomatoes.com/m/transformers_age_of_extinction/\n\nVideo.\n=&gt;-Codec......................: H.264/MPEG-4 AVC.\n=&gt;-Aspect Ratio...............: 2.40:1. : 2.051.\n=&gt;-Resolution.................: 1280 x 528 : 1280 x 624.\n=&gt;-Bit rate...................: 1400 Kbps.\n\nAudio English.\n=&gt;-Codec......................: mp4a: MPEG-4 AAC LC.\n=&gt;-Channels...................: 2 channel Stereo.\n=&gt;-Bit Rate...................: 112 Kbps.\n=&gt;-Maximum bit rate...........: 232 Kbps.\n\nSubtitles Softsubbed SubRip MicroDVD.\n=&gt;-English",
  "parsed": {
    "xt": "urn:btih:dcbc7ab0ceafb32821352bd4478b2ef271a8cf7c",
    "dn": "Transformers 1, 2, 3, 4 - Action Sci-Fi 2007-2014 Eng Subs 720p ",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "dcbc7ab0ceafb32821352bd4478b2ef271a8cf7c",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        220,
        188,
        122,
        176,
        206,
        175,
        179,
        40,
        33,
        53,
        43,
        212,
        71,
        139,
        46,
        242,
        113,
        168,
        207,
        124
      ]
    },
    "name": "Transformers 1, 2, 3, 4 - Action Sci-Fi 2007-2014 Eng Subs 720p ",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 25,
  "peers": 50,
  "last_updated": "2016-12-27T14:56:48.830Z"
}