{
  "title": "Castlevania_Lords_of_Shadow_Ultimate_Edition-FLT",
  "uid": 8855439,
  "size": 16064387824,
  "categoryP": "games",
  "categoryS": "pc",
  "magnet": "?xt=urn:btih:de7622e4a6edc94a1a8aa0dbf95892e81267fc9b&amp;dn=Castlevania_Lords_of_Shadow_Ultimate_Edition-FLT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 45,
  "leechers": 28,
  "uploader": "Mr.Stifmeister",
  "files": 3,
  "time": 1377639413,
  "description": "\nANSiJEDACiD\n\nIn Their 26th Year Of Glory, FairLight Released #1113\n\nCastlevania: Lords of Shadow Ultimate Edition (c) Konami\n\n:   Supplied by: FAIRLIGHT            : : Release Date: 27-08-2013\nCracked by:  FAIRLIGHT              Game Type:    Action, Adventure\nPackaged by: FAIRLIGHT              Image Format: ISO\n-----\nDISCS: 2 DVDs                       Protection: Steam\n\nSystem Requirements : (S)-1-phenylpropan-2-amine\n\nGame information\n=================\n\nCastlevania: Lords of Shadow - Ultimate Edition is the complete edition of\nCastlevania: Lords of Shadow, a dark and vivid  new  re-imagining  of  the\nCastlevania mythology. It is the end of days and  ungodly  powers  isolate\nthe Earth. The world's alliance with the heavens has been threatened by  a\ndark and malevolent force - the mysterious Lords of  Shadow.  Across  this\nshattered land, the souls of the dead wander unable to find peace,  whilst\ncreatures of evil wreak chaos and death upon the living\n\nGabriel Belmont is a member of the Brotherhood of Light, an elite group of\nholy knights who protect and defend the innocent against the supernatural\nHis beloved wife was brutally murdered by the evil forces of darkness  and\nher soul trapped for eternity. Neither living nor dead  she  realizes  the\nhorrific truth of what is at stake and guides Gabriel to his  destiny  and\nhopefully salvation for the world\n\nReverie - DLC\n\nReverie marks a return to the game's climactic castle setting  as  Gabriel\nseeks to assist  the  recently-slain  vampire  Queen's  hand  maiden.  The\ndownload spans three stages, and  offers  a  breath-taking  twist  to  the\ngame's plot\n\nResurrection - DLC\n\nResurrection, which itself follows on from  the  completed  Reverie,  lays\nbare the fate of both Gabriel and the Belmont clan. Gabriel must battle an\nevil demon known only as The Forgotten One that has broken loose of  its\nancient chains.\n\nThese new DLC levels provides a stunning finale to KONAMI's epic  tale  of\ndeath, betrayal and redemption  -  with  &quot;The  Forgotten  One&quot;  intent  on\ndestroying mankind, and only Gabriel standing between it and its goal...\n\nFeatures\n=========\n\nDeveloped by MercurySteam - Climax Studios\nPlay through Castlevania: Lords of Shadow - Ultimate\nEdition and enjoy the full game plus Reverie and\nResurrection bonus content\nHigh caliber voice acting from the game's stunning cast,\nwith Gabriel voiced by Robert Carlyle OBE (Once Upon a\nTime, 28 Weeks Later, Trainspotting, The Full Monty,\nand Stargate Universe), and Sir Patrick Stewart (X-Men, k\nStar Trek: Next Generation) as the mysterious Zobe Natasha\nMcElhone (The Other Boleyn Girl, Californication, The Truman\nShow) and Jason Isaacs (Black Hawk Down, The Patriot, Harry\nPotter series) round off the talent\nEnjoy newly added game features such as enhanced High Definition\nGraphics, solid 60 frames per second (recommended spec),\nAchievement integration through Steam with Cloud saving,\nand Big Picture support for full Gamepad control\nSupporting AMD features such as Eyefinity technology and\nCrossfire, as well as support for Nvidia SLI technology\nBrazilian-Portuguese language support now included\nImmerse yourself into the alternate Lords of Shadow timeline,\nmeet classic characters and experience tangential side\nstories. Discover Gabriel's ultimate fate\nOvercome obstacles using the Combat Cross multi-function\nweapon and hone your platforming skills in this sprawling\nadventure. Swing across chasms, climb sheer walls, rappel\ndown cliffs, grip and pull away any and all things that\nlay in your path\nSolve devious puzzles along your journey that unlock new\nitems in which to improve your chances of success. Leave\nno stone unturned as you never know what you might find\nTitan Battles: Take on behemoth enemies that scale to\nthe size of complete world environments and where\nspecial attacks and cunning speed are required\nfor advancement\nUse secondary weapons like daggers and holy water and\ncombine them with light and dark magic for a wealth of\npowerful attacks to unleash upon your foes. Manage your\nspells as power comes at a price\nExplore gothic ruins, dark castles, old forest and frozen\nwastelands. Discover a whole world to investigate with\nmany routes and hidden secret places that contain\nitems to aid Gabriel on his quest\n\nInstallation Information\n=========================\n\nBurn or mount\nInstall\nPlay the game\n\nNOTE: As usual, block the game exe in your firewall\n\n/TEAM FAiRLIGHT\n\n-  QUALITY, TRADITION  AND PRIDE -\n\n",
  "parsed": {
    "xt": "urn:btih:de7622e4a6edc94a1a8aa0dbf95892e81267fc9b",
    "dn": "Castlevania_Lords_of_Shadow_Ultimate_Edition-FLT",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "de7622e4a6edc94a1a8aa0dbf95892e81267fc9b",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        222,
        118,
        34,
        228,
        166,
        237,
        201,
        74,
        26,
        138,
        160,
        219,
        249,
        88,
        146,
        232,
        18,
        103,
        252,
        155
      ]
    },
    "name": "Castlevania_Lords_of_Shadow_Ultimate_Edition-FLT",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 125,
  "peers": 19,
  "last_updated": "2016-12-27T15:07:26.801Z"
}