{
  "title": "Halloween 1, 2, 3, 4, 5, 6, 7, 8, 9, 10 - Complete Collection En",
  "uid": 11227721,
  "size": 8136210167,
  "categoryP": "video",
  "categoryS": "hd___movies",
  "magnet": "?xt=urn:btih:e07dec69b2e5c5d46e72833da16105de64d83928&amp;dn=Halloween+1%2C+2%2C+3%2C+4%2C+5%2C+6%2C+7%2C+8%2C+9%2C+10+-+Complete+Collection+En&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 55,
  "leechers": 38,
  "uploader": "eyezin",
  "files": -1,
  "time": 1413476225,
  "description": "......................................................\n..:++++++++++++++++++++++++++++++++++++++++++++++++:..\n..:++++++++++++++++++++Halloween+++++++++++++++++++:..\n..:++++++++++++++++++++Decalogy++++++++++++++++++++:..\n......................................................\n\nHalloween.\nFifteen years ago, 6 year old Michael Myers brutally killed his older sister.\nThe silent child was incarcerated in the Smith's Grove Sanitarium under the\ncare of psychiatrist Sam Loomis. The town of Haddonfield had slowly began to\nforget the tragic crime, until Loomis returned to the town to warn of Myers\nescape from Smith's Grove. With Michael set on killing a group of high school\nstudents, Loomis seeks the help of the hesitant town sheriff to stop him\nbefore it's too late.\n\nStars.\n=&gt;-Donald Pleasence.\n=&gt;-Jamie Lee Curtis.\n=&gt;-Tony Moran.\n\nDirector.\n=&gt;-John Carpenter.\n\nHalloween II.\nIt is still Halloween, 1978, and Michael Myers is on the loose after\nescaping certain death at Dr. Loomis' hands. By now, the entire sheriff's\ndepartment is hunting for him, and Laurie Strode - his intended victim - has\nbeen taken to Haddonfield Hospital to be treated for wounds inflicted by\nMichael. Only Loomis &amp; Sheriff Brackett- whose daughter had been murdered\nby Myers - seem aware of Myers' presence in the town, and a young man\nunknowingly alerts Myers to Laurie's location. When Myers reaches the\nhospital he eliminates virtually the entire staff in his pursuit. Meanwhile,\nMarion Chambers - who had been assisting Loomis during the planned pickup\nof Myers for his trial - meets up with Loomis to advise him that Myers is\nafter Laurie for 1 reason: she is his sister - born 2 years before he was\ncommitted. Loomis is forced to overpower the U.S. Marshal who was to return\nhim to Smith's Grove, and head for Haddonfield Hospital to stop Myers'\nblood spree. But are they too late?\n\nStars.\n=&gt;-Jamie Lee Curtis.\n=&gt;-Donald Pleasence.\n=&gt;-Charles Cyphers.\n\nDirector.\n=&gt;-Rick Rosenthal.\n\nHalloween III Season of the Witch.\nSilver Shamrock, a mass-producer of Halloween masks, plan to kill millions\nof innocent people worldwide by placing pieces of a stolen boulder from\nStonehenge into small tags and attaching them to the masks. When children\nall over the world sit down to watch the Silver Shamrock advertisement,\nterror and panic will spread. Dr. Dan Challis investigates a series of\nbizarre and horrifying incidents that begin to unfold before Halloween\nevening, and he comes face to face with the sinister figure of Conal\nConhran, maker of the evil masks.\n\nStars.\n=&gt;-Tom Atkins.\n=&gt;-Stacey Nelkin.\n=&gt;-Dan O'Herlihy.\n\nDirector.\n=&gt;-Tommy Lee Wallace.\n\nHalloween 4 The Return of Michael Myers.\nIt is October 30, 1988, and Michael Myers has been in a coma at the\nRidgemont Federal Sanitarium since that night a decade ago when his\ndoctor set him on fire in Haddonfield, IL. An ambulance makes its away\nalong the road to Ridgemont in a thunderstorm, and Myers is soon on\nhis way to another hospital in Smith's Grove, IL. During the ride, he\noverhears the crew mention his young niece in Haddonfield, and he comes\nto life, savagely killing the crew trapped inside. Dr. Loomis &amp; Dr.\nHoffman, head of Ridgemont, are alerted by the state troopers after\nthe ambulance is found upside-down in a river with blood everywhere.\nMeanwhile, Myers has already started to make his way toward\nHaddonfield, where he acquires his traditional coveralls &amp;\nnasty-looking knife, confronts his niece in a pharmacy, and then kills\nthe town's phone &amp; power lines, leaving his niece &amp; her adopted sister\ntrapped in their home...and he's coming to pay young Jamie a visit.\n\nStars.\n=&gt;-Donald Pleasence.\n=&gt;-Ellie Cornell.\n=&gt;-Danielle Harris.\n\nDirector.\n=&gt;-Dwight H Little.\n\nHalloween 5 The Revenge of Michael Myers.\nIt is exactly one year later since Michael Myers returned to terrorize\nhis hometown of Haddonfield, and his long-lost niece, Jamie Lloyd. Now,\nhe wants revenge! Young Jamie, who has lost her ability to speak since\nattacking her foster mother, has developed a telepathic link with her\ndemonic uncle. The ever resourceful Dr. Sam Loomis has realized this,\nand plans to use it to finally put an end to Michael's rage. But\nunbeknownst to them, a stranger has come to Haddonfield, and he is a\nkey factor in the outcome of the madness that has plagued Haddonfield\non Halloween for over ten years!\n\nStars.\n=&gt;-Donald Pleasence.\n=&gt;-Danielle Harris.\n=&gt;-Ellie Cornell.\n\nDirector.\n=&gt;-Dominique Othenin-Girard.\n\nHalloween The Curse of Michael Myers.\nSixth in the series and the fifth to feature the character of Michael\nMyers. It has been six years since both Michael and Jamie disappeared\nfrom Haddonfield's Police Station. Now, in 1995, the kids of Haddonfield\nwant to have parties on Halloween Night again after their parents have\nbanned it since the incidents of 1988 (H4) and 1989 (H5). Meanwhile,\nJamie has been raped by a cult but manages to escape with her new-born\nbaby. But Michael in hot pursuit. The Strode family has moved into the\nMyers' house, in an attempt to break the curse and to finally sell the\nhouse. But daughter Kara Strode has problems with her son, Danny Strode\nwho is haunted by the Man in Black (from H5). Help is at hand though\nfrom not only Dr. Loomis but also from an unexpected source, Tommy Doyle\n(one of the two child survivors from H1). Tommy has grown up and has\nresearched into Michael's madness and he might have the answer.\n\nStars.\n=&gt;-Donald Pleasence.\n=&gt;-Paul Rudd.\n=&gt;-Marianne Hagan.\n\nDirector.\n=&gt;-Joe Chappelle.\n\nHalloween H20 20 Years Later.\nSeventh movie in the series and the first to star Jamie Lee Curtis as\nher character since Halloween 1 and 2. It is 1998 and 20 years after\nMichael Myers's attack on his unknowing sister Laurie Strode. Since\nthen Laurie has lived with the danger of Michael tracking her down\nagain and therefore faked her death in a car crash and reinvented\nherself as Keri Tate, the head-mistress of an executive school.\nHowever, she is having trouble with the drink, keeps having nightmares\nfeaturing Michael and keeps having run-ins with her rebellious teenage\nson, John, who doesn't believe that Michael is alive. Some of the kids\ndecide to have a Halloween party and Laurie comes out and tells the\ntruth to her boyfriend, teacher Will. However, somebody searches\nthrough the papers of recently deceased Dr. Loomis and finds that the\ninfo on Laurie's whereabouts are stolen. Michael has found Laurie and\npeople start to disappear during the party. But this time Laurie is\nnot going to run and stays to fight the madman whose trying to\ncomplete a job that has taken nearly 20 years so far.\n\nStars.\n=&gt;-Jamie Lee Curtis.\n=&gt;-Josh Hartnett.\n=&gt;-Adam Arkin.\n\nDirector.\n=&gt;-Steve Miner.\n\nHalloween Resurrection.\nWhen a group of college students win a contest to spend the night in\nthe childhood home of brutal serial killer Michael Myers, they expect\na few scares but none of them are prepared for what awaits them. The\nhouse has been rigged with cameras as they are to be broadcasted live\nover the internet to be watched by millions. As they wander around\nthe house in search of some kind of answer for Michael's murderous\nactions they find a bigger problem. Michael has come home and he does\nnot intend to let anyone leave his house alive.\n\nStars.\n=&gt;-Jamie Lee Curtis.\n=&gt;-Busta Rhymes.\n=&gt;-Brad Loree.\n\nDirector.\n=&gt;-Rick Rosenthal.\n\nHalloween Rob Zombie.\nIn Haddonfield, Illinois, the nine years old Michael Meyers is\nraised by a dysfunctional family: his mother Deborah is a stripper\nin a night-club; his foster father Ronnie is an alcoholic bum; his\nsister Judith is a easy girl; and he is connected to his baby\nsibling. On October, 31st, after an incident in school where he is\nbullied by a schoolmate, Michael overhears the conversation of the\nprincipal and the psychiatric Dr. Samuel Loomis with his mother.\nThey had found pictures of Michael torturing animals in his backpack\nand Dr. Loomis would like to send Michael for psychiatric evaluation\nbelieving that the boy is deranged. This revelation triggers Michael\nthat escapes from the school and kills the bully, Ronnie, Judith's\nboyfriend Steve Haley and his sister Judith. Michael is held in\ncustody in the Smith's Grove Sanatorium under the treatment of Dr.\nLoomis. Eleven months later, during the visit of his mother, Michael\nkills his nurse and his stressed mother commits suicide. Fifteen\nyears later, Michael escapes from the mental institution leaving\nbloodshed behind, and heads to Haddonfield in the Halloween's night.\n\nStars.\n=&gt;-Scout Taylor-Compton.\n=&gt;-Malcolm McDowell.\n=&gt;-Tyler Mane.\n\nDirector.\n=&gt;-Rob Zombie.\n\nHalloween II Rob Zombie.\nMichael Myers is still at large and no less dangerous than ever.\nAfter a failed reunion to reach his baby sister at their old home,\nLaurie Strode is immediately taken to a hospital to be treated by\nthe wounds that had been afflicted by her brother a few hours ago.\nHowever, Michael isn't too far off and will continue his murdering\n'Halloween' rampage until he gets his sister all to himself.\n\nStars.\n=&gt;-Scout Taylor-Compton.\n=&gt;-Tyler Mane.\n=&gt;-Malcolm McDowell.\n\nDirector.\n=&gt;-Rob Zombie.\n\nInfo.\n=&gt;-Genre..........................: Action : Thriller : Horror.\n=&gt;-Release Date...................: 1978 1981 1982 1988 1989 1995 1998\n..................................: 2002 2007 2009.\n=&gt;-Language.......................: English.\n=&gt;-File Size......................: 727MiB 738MiB 783MiB 706MiB 776MiB\n..................................: 704MiB 688MiB 715MiB 971MiB 951MiB.\n=&gt;-Overall bit rate...............: 1 117 Kbps.\n=&gt;-Movie Runtime..................: 1h30mn 1h32mn 1h37mn 1h28mn 1h37mn\n..................................: 1h28mn 1h26mn 1h29mn 2h01mn 1h59mn.\n=&gt;-Halloween......................: http://www.imdb.com/title/tt0077651/\n=&gt;-Halloween II...................: http://www.imdb.com/title/tt0082495/\n=&gt;-Halloween III..................: http://www.imdb.com/title/tt0085636/\n=&gt;-Halloween 4....................: http://www.imdb.com/title/tt0095271/\n=&gt;-Halloween 5....................: http://www.imdb.com/title/tt0097474/\n=&gt;-Halloween 6....................: http://www.imdb.com/title/tt0113253/\n=&gt;-Halloween 7....................: http://www.imdb.com/title/tt0120694/\n=&gt;-Halloween 8....................: http://www.imdb.com/title/tt0220506/\n=&gt;-Halloween 9....................: http://www.imdb.com/title/tt0373883/\n=&gt;-Halloween 10...................: http://www.imdb.com/title/tt1311067/\n\nVideo.\n=&gt;-Codec..........................: H.264/MPEG-4 AVC.\n=&gt;-Aspect Ratio...................: 2.35:1 : 16:9.\n=&gt;-Resolution.....................: 1280 x 544 : 1280 x 720.\n=&gt;-Bit rate.......................: 1000 Kbps.\n\nAudio English.\n=&gt;-Codec..........................: mp4a: MPEG-4 AAC LC.\n=&gt;-Channels.......................: 2 channel Stereo.\n=&gt;-Bit Rate.......................: 112 Kbps.\n=&gt;-Maximum bit rate...............: 216 Kbps.\n\nSubtitles.\n=&gt;-English",
  "parsed": {
    "xt": "urn:btih:e07dec69b2e5c5d46e72833da16105de64d83928",
    "dn": "Halloween 1, 2, 3, 4, 5, 6, 7, 8, 9, 10 - Complete Collection En",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "e07dec69b2e5c5d46e72833da16105de64d83928",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        224,
        125,
        236,
        105,
        178,
        229,
        197,
        212,
        110,
        114,
        131,
        61,
        161,
        97,
        5,
        222,
        100,
        216,
        57,
        40
      ]
    },
    "name": "Halloween 1, 2, 3, 4, 5, 6, 7, 8, 9, 10 - Complete Collection En",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 31,
  "peers": 36,
  "last_updated": "2016-12-27T15:18:20.892Z"
}