{
  "title": "25 To Life",
  "uid": 3438854,
  "size": 1135357952,
  "categoryP": "games",
  "categoryS": "pc",
  "magnet": "?xt=urn:btih:e0c641577dafc7ceb86ef29f03122a00e11906ea&amp;dn=25+To+Life&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 36,
  "leechers": 2,
  "uploader": "Czacha_47",
  "files": 1,
  "time": 1138822641,
  "description": "Product Description\n25 TO LIFE is the first true Cops and Robbers game. Choose your side in this urban action third person shooter. The game delivers intense online game-play for up to 16 players, as well as a rich single player experience. Witness the gritty lifestyles of police task forces or strive to survive as a gangster fighting your way out of the streets. The story unfolds through the eyes of Detective Lester Williams of the local Police Department and Andre ?Freeze? Francis, the street ?lieutenant? of the 22nd St D-Boys, a well established street gang whose greedy philosophy keeps their enemies in fear. Their gritty journeys are conveyed through four intertwined chronicles that culminate into true life lessons. Freeze, a young twenty-something hustler is trying hard to get out the game, stay down with his lifelong crew and avoid his third strike. But when Calderon, Freeze?s lifetime homeboy, double crosses him on the last Job; it forces Freeze to get revenge, save his only son from a life of crime and survive a series of deadly shootouts. Along the way, Freeze faces-off with Detective Williams and his deadly partner, Maria Mendoza. Freeze must also step to a legion of haters out to kill him? \n\n\nProduct Description\nAre you a cop or a gangster? Choose your side in this urban action third person shooter. The game delivers intense online game-play for up to 16 players, as well as a rich single player experience. Witness the gritty lifestyles of police task forces or strive to survive as a gangster fighting your way out of the streets. \nThe story unfolds through the eyes of Detective Lester Williams of the local Police Department and Andre &quot;Freeze&quot; Francis, the street &quot;lieutenant&quot; of the 22nd St D-Boys, a well established street gang whose greedy philosophy keeps their enemies in fear. Their gritty journeys are conveyed through four intertwined chronicles that culminate into true life lessons. \n\nFreeze, a young twenty-something hustler is trying hard to get out the game, stay down with his lifelong crew and avoid his third strike. But when Calderon, Freeze&amp;#039;s lifetime homeboy, double crosses him on the last Job; it forces Freeze to get revenge, save his only son from a life of crime and survive a series of deadly shootouts. Along the way, Freeze faces-off with Detective Williams and his deadly partner, Maria Mendoza. Freeze must also step to a legion of haters out to kill him Blazing Soundtrack features music from the pioneers of yesterday and the biggest names of today - 2Pac, Xzibit, Public Enemy, DMX, Shyne, KRS-ONE, Geto Boys, Tech N9ne and more. Plus FIVE custom tracks inspired by and created exclusively for 25 To Life the game!! Offline Play for Single Player / Online Play may require monthly fee \n",
  "parsed": {
    "xt": "urn:btih:e0c641577dafc7ceb86ef29f03122a00e11906ea",
    "dn": "25 To Life",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "e0c641577dafc7ceb86ef29f03122a00e11906ea",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        224,
        198,
        65,
        87,
        125,
        175,
        199,
        206,
        184,
        110,
        242,
        159,
        3,
        18,
        42,
        0,
        225,
        25,
        6,
        234
      ]
    },
    "name": "25 To Life",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 38,
  "peers": 41,
  "last_updated": "2016-12-25T16:09:54.818Z"
}