{
  "title": "Legend, History and the Ancient City of Babylon",
  "uid": 15885442,
  "size": 3937167,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:e199e59c755f9d681f227f74cc6b57742d785a8f&amp;dn=Legend%2C+History+and+the+Ancient+City+of+Babylon&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 42,
  "leechers": 1,
  "uploader": "marty14",
  "files": 1,
  "time": 1474646355,
  "description": "Legend, History and the Ancient City of Babylon - Michael Seymour [epub]\r\n\r\nBabylon: for eons its very name has been a byword for luxury and wickedness. &quot;By the rivers of Babylon we sat down and wept,&quot; wrote the psalmist, &quot;as we remembered Zion.&quot; One of the greatest cities of the ancient world, Babylon has been eclipsed by its own sinful reputation. For two thousand years the real, physical metropolis lay buried while another, ghostly city lived on, engorged on accounts of its own destruction.\r\n \r\nMore recently the site of Babylon has been the centre of major excavation, yet the spectacular results of this work have done little to displace the many other fascinating ways in which the city has endured and reinvented itself in culture. Saddam Hussein, for one, notoriously exploited the Babylonian myth to associate himself and his regime with its glorious past. Why has Babylon so creatively fired the human imagination, with results both good and ill? Why has it been so enthralling to so many, and for so long?\r\n\r\nIn exploring answers, Michael Seymour's book ranges extensively over space and time and embraces art, archaeology, history and literature. From Hammurabi and Nebuchadnezzar, via Strabo and Diodorus, to the Book of Revelation, Breughel, Rembrandt, Voltaire, William Blake and modern interpreters like Umberto Eco, Italo Calvino and Gore Vidal, the author brings to light a carnival of disparate sources dominated by powerful and intoxicating ideas such as the Tower of Babel and the city of sin.\r\n\r\nYet captivating as this dark mythology was and has continued to be, at its root lies a remarkable and sophisticated imperial civilization whose complex state-building, law-making and religion dominated Mesopotamia and beyond for millennia, before its incorporation into the still wider Persian empire of the Achaemenid kings",
  "parsed": {
    "xt": "urn:btih:e199e59c755f9d681f227f74cc6b57742d785a8f",
    "dn": "Legend, History and the Ancient City of Babylon",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "e199e59c755f9d681f227f74cc6b57742d785a8f",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        225,
        153,
        229,
        156,
        117,
        95,
        157,
        104,
        31,
        34,
        127,
        116,
        204,
        107,
        87,
        116,
        45,
        120,
        90,
        143
      ]
    },
    "name": "Legend, History and the Ancient City of Babylon",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 43,
  "peers": 18,
  "last_updated": "2016-12-25T16:15:29.977Z"
}