{"title":"StuffIt Deluxe v. 15.0.4 (2011) with Core Keygen","uid":7047946,"size":103994969,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:e24080004cb18eecbb7e1d1b62bb769dbd6c0ad3&amp;dn=StuffIt+Deluxe+v.+15.0.4+%282011%29+with+Core+Keygen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":45,"leechers":0,"uploader":"polisdavid","files":-1,"time":1329808915,"description":"NOTE: I know a lot of you out there think this is obsolete software, but it is a request....\n\nOfficial Web Site: &lt;a href=&quot; http://www.stuffit.com/mac-deluxe.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.stuffit.com/mac-deluxe.html&lt;/a&gt;\n\nStuffIt DeluxeÃ‚Â®\n\nThe only compression utility you need\n\nStuffIt DeluxeÃ‚Â® gives you all the features you need to backup, share, archive, encrypt and shrink your photos, music, and other documents without compromising quality.\n\nStuffIt Deluxe covers all the bases! Key Features Include:\n\n* StuffIt Destinations - Make your files as mobile as you are.\n\n* Simplify your workflow with our quick drag-and-drop tool! Pack and\n  send your files any way and anywhere you want them to go without\n  worrying about the details. Whether it's Mobile\n\n* Better Compression than other Zip Utilities\n\n* You can create both Zip and StuffIt X Archives. StuffIt's advanced\n  technology specializes in the compression of MP3, PDF and JPEG files\n  with no quality loss. Shrink documents up to 98% of their original size. \n\n* Use StuffIt to free-up space on your computer and to fit more\n  compressed files onto CD/DVDs or other drives.\n\n* Super-strong Encryption and Password Protection \n\n* Secure your compressed data with password protection and encryption\n  with strong 512-bit encryption for SITX archives and AES 256-bit\n  encryption for Zip files.\n\n* Self-healing Archives Protect Against Data Loss \n\n* StuffIt's automatic archive repair abilities ensure your data's integrity\n  over the long haul.\n\n* Browse Archive Contents like any folder - No Expansion Necessary\n\n* No more having to remember what you put inside, or expanding an\n  archive just to check for something. Archive Manager gives you easy\n  browse access to the contents of your archives. Browse the contents of \n StuffIt X, Zip, Tar, and RAR archives, including encoded archives, and \n  compressed Tar archives (tarballs).\n\n* StuffIt Scheduler makes backups a snap - set it and forget it\n\n* StuffIt Scheduler is designed to provide a simple, easy to use, personal\n  backup solution. You can use StuffIt Scheduler to schedule automatic\n  file backups, and you can save the backup archives you create to CDs,\n  DVDs, external drives, FTP servers, and even your MobileMe iDisk.\n \n* Use StuffIt to sift through your files and back up only those items that\n  have recently changed. You can even schedule StuffIt backups to occur\n  automatically at the same time every day.\n\n* Plug-in Support for Your Favorite Applications \n\n* You can access all the power of StuffIt directly from your favorite\n  applications including support for AdobeÃ‚Â® PhotoshopÃ‚Â® and\n  MicrosoftÃ‚Â® Office.\n\n* Secure file management &amp; delivery -anytime, anywhere\n \n* StuffIt Deluxe includes a subscription to SendStuffNow (formerly\n  called StuffIt Connect), a new kind of file delivery and storage service. \n\n* With SendStuffNowyou can easily deliver files up to 2GB in size\n  without the hassle of email bounces or FTP. Your recipients simply\n  click an emailed link to download files in a web browser, no accounts or\n  special software required!\n\n* StuffItÃ‚Â® SmartSend \n\n* Take the guesswork out of sending large files via email with SmartSend\n  - simply select the files you want to send and choose &quot;Stuff &amp; Mail.&quot;\n \n* Small files are automatically compressed and attached to a new email\n  message, while larger items are uploaded to a secure website via \n  SendStuffNow, which allows you to download files from anywhere. \n\n* Say goodbye to email bounce-backs.\n\nMinimum System Requirements:\n\nMac OS X 10.5 or higher; 40MB of free disk space.\nGrowl support\nOS Lion compatible\n\n--- PLEASE SEED ---","torrent":{"xt":"urn:btih:e24080004cb18eecbb7e1d1b62bb769dbd6c0ad3","amp;dn":"StuffIt+Deluxe+v.+15.0.4+%282011%29+with+Core+Keygen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e24080004cb18eecbb7e1d1b62bb769dbd6c0ad3","infoHashBuffer":{"type":"Buffer","data":[226,64,128,0,76,177,142,236,187,126,29,27,98,187,118,157,189,108,10,211]},"announce":[],"urlList":[]}}