{
  "title": "EVERSPACE v2.0.0.2 (GOG)",
  "uid": 15829349,
  "size": 1905130992,
  "categoryP": "games",
  "categoryS": "pc",
  "magnet": "?xt=urn:btih:e24e48e58987751b77a828fff800904bea7d3a00&amp;dn=EVERSPACE+v2.0.0.2+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 217,
  "leechers": 9,
  "uploader": "dauphong",
  "files": 4,
  "time": 1473896722,
  "description": "About This Game\r\nEVERSPACE™ is an action-focused single-player space shooter combining roguelike elements with top-notch visuals and a captivating non-linear story. It takes you on a challenging journey through an ever-changing, yet beautifully crafted universe full of surprises. Your skills, experience and talent for improvisation will be tested continuously while learning about your own existence through encounters with interesting characters, each having their own part of the puzzle to tell. Each run will be exciting as you will have to face completely new situations keeping each part of the game long-lasting and generating lots of individual, meaningful moments to experience. However, no matter how skilled a pilot you are, death is inevitable, but only the beginning of a much larger journey.\r\n\r\n    Fight! Dash into exciting dogfights and experience furious space combat using a wide range of weaponry and devices.\r\n    Craft! Use collected or mined resources to craft equipment and modifications for a much needed advantage or repair your ship's systems. Your choice.\r\n    Loot! Collect blueprints for crafting and go on the hunt for exotic weaponry and equipment. You never know what drops next.\r\n    Explore! Travel through huge procedurally generated levels with lots of hidden treasure and danger. A game of risk and reward awaits.\r\n    Die! Giving in to the seductive embrace of death does not mean the end. Spend collected credits to unlock new perks and keep your blueprints to boost your chances for the next run",
  "parsed": {
    "xt": "urn:btih:e24e48e58987751b77a828fff800904bea7d3a00",
    "dn": "EVERSPACE v2.0.0.2 (GOG)",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "e24e48e58987751b77a828fff800904bea7d3a00",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        226,
        78,
        72,
        229,
        137,
        135,
        117,
        27,
        119,
        168,
        40,
        255,
        248,
        0,
        144,
        75,
        234,
        125,
        58,
        0
      ]
    },
    "name": "EVERSPACE v2.0.0.2 (GOG)",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 226,
  "peers": 134,
  "last_updated": "2016-12-25T16:20:17.051Z"
}