{"title":"Anno 1404 Gold Edition (GOG)","uid":13380861,"size":5305404646,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e261b2a85b1582c572d4ce896cc38358c0ea1062&amp;dn=Anno+1404+Gold+Edition+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":96,"leechers":12,"uploader":"mercs215","files":6,"time":1454277103,"description":"Install instructions:\r\n- Run &quot;setup_anno_1404_2.0.0.2.exe&quot;\r\n- Play\r\nPLEASE REMEMBER TO SEED, MANY OTHERS WANT THIS! :)\r\nIf you like this game, support the developers and BUY IT!\r\n\r\nTitle: ANNO 1404: GOLD EDITION\r\nGenre: Simulation - Strategy - Historical\r\nWorks on: Windows (XP, Vista, 7, 8, 10)\r\nLanguages: Audio and text: Deutsch, English, español, français, italiano\r\nFeatures: single-player - multi-player - co-op\r\nReleased: December 8, 2010\r\nSize: 5 GB\r\nCompany: Blue Byte, Related Designs / Ubisoft\r\nRating:\tESRB Rating: Teen (with Drug Reference, Mild Blood, Mild Language, Mild Suggestive Themes, Mild Violence, Online Interactions Not Rated by the ESRB)\r\nStore page: http://www.gog.com/game/anno_1404_gold_edition\r\n\r\nAbout:\r\nAnno 1404: Gold Edition includes Anno 1404 and its add-on Anno 1404: Venice.\r\nAnno 1404 and its add-on are an award winning combination of construction, economy, discovery, diplomacy &amp; combat. Raise monumental metropolises and develop an idealized historical empire in the Orient and the Venice of the Renaissance. The game also offers multiplayer support, allowing you to share this experience with your friends.\r\nCreate your own nation with a unique blend of simulation and real-time strategy as you journey across the globe to explore, trade, and learn technologies to expand your empire and to make your own history.\r\nMeet the Orient! Build your own settlement and get to know the culture and technologies of the Orient.\r\nCreate huge metropolises! Build a unique seaside with the harbor system and shape the character of your new city with alleyways, city walls, and castles.\r\nPersonalize the way you play! Configure the interface to fit your own personal needs. Create your own adventures in the Anno world with powerful tools and share them with the community.\r\nA strategy game for beginners and pros! An intuitive interface for beginners with many options for advanced players. A thrilling campaign that carries beginners into the world of Anno. A motivating sandbox mode that can be modified by players to any degree. Special titles, talents, medals, and other rewards that are collected in the captain's log.\r\nNew Venetian Setting in the add-on Anno 1404: Venice The rich Anno 1404 environment is complemented with a new Venetian setting offering new possibilities of interaction. Build two new Venetian ship types: the small and big tradesman cog. Develop secret cabinets, infiltrate your enemies and sabotage their expansion. Take control over enemy cities thanks to your influence in the cities council board.\r\n\r\nMinimum system requirements - Windows: Windows XP / Vista / 7 / 8 / 10\r\nProcessor: Intel 3GHz or comparable (dual core recommended)\r\nMemory: 1 GB (3 GB recommended)\r\nGraphics: DirectX®9-compatible graphics adapter with 128 MB RAM (DirectX®10 with 512 MB recommended)\r\nDirectX®: DirectX®9/10\r\nHard Drive: 6 GB free space\r\nSound: DirectX®9-compatible\r\nMouse, Keyboard\r\n\r\nMultiplayer Notice:\r\nA Uplay account and key code are required to play online multiplayer. Offline multiplayer does not require anything beyond a LAN connection","torrent":{"xt":"urn:btih:e261b2a85b1582c572d4ce896cc38358c0ea1062","amp;dn":"Anno+1404+Gold+Edition+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e261b2a85b1582c572d4ce896cc38358c0ea1062","infoHashBuffer":{"type":"Buffer","data":[226,97,178,168,91,21,130,197,114,212,206,137,108,195,131,88,192,234,16,98]},"announce":[],"urlList":[]}}