{
  "title": "Sylvia Plath - The Bell Jar, Poetry &amp; Journals (5 books)",
  "uid": 9870238,
  "size": 16853774,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:e2a32397ae551e4d0a8e8b2c6ed585c3c127078a&amp;dn=Sylvia+Plath+-+The+Bell+Jar%2C+Poetry+%26amp%3B+Journals+%285+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 41,
  "leechers": 4,
  "uploader": "workerbee",
  "files": -1,
  "time": 1396401894,
  "description": "\nSYLVIA PLATH (1932-1963) was an American poet, novelist and short story writer.  She married fellow poet Ted Hughes in 1956.  Plath suffered from depression for much of her adult life, and in 1963 she committed suicide.  Controversy continues to surround the events of her life and death, as well as her writing and legacy.\n\nPlath is credited with advancing the genre of confessional poetry and is best known for her two published collections, THE COLOSSUS &amp; OTHER POEMS and ARIEL, both of which are included here.  The facsimile edition of ARIEL reproduces Plath's original manuscript -- including handwritten notes -- and her own selection and arrangement of poems.  THE COLLECTED POEMS is a new edition of Sylvia Plath's Pulitzer Prize-winning collection, edited and with an introduction by Ted Hughes.\n\nTHE BELL JAR is a semi-autobiographical novel detailing the protagonist's descent into mental illness.  Plath committed suicide a month after its first UK publication.  It has been translated into nearly a dozen languages.\n\nPlath's JOURNALS were originally published in 1982 in a heavily abridged version authorized by Ted Hughes. The unabridged edition included here is an exact and complete transcription of the diaries Plath kept during the last twelve years of her life. Sixty percent of the book is material that has never before been made public, more fully revealing the intensity of the poet's personal and literary struggles, and providing fresh insight into both her frequent desperation and the bravery with which she faced down her demons.\n\n\nThe following books are in ePUB format unless otherwise indicated:\n\n* ARIEL: The Restored Edition: A Facsimile of Plath's Manuscript, Reinstating Her Original Selection and Arrangement (Faber &amp; Faber, 2004).  Foreword by Frieda Hughes.\n\n* THE BELL JAR (Harper Perennial, 2000).\n\n* THE COLLECTED POEMS (Harper &amp; Row, 1981).  Edited and with an Introduction by Ted Hughes. -- PDF\n\n* THE COLOSSUS &amp; OTHER POEMS (Knopf, 1962; rep. 1998).\n\n* THE UNABRIDGED JOURNALS OF SYLVIA PLATH, 1950-1962 (Anchor Books, 2000).  Transcribed from the original manuscripts at Smith College and edited by Karen V. Kukil.\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n            &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!\n",
  "parsed": {
    "xt": "urn:btih:e2a32397ae551e4d0a8e8b2c6ed585c3c127078a",
    "dn": "Sylvia Plath - The Bell Jar, Poetry &amp; Journals (5 books)",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "e2a32397ae551e4d0a8e8b2c6ed585c3c127078a",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        226,
        163,
        35,
        151,
        174,
        85,
        30,
        77,
        10,
        142,
        139,
        44,
        110,
        213,
        133,
        195,
        193,
        39,
        7,
        138
      ]
    },
    "name": "Sylvia Plath - The Bell Jar, Poetry &amp; Journals (5 books)",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 45,
  "peers": 26,
  "last_updated": "2016-12-25T16:22:35.542Z"
}