{
  "title": "Starbound (2.1.0.3) (GOG)",
  "uid": 15379035,
  "size": 1514639695,
  "categoryP": "games",
  "categoryS": "pc",
  "magnet": "?xt=urn:btih:e329d988624c9cb46463b03da46d7d8bd08908f0&amp;dn=Starbound+%282.1.0.3%29+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 183,
  "leechers": 8,
  "uploader": "mercs215",
  "files": 2,
  "time": 1469214751,
  "description": "Install instructions:\r\n- Run &quot;setup_starbound_2.1.0.3.exe&quot;\r\n- Play\r\nPLEASE REMEMBER TO SEED, MANY OTHERS WANT THIS! :)\r\nIf you like this game, support the developers and BUY IT!\r\nCredits: This release was made possible by Swapware Games Network!\r\n\r\nTitle: STARBOUND\r\nGenre: Action - Adventure - Sandbox\r\nWorks on: Windows (XP, Vista, 7, 8, 10), Mac OS X (10.6.8) and Linux (Ubuntu 14.04, Ubuntu 16.04)\r\nLanguages: Audio and text: English\r\nFeatures: single-player - multi-player - co-op\r\nReleased: July 22, 2016\r\nSize: 1.5 GB\r\nCompany: Chucklefish / Chucklefish\r\nStore page: https://www.gog.com/game/starbound\r\n\r\nAbout:\r\nStarbound is an extraterrestrial sandbox adventure game! You’ve fled your home, only to find yourself lost in space with a damaged ship. Your only option is to beam down to the planet below and gather the resources you need to repair your ship and set off to explore the vast, infinite universe…\r\nUse the starmap to travel between star systems, settle down and farm the land, build and colonize a modern metropolis, take on quests to earn a living, or complete story missions to unlock some of the greater galactic mysteries!\r\nWith lots to do and a near-infinite number of procedurally generated worlds to discover, Starbound allows players to create their own adventures in space.\r\nWhat will you find?\r\nChoose from one of 7 playable races and customize your character\r\nSave the universe in a story campaign featuring unique characters, bosses, dungeons and quests!\r\nYou're the captain of your very own starship! Decorate it, expand it and use it to explore a procedurally generated universe\r\nColonize uncharted planets and collect gifts from your tenants - if they like you, they may even ask to join your ship crew!\r\nThree game modes - Casual (no need to eat), Survival (eat to survive/drop items on death) and Hardcore (permadeath)\r\nCraft thousands of objects - building materials, armor, weapons, furniture and more\r\nCapture unique monsters to fight alongside you\r\nAll content is available in online drop-in/drop-out co-op\r\nBuilt from the ground up to be easily moddable. You have the tools to make the universe your own - add new races, biomes, dungeons, and quests\r\n\r\nMinimum system requirements - Windows: OS: Windows XP or later, Processor: Core 2 Duo, Memory: 2 GB RAM, Graphics: 256 MB graphics memory and directx 9.0c compatible gpu, DirectX: Version 9.0c, Network: Broadband Internet connection, Storage: 3 GB available space\r\nRecommended system requirements - Windows: OS: Windows XP or later, Processor: Core i3, Memory: 4 GB RAM, Graphics: Discrete GPU capable of directx 9.0c, DirectX: Version 9.0c, Network: Broadband Internet connection, Storage: 4 GB available space",
  "parsed": {
    "xt": "urn:btih:e329d988624c9cb46463b03da46d7d8bd08908f0",
    "dn": "Starbound (2.1.0.3) (GOG)",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "e329d988624c9cb46463b03da46d7d8bd08908f0",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        227,
        41,
        217,
        136,
        98,
        76,
        156,
        180,
        100,
        99,
        176,
        61,
        164,
        109,
        125,
        139,
        208,
        137,
        8,
        240
      ]
    },
    "name": "Starbound (2.1.0.3) (GOG)",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 191,
  "peers": 100,
  "last_updated": "2016-12-25T16:25:44.283Z"
}