{"title":"Dirty Dancing 1987 20th Anniversary DvDrip[Eng]-greenbud1969","uid":4638602,"size":735074351,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e36f3871511dfe4aaf28a4fb9690da4acff9980b&amp;dn=Dirty+Dancing+1987+20th+Anniversary+DvDrip%5BEng%5D-greenbud1969&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":55,"leechers":0,"uploader":"greenbud1969","files":-1,"time":1231637858,"description":"Dirty Dancing 1987 20th Anniversary Edition DvDrip[Eng]-greenbud1969\n\n\ninfo-           &lt;a href=&quot; http://www.imdb.com/title/tt0092890/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt0092890/&lt;/a&gt;\n\n\ntrailer-        &lt;a href=&quot; http://www.imdb.com/video/screenplay/vi3957916441/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/video/screenplay/vi3957916441/&lt;/a&gt;\n\n\nFILES........... 1\nAUDIO........... MP3 48000HZ 128 KBPS CBR (2 CHNLS)\nVIDEO........... 953 KBPS XVID 23.976 FPS\nRESOLUTION...... 608 x 336 (WIDESCREEN)\nRUNTIME......... 1:40:21\nSOURCE.......... DVD\n\nDIRECTOR........ EMILE ARDOLINO\n\n\nSTARRING........ JENNIFER GREY,PATRICK SWAYZE,JERRY ORBACH,CYNTHIA RHODES,JACK WESTON,JANE BRUCKER,KELLY BISHOP,LONNY PRICE,MAX CANTOR,CHARLES HONI COLES ....\n\n\nPLOT:\n\n\nIn the 1960s, Frances &quot;Baby&quot; Houseman, a sweet daddy's girl, goes with her family to a resort in upstate New York's Catskill Mountains. Baby has grown up in privileged surroundings and all expect her to go on to college, join the Peace Corps and save the world before marrying a doctor, just like her father. Unexpectedly, Baby becomes infatuated with the camp's dance instructor, Johnny, a man whose background is vastly different from her own. Baby lies to her father to get money to pay for an illegal abortion for Johnny's dance partner (Johnny is not the father). She then fills in as Johnny's dance partner and it is as he is teaching her the dance routine that they fall in love. It all comes apart when Johnny's friend falls seriously ill after her abortion and Baby gets her father, who saves the girl's life. He then learns what Baby has been up to, who with and worse - that he funded the illegal abortion. He bans his daughter from any further association with &quot;those people&quot;. In the first deliberately willful action of her life, Baby later sneaks out to see Johnny - ostensibly to apologize for her father's rudeness - and ends up consummating her relationship with Johnny. A jealous fellow vacationer sees Baby sneaking out of Johnny's bungalow the next morning and in an act of retribution, tells management that he is responsible for a theft the evening before, knowing he would not furnish his real whereabouts. In an act of bravery, Baby states that Johnny is innocent, and alibis him by confessing that they were together all night. This revelation causes a huge rift in the family and Baby makes an impassioned speech to her angry and bereft father. At the closing night performances, and although he has been fired and banned from attending, Johnny returns and takes the stage to tell everyone about the woman whose faith in him and whose courage changed his life. They do one final show-stopping dance together. Baby's father learns that Johnny was not responsible for his partner's pregnancy and learns to accept that although his beloved daughter is transitioning to womanhood, she will always love him.\n\n\nTAGLINE:\n\n\nHave The Time Of Your Life. First dance. First love. The time of your life. Dancing\nto the beat of their hearts. \n\n\nAll stand-alone divx players compatible\n\n\nENJOY &amp; PLEASE SEED FOR AS LONG AS U CAN !!!! \n\n\nPATRICK SWAYZE  R.I.P.  8/18/52 - 9/14/09\n\n\nALSO IF YOU HAVE ANY REQUESTS DON'T HESITATE TO ASK. I MIGHT HAVE WHAT YOUR LOOKING FOR. YOU NEVER KNOW IT NEVER HURTS TO ASK.","torrent":{"xt":"urn:btih:e36f3871511dfe4aaf28a4fb9690da4acff9980b","amp;dn":"Dirty+Dancing+1987+20th+Anniversary+DvDrip%5BEng%5D-greenbud1969","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e36f3871511dfe4aaf28a4fb9690da4acff9980b","infoHashBuffer":{"type":"Buffer","data":[227,111,56,113,81,29,254,74,175,40,164,251,150,144,218,74,207,249,152,11]},"announce":[],"urlList":[]}}