{"title":"The Bachelor S19E08 WEB-DL x264-Hector mp4","uid":11704994,"size":712056691,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e4a248bbbc4f932e6e73b2dd029c9fbeb58c1b61&amp;dn=The+Bachelor+S19E08+WEB-DL+x264-Hector+mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":45,"leechers":3,"uploader":"GaryBradbury2012","files":1,"time":1424092496,"description":"Chris puts a difficult, heart-wrenching week behind him, but tough decisions remain as the episode begins with the cocktail party in Deadwood, South Dakota, and Chris sends home an easygoing, carefree bachelorette. The lucky remaining women accompany Chris to his home state of Iowa, where they get a sneak peek of what life with the Bachelor might be like. Jade snares her second one-on-one date and the chance to visit Chris's hometown of Arlington, Iowa. Another one-on-one date with Whitney to Des Moines has the couple celebrating love in photos,but then she is grilled by Chris's best friends. What will be their verdict? The rest of the women decide to take their own road trip to Arlington, Chris's hometown, and they are in for a reality check. How will they react to the town being that small? One woman shares a dark secret she has been keeping from Chris, but when will Chris, himself, find out? A high stakes group date pits two frontrunners against an underdog with the winner of the date rose automatically getting a hometown date. It all culminates with one jealous woman confronting Chris in a devastating meltdown","torrent":{"xt":"urn:btih:e4a248bbbc4f932e6e73b2dd029c9fbeb58c1b61","amp;dn":"The+Bachelor+S19E08+WEB-DL+x264-Hector+mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4a248bbbc4f932e6e73b2dd029c9fbeb58c1b61","infoHashBuffer":{"type":"Buffer","data":[228,162,72,187,188,79,147,46,110,115,178,221,2,156,159,190,181,140,27,97]},"announce":[],"urlList":[]}}