{"title":"Guns N' Roses - The Ultimate Best Of..(2-CD)..2015 320ak","uid":12408800,"size":513284411,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e53ec3ec31b17cdccfd85b8a7e259f8d1a11ea61&amp;dn=Guns+N%27+Roses+-+The+Ultimate+Best+Of..%282-CD%29..2015+320ak&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":38,"leechers":9,"uploader":"analogkid6103","files":41,"time":1442126026,"description":"Guns n' Roses aren't necessarily a band that's well suited to hits compilations, since their albums capture the raw, messy vitality of their music.\n \nSince the So called Greatest hits album was horribly weak and had just a taste of the band. It actually made the band out to be one dimmentional it was a disservice .But Axel was not playing nice by leaving everything hanging for SO long they should have catapulted into the 21st century as a Monster band instead of sitting on jackstands with Axel saying each year that its coming dont worry its comming, Ill put the new wheels on and we cruise.\n\n So we've been left to manufacture our own. \nIt is hard to give a rating for it because its way past its due date we get a Knock off G'nR &quot;Band&quot; fronted by Axel who still had not quite got over whatever hung em up so long ago that No one knows why it happened .\nDid he think that the window would stay open until the next decade or 2?\nSo this and other compilations have appeared and im sure there will be some more And probably at least 2 more from me somewhere down the line. \nAnyway this record, because it's not something new for occasional listeners and diehard fans (except for maybe Sympathy For the Devil, which was never released on any GN'R record). Nevertheless, it's Guns N Roses, multi-platinum hard rockers from L.A., and they deserve a top mark, And this does cover it pretty good. I would say its what the Greatest Hits Record should have looked like and thats enough from analogkid6103\n\nIm not a reviewer Im an outlaw uploader. I keep talkin and somebody might think I would rather be doing honest work, LOL..... yeah right\n\nNow dont get lost now this is the tracklist to Geffins GnR Greatest Hits Package released uh...um ... well fuk it dont matter it was very long ago before Napster.\n Cassettes were still alive.\n\n01. Welcome To The Jungle \n02. Sweet Child O' Mine  \n03. Patience \n04. Paradice City \n05. Knockin' On Heaven's Door \n06. Civil War: \n07. You Could Be Mine  \n08. Don't Cry (original) \n09. November Rain \n10. Live And Let Die  \n11. Yesterdays \n12. Ain't It Fun \n13. Since I Don't Have You  \n\n14. Sympathy For The Devil? \nSeriously dude? this was not a great hit at least for GnR\nit was just a filler/tease from Axel to placate the fans while they still were.Its worthy only cause there was nothing else.\n\nThey are all decent tracks but to release this and say its their Greatest hits. \nWeak. \nThat list should be at least twice the size.\n\nSo Here is the Tracklist for THIS Greatest hits album and let justice be done.\nAnd who really knows maybe they will have a reunion before it looks like..... \n\nThe Travelling Guns N' Wilburys. UGH\n\nNow Here Is a Tracklist that works for me.....\n\nDescription\n\n01. 14 Years\n02. Ain't It Fun\n03. Anything Goes\n04. Yesterdays\n05. Back Off Bitch\n06. Welcome To The Jungle\n07. Sympathy For The Devil\n08. Nightrain\n09. Sweet Child O' Mine\n10. Live And Let Die\n11. Patience\n12. Knockin' On Heaven's Door\n13. Chinese Democracy\n14. Civil War\n15. Coma\n16. Paradise City\n17. Don't Cry\n18. Don't Damn Me\n19. Double Talkin' Jive\n20. Down On The Farm\n\nAnd the rest\n\n21. Out Ta Get Me\n22. Estranged\n23. November Rain\n24. It's So Easy\n25. Hair Of The Dog\n26. Mr. Brownstone\n27. You're Crazy\n28. You Can't Put Your Arms Around A Memory\n29. You Could Be Mine\n30. Right Next Door To Hell\n31. The Garden\n32. Dust N' Bones\n33. Better\n34. Perfect Crime\n35. Street Of Dreams\n36. Catcher In The Rye\n37. Since I Don't Have You\n38. Dead Horse\n39. Move To The City\n40. Garden Of Eden\n\n\n BTW They all Will fit on a 700mb CD. But you probably should make it 2.\nIts your choice but I will call it a 2-CD Enjoy and do me like Axel did us tell me you will seed and not. And come around  and tell me again and not ...seed if you keep. thx","torrent":{"xt":"urn:btih:e53ec3ec31b17cdccfd85b8a7e259f8d1a11ea61","amp;dn":"Guns+N%27+Roses+-+The+Ultimate+Best+Of..%282-CD%29..2015+320ak","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e53ec3ec31b17cdccfd85b8a7e259f8d1a11ea61","infoHashBuffer":{"type":"Buffer","data":[229,62,195,236,49,177,124,220,207,216,91,138,126,37,159,141,26,17,234,97]},"announce":[],"urlList":[]}}