{
  "title": "The X-Files Season 1, 2, 3, 4, 5, 6, 7, 8, 9 + Extras DVDRip HDT",
  "uid": 6797832,
  "size": 80607380705,
  "categoryP": "video",
  "categoryS": "tv_shows",
  "magnet": "?xt=urn:btih:e575b52418ab0a0e6bbfdfeb08a9d04fe693935e&amp;dn=The+X-Files+Season+1%2C+2%2C+3%2C+4%2C+5%2C+6%2C+7%2C+8%2C+9+%2B+Extras+DVDRip+HDT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 108,
  "leechers": 490,
  "uploader": "TSV",
  "files": -1,
  "time": 1320525823,
  "description": "The X-Files is an American science fiction television series and a part of The X-Files franchise, created by screenwriter Chris Carter. The program originally aired from September 10, 1993 to May 19, 2002. The show was a hit for the Fox network, and its characters and slogans (such as &quot;The Truth Is Out There&quot;, &quot;Trust No One&quot;, &quot;I Want to Believe&quot;) became popular culture touchstones in the 1990s. Seen as a defining series of its era, The X-Files tapped into public mistrust of governments and large institutions, and embraced conspiracy theories and spirituality as it centered on efforts to uncover the existence of extraterrestrial life. The series spawned a spin-off show, The Lone Gunmen.\nIn the series, FBI agents Fox Mulder (David Duchovny) and Dana Scully (Gillian Anderson) are the investigators of X-Files: marginalized, unsolved cases involving paranormal phenomena. Mulder is a believer in the existence of aliens and the paranormal, while Scully, a skeptic, is assigned to make scientific analyses of Mulder's discoveries. Early in the series both agents become pawns in a larger conflict, and come to trust only each other. They develop a close relationship, which begins as a platonic friendship, but develops into a romantic relationship by the end of the series' run.\nIn addition to the series-spanning story arc, &quot;monster of the week&quot; episodes made up roughly two-thirds of the series. In such stand-alone episodes, Mulder and Scully investigated strange crimes which often had no long-term effect on the storyline, though the episodes contributed to the show's background.\nIn 1998 the feature film The X-Files was released. This was followed in 2008 by a post-series film, The X-Files: I Want to Believe. In the last two seasons, Gillian Anderson became the star as David Duchovny appeared intermittently, and new central characters were introduced: FBI agents John Doggett (Robert Patrick) and Monica Reyes (Annabeth Gish). Mulder and Scully's boss, Assistant Director Walter Skinner (Mitch Pileggi), also became a central character. By the time the series ended, The X-Files had become the longest-running science fiction series in US broadcast television history, though it was subsequently surpassed by Stargate SG-1 in 2007 and by Smallville in 2011.",
  "parsed": {
    "xt": "urn:btih:e575b52418ab0a0e6bbfdfeb08a9d04fe693935e",
    "dn": "The X-Files Season 1, 2, 3, 4, 5, 6, 7, 8, 9   Extras DVDRip HDT",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "e575b52418ab0a0e6bbfdfeb08a9d04fe693935e",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        229,
        117,
        181,
        36,
        24,
        171,
        10,
        14,
        107,
        191,
        223,
        235,
        8,
        169,
        208,
        79,
        230,
        147,
        147,
        94
      ]
    },
    "name": "The X-Files Season 1, 2, 3, 4, 5, 6, 7, 8, 9   Extras DVDRip HDT",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 598,
  "peers": 152,
  "last_updated": "2016-12-25T16:39:00.544Z"
}