{
  "title": "Wondershare PDFelement (PDF Editor) v5.7.3.7 + Serial {B4tman}",
  "uid": 12747383,
  "size": 46695051,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:e6327f3e6244802f8f1361d708954d061fddc7dc&amp;dn=Wondershare+PDFelement+%28PDF+Editor%29+v5.7.3.7+%2B+Serial+%7BB4tman%7D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 55,
  "leechers": 1,
  "uploader": "AliPaK",
  "files": 4,
  "time": 1447329117,
  "description": "Wondershare PDFelement (PDF Editor) v5.7.3.7 + Serial {B4tman}\r\n \nhttp://s12.postimg.org/yh0snuxcd/3574b6d3.jpg \nhttp://s15.postimg.org/f0fawssvu/image.jpg\r\n\r\nDescription:-\r\n\r\nWondershare PDF element is an all-in-1 PDF solution to create industry-standard PDF files, edit PDF text &amp; images, convert PDF to Office documents for reuse, add comments with a box of commenting tools, edit &amp; fill in PDF forms. It's a must for office work. With it, besides the aforementioned work you can do, you can also sign PDF documents with certificated digital signatures, protect PDF files with passwords, use the OCR technology (only available for PDF element Pro version) to make text in image-based PDF files searchable and editable.\r\n\r\nWondershare PDF element is an application you can use to modify PDF documents by either editing the contents or adding several custom highlight features.\r\nYou can insert sticky notes, text boxes and annotations that you can track in a history log, or you can convert the edited document to DOC, XLS, or JPEG format.\r\nEvery available function, like Merge and Split PDF files or Convert to Word are all right there in the toolbar, no hidden sub-menus or elaborate names, just an effective precision toolbox that lets you treat any PDF as your own creative property.\r\n\r\nFeatures:-\r\n\r\n• Created PDF files from almost any document. Wondershare PDF element is a powerful PDF Creator as well. It saves every document which can be opened on your computer to as a PDF file.\r\n\r\n• Total Text Edit. Wondershare PDF element lets you add text anywhere in the document and freely adjust font style, size, color and alignment.\r\n\r\n• Convert PDF to Word/Excel/Powerpoint/HTML/EPUB/RTF and more. Easily and quickly convert PDF to editable Microsoft Office documents and EPUB eBooks.\r\n\r\n• Advanced Annotation. With an array of conversation bubbles, shapes and highlighters, bring attention to important or unwanted text. Also use underline and strike through tools, and even add sticky notes.\r\n\r\n• Sign PDF files and forms with certified digital signatures.\r\n\r\n• Protect PDF files. Wondershare PDF element empowers you to take full control of users' access to your PDF files by adding password or restrictions.\r\n\r\n• Edit and fill out PDF forms. Wondershare PDF element lets you edit and fill out PDF forms that come with interactive fields.\r\n\r\nSystem Requirements:-\r\n\r\n• Operating System: Windows 10/8.1/8/7/XP/Vista\r\n• Processor: 1Ghz Processor or above\r\n• RAM: 512MB RAM or above\r\n• Available Hard Drive Space: 500 MB or above",
  "parsed": {
    "xt": "urn:btih:e6327f3e6244802f8f1361d708954d061fddc7dc",
    "dn": "Wondershare PDFelement (PDF Editor) v5.7.3.7   Serial {B4tman}",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "e6327f3e6244802f8f1361d708954d061fddc7dc",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        230,
        50,
        127,
        62,
        98,
        68,
        128,
        47,
        143,
        19,
        97,
        215,
        8,
        149,
        77,
        6,
        31,
        221,
        199,
        220
      ]
    },
    "name": "Wondershare PDFelement (PDF Editor) v5.7.3.7   Serial {B4tman}",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 56,
  "peers": 100,
  "last_updated": "2016-12-25T16:43:15.299Z"
}