{"title":"Gza - Liquid Swords (1995) 320 kbps","uid":5734714,"size":132911615,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:e7dbd29cffd5f59079182c89a37c382af30fd38c&amp;dn=Gza+-+Liquid+Swords+%281995%29+320+kbps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":62,"leechers":1,"uploader":"biglowdn","files":13,"time":1280765549,"description":"&quot;Liquid Swords is the second solo studio album by American rapper and Wu-Tang Clan member GZA, released November 7, 1995 on Geffen Records. The album heavily samples dialogue from the martial arts film Shogun Assassin and maintains a dark atmosphere throughout its course, while it incorporates lyrical references to chess, crime and philosophy. Though credited as a GZA album, Liquid Swords features numerous guest appearances from the entire nine piece Wu-Tang Clan.\n\nThe album initially received favorable critical reviews for its lyrically complex and musically hypnotic style. Over the years, its recognition has enhanced, with a number of famous publishers proclaiming it as one of the greatest hip hop albums of all time. In 2007, the Chicago Tribune cited it as 'one of the most substantial lyrical journeys in hip-hop history'. Along with Raekwon's Only Built 4 Cuban Linx..., Liquid Swords is often cited as the best solo Wu-Tang work.&quot;\n\nConverted from FLAC for your listening pleasure, with tags in place. Seed if you love it. If you don't love it, there's something wrong with you.","torrent":{"xt":"urn:btih:e7dbd29cffd5f59079182c89a37c382af30fd38c","amp;dn":"Gza+-+Liquid+Swords+%281995%29+320+kbps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7dbd29cffd5f59079182c89a37c382af30fd38c","infoHashBuffer":{"type":"Buffer","data":[231,219,210,156,255,213,245,144,121,24,44,137,163,124,56,42,243,15,211,140]},"announce":[],"urlList":[]}}