{"title":"Smartcuts: How Hackers, Innovators, and Icons Accelerate Success","uid":11034832,"size":170973554,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:e84c7cefd823d4f416eb9f63373fbfece583f050&amp;dn=Smartcuts%3A+How+Hackers%2C+Innovators%2C+and+Icons+Accelerate+Success&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":47,"leechers":2,"uploader":"Squiddy82","files":-1,"time":1410782002,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nSmartcuts: How Hackers, Innovators, and Icons Accelerate Success\n\n\nWritten by: Shane Snow\nNarrated by: Shane Snow, Erik Bergmann\nLength: 5 hrs and 55 mins\nUnabridged Audiobook\nRelease Date:09-09-14\n\nEntrepreneur and journalist Shane Snow (Wired, Fast Company, The New Yorker, and cofounder of Contently) analyzes the lives of people and companies that do incredible things in an implausibly short time.\n\nHow do some startups go from zero to billions in mere months? How did Alexander the Great, YouTube tycoon Michelle Phan, and Tonight Show host Jimmy Fallon climb to the top in less time than it takes most of us to get a promotion? What do high-growth businesses, world-class heart surgeons, and underdog marketers do in common to beat the norm?\n\nOne way or another, they do it like computer hackers. They employ what psychologists call &quot;lateral thinking&quot;: rethinking convention and breaking &quot;rules&quot; that aren't rules.\n\nThese are not shortcuts, which produce often dubious short-term gains, but ethical &quot;smartcuts&quot; that eliminate unnecessary effort and yield sustainable momentum. In Smartcuts, Snow shatters common wisdom about success, revealing how conventions like &quot;paying dues&quot; prevent progress, why kids shouldn't learn times tables, and how, paradoxically, it's easier to build a huge business than a small one.\n\nFrom SpaceX to The Cuban Revolution, from Ferrari to Skrillex, Smartcuts is a narrative adventure that busts old myths about success and shows how innovators and icons do the incredible by working smarter - and how perhaps the rest of us can, too.","torrent":{"xt":"urn:btih:e84c7cefd823d4f416eb9f63373fbfece583f050","amp;dn":"Smartcuts%3A+How+Hackers%2C+Innovators%2C+and+Icons+Accelerate+Success","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e84c7cefd823d4f416eb9f63373fbfece583f050","infoHashBuffer":{"type":"Buffer","data":[232,76,124,239,216,35,212,244,22,235,159,99,55,63,191,236,229,131,240,80]},"announce":[],"urlList":[]}}