{"title":"PublicAgent - Slim blonde with perfect tits fucks a stranger","uid":12457307,"size":731638348,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:e86cc5b1f3d092eefcd1ff294e9006dca651d10e&amp;dn=PublicAgent+-+Slim+blonde+with+perfect+tits+fucks+a+stranger&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":72,"leechers":23,"uploader":"EndYou","files":1,"time":1442763645,"description":"-------------\n:Description:\n-------------\nWalking down the street on a hot sunny day, I saw this hot blonde babe in pretty red dress. She was so hot! I could tell she had a stunning body under there! I told her I ran a 'modelling agency', at first she was a little hesitant. She didn't have a lot of time. I knew though I could get her interested, what woman doesn't wanna be a model?? Anyway, we got chatting and I told her about the business and that we were saving money on advertising by looking for girls on the street. She got more intrigued by it as I went on. Her eyes lit up though when I told her about the potential to earn some serious money. So, we went for a quick casting, just found some random staircase in this tower block. She took off her dress to reveal just as I had suspected. The hottest body ever! Her tits were perfect and her legs more so! I could feel my cock getting harder and harder! Anyway, she got dressed again and I told her straight up, I have a wad full of cash in my pocket, how about some fast sex right here, right now? When I showed her the cash she was on her knee's straight away! Oh my god, the blowjob she gave me was incredible! I got her up, pulled down her black, skimpy panties and slipped my cock deep inside her! We had to be quiet so no one could hear us but I had just enough time to fuck her in a few positions before emptying my load all over her chest!\n\n-------------\n:Screenshots:\n------------- &lt;a href=&quot;\nhttp://imgpremium.com/image/xv&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgpremium.com/image/xv&lt;/a&gt; &lt;a href=&quot;\nhttp://imgpremium.com/image/xX&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgpremium.com/image/xX&lt;/a&gt;","torrent":{"xt":"urn:btih:e86cc5b1f3d092eefcd1ff294e9006dca651d10e","amp;dn":"PublicAgent+-+Slim+blonde+with+perfect+tits+fucks+a+stranger","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e86cc5b1f3d092eefcd1ff294e9006dca651d10e","infoHashBuffer":{"type":"Buffer","data":[232,108,197,177,243,208,146,238,252,209,255,41,78,144,6,220,166,81,209,14]},"announce":[],"urlList":[]}}