{"title":"Kenny Rogers Greatest Hits 320cbr (Big Papi) 1980 Country Music","uid":9455194,"size":104772758,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e9220c1e27bc2dc787a24035e109690c02e9bb03&amp;dn=Kenny+Rogers+Greatest+Hits+320cbr+%28Big+Papi%29+1980+Country+Music&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":37,"leechers":10,"uploader":"Big-Papi","files":-1,"time":1389254397,"description":"Kenny Rogers Greatest Hits 320cbr (Big Papi) 1980 Country Music (Size: 99.92 MB)\n \t\t\n01 Kenny Rogers - The Gambler.mp3\t8.2 MB\n \t\t\n02 Kenny Rogers - Lady.mp3\t9.03 MB\n \t\t\n03 Kenny Rogers - Don't Fall in Love With a Dreamer.mp3\t8.55 MB\n \t\t\n04 Kenny Rogers - Ruby Don't Take Your Love To Town.mp3\t6.64 MB\n \t\t\n05 Kenny Rogers - She Believes in Me.mp3\t9.77 MB\n \t\t\n06 Kenny Rogers - Coward of the County.mp3\t10 MB\n \t\t\n07 Kenny Rogers - Lucille.mp3\t8.56 MB\n \t\t\n08 Kenny Rogers - You Decorated My Life.mp3\t8.46 MB\n \t\t\n09 Kenny Rogers - Reuben James.mp3\t6.19 MB\n \t\t\n10 Kenny Rogers - Love the World Away.mp3\t7.49 MB\n \t\t\n11 Kenny Rogers - Every Time Two Fools Collide.mp3\t7.06 MB\n \t\t\n12 Kenny Rogers - Long Arm of the Law.mp3\t9.91 MB\n \t\t\n\n\nSource: 1980 CD\n\n\n\n\nBy Daniel Jolley VINE VOICE\n\nThe early 1980s was a strange musical time period. As a child, I didn't really know that pop and country were distinct genres because the local radio station played songs of both types all the time. My favorite singers around 1981 were Stevie Wonder and Kenny Rogers - weird, huh? Kenny Rogers was huge back then, though. Lucille, Ruby Don't Take Your Love to Town, Coward of the County, Long Arm of the Law - these are great cross-over hits that made Kenny Rogers a star. Then there was The Gambler, a song so popular and enjoyable that it spawned a TV movie (as did Coward of the County). The kicker, though, was the song Lady (a song written and produced by Lionel Richie); I had a teacher who would melt at the very thought of this song, and I myself, a lad barely past the &quot;cooties&quot; stage of growing up, pretended to woo the young ladies with my own rendition of the song (in the utter privacy of my room, of course).\n\nAs an adult, I have an even greater appreciation of the songs included on this album. She Believes in Me is one of those rare ballads that speaks directly to your heart; it's a great tribute to all the women who put up with all of us men who don't deserve their love. A man doesn't want to admit he needs anything or anybody, but the love and trust of a good woman means much more than most men would ever admit. Just ask the husband of Lucille, who finds himself trying to raise four children by himself after his wife picks &quot;a fine time to leave&quot; him. You Decorated My Life is a beautiful homage to the miraculous life-giving power of love, and Love the World Away works the same kind of wonders. Lady, of course, is one of the greatest love songs ever recorded.\n\nStory songs were one of Kenny Rogers' greatest strengths.\nI'm not what you would call a country fan, but Kenny Rogers is much more than a country singer; he represents country, pop, and contemporary music all rolled up in one distinctive voice. This is a singer who still appeals to different generations of listeners. The great success Kenny Rogers enjoyed in the late 1970s and early 1980s can best be seen by his continued fame today, many years since his last bona fide hit song. Certainly, there are better, more complete Kenny Rogers collections out there than this one (which was released in 1980, after all, long before Kenny stopped releasing chart-topping hits), but I can't say anything bad about an album containing twelve songs of such high caliber and lasting appeal.","torrent":{"xt":"urn:btih:e9220c1e27bc2dc787a24035e109690c02e9bb03","amp;dn":"Kenny+Rogers+Greatest+Hits+320cbr+%28Big+Papi%29+1980+Country+Music","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9220c1e27bc2dc787a24035e109690c02e9bb03","infoHashBuffer":{"type":"Buffer","data":[233,34,12,30,39,188,45,199,135,162,64,53,225,9,105,12,2,233,187,3]},"announce":[],"urlList":[]}}