{"title":"Battlefield Hardline [R.G. Games]","uid":12466996,"size":31551259603,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e99460805caeadbabd233bfec99fa80a5fc5bffd&amp;dn=Battlefield+Hardline+%5BR.G.+Games%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":107,"leechers":107,"uploader":"vickey1992","files":16,"time":1442866791,"description":"Year: 2015\nGenre: Action, Shooter, 3D, 1st Person\nDeveloper: Visceral Games and EA DICE\nPublisher: Electronic Art\nGame Version: 1.07.15.00 (build 554756)\nPublication Type: RePack\nLanguage: English / Russian\nLanguage: English / Russian\nTablet: enclosing (cpy fix)\n\nSystem requirements:\nâˆš Operating system: Windows Vista, 7, 8 (x64 bit)\nâˆš Processor: Intel Core i3 / i5 2.4GHz, AMD Phenom II 2,8 GHz\nâˆš Memory: 4 GB\nâˆš Video card: GeForce GTX 260 / Radeon HD 5770\nâˆš Sound Card: DirectX 9.0c compatible\nâˆš Free hard drive space: 39 GB\n\nDescription:\nBattlefield Hardline - is famous multiplayer mode Battlefield and exciting story campaign in crime thriller genre. A world where the cops confront bandits. Collectors can rob trucks or rescue hostages. On which side of the law you want to administer their own affairs are you? New maps and gadgets will change your style of play. Climb the city buildings with the help of hooks and swish from house to house on the ropes, with a bag of money behind. No matter what strategy you take in the war for territory not do without teamwork.\n\nFeatures:\n&quot;Command tactical game, which is famous for a series of Battlefield, this time will unfold in the violent world of crime.\n&quot;An exciting story campaign from the creators of horror Dead Space cycle will involve you in a storm so controversial events that do not always you can clearly define where black and white where what is good and what is bad.\n&quot;Whatever happened in the Battlefield Hardline - whether it's a skirmish in the underground laboratory, hacking bank vault or a pogrom in the automotive interior - it looks spectacular and very believable. Please act according to circumstances, and use completely destroy any items to get out of the most serious scrape.\n&quot;There is a vast arsenal of weapons and tools, including a shotgun with a shortened barrel and stun, ropes and&quot; cat &quot;. All of this can be used on any map, so every encounter is unpredictable.\n&quot;The Battlefield Hardline offers the most diverse vehicles - motorcycles, cars, armored personnel carriers. Use any means of transportation, including air, to give yourself an edge in battle.\n\nDigital Deluxe Edition:\nBattle Set &quot;Universal&quot;: multi-purpose combat rifle, a unique camouflage for weapons and amplifier expertise;\nBattle set of &quot;accuracy&quot;, one of the most accurate assault rifles, a unique camouflage for weapons and amplifier expertise;\nBattle set of &quot;suppression&quot;: a rifle with the bulk store, a unique camouflage for all your weapons and experience of the amplifier;\n10 gold combat sets, each of which contains additional tools, patches and emblems, amplifiers experience and items for your character. You will receive one set of gold per week for ten weeks from the date of activation of the game.\n\nFeatures RePack:\nRemoved all localization except specified\nDo not recoded\nAdditional content\nThe combination of text and voice available in the game menu\nGame Version 1.07.15.00 (build 554756)\nSplit into 7 DVD-5 (readme.pdf in your hand)\nInstallation of additional PO (optional)\n\nRelease prepared by Baracuda UA for RG Games","torrent":{"xt":"urn:btih:e99460805caeadbabd233bfec99fa80a5fc5bffd","amp;dn":"Battlefield+Hardline+%5BR.G.+Games%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e99460805caeadbabd233bfec99fa80a5fc5bffd","infoHashBuffer":{"type":"Buffer","data":[233,148,96,128,92,174,173,186,189,35,59,254,201,159,168,10,95,197,191,253]},"announce":[],"urlList":[]}}