{"title":"Michelangelo and The Pope's Ceiling","uid":15890761,"size":2063495,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ead10109cc20ee75e7a3b0cdb99a326d3650fa16&amp;dn=Michelangelo+and+The+Pope%27s+Ceiling&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":36,"leechers":2,"uploader":"marty14","files":1,"time":1474738289,"description":"Michelangelo and The Pope's Ceiling - Ross King [epub]\r\n\r\nIn 1508, despite strong advice to the contrary, the powerful Pope Julius II commissioned Michelangelo to paint the ceiling of the newly restored Sistine Chapel. With little experience as a painter (though famed for his sculpture David), Michelangelo was reluctant to begin the massive project. \r\n\r\nMichelangelo and the Pope's Ceiling recounts the four extraordinary years Michelangelo spent laboring over the vast ceiling while the power politics and personal rivalries that abounded in Rome swirled around him. Battling against ill health, financial difficulties, domestic problems, the pope's impatience, and a bitter rivalry with the brilliant young painter Raphael, Michelangelo created scenes so beautiful that they are considered one of the greatest masterpieces of all time. A panorama of illustrious figures converged around the creation of this great work-from the great Dutch scholar Desiderius Erasmus to the young Martin Luther-and Ross King skillfully weaves them through his compelling historical narrative, offering uncommon insight into the intersection of art and history","torrent":{"xt":"urn:btih:ead10109cc20ee75e7a3b0cdb99a326d3650fa16","amp;dn":"Michelangelo+and+The+Pope%27s+Ceiling","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ead10109cc20ee75e7a3b0cdb99a326d3650fa16","infoHashBuffer":{"type":"Buffer","data":[234,209,1,9,204,32,238,117,231,163,176,205,185,154,50,109,54,80,250,22]},"announce":[],"urlList":[]}}