{"title":"Prepper Guns (2016) (Epub) Gooner","uid":16006122,"size":52002236,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ebc5bc3382a46b4bd1fbd72280816dbedfc00e23&amp;dn=Prepper+Guns+%282016%29+%28Epub%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":58,"leechers":4,"uploader":"GoonerTPB","files":2,"time":1476185100,"description":"Prepper Guns - Firearms, Ammo, Tools and Techniques You Will Need to Survive the Coming Collapse (2016) (Epub) Gooner\r\n\r\nPublisher: Skyhorse Publishing (21 April 2016)\r\nLanguage: English\r\nISBN-10: 1634505875\r\nISBN-13: 978-1634505871\r\n\r\nFood, water, and shelter are very important to survival. But you must also be ready to protect what is yours, because if somebody stronger, better prepared, and better equipped takes it all away, you will die. Your family will die. The only way to protect them is with firearms. Written with the law-abiding civilian in mind, Prepper Guns covers the firearms and tools needed to survive, not only for defense, but also for foraging. It is a comprehensive look at the realities of the firearms a prepper should have. Written by Bryce M. Towsley, a firearms expert and a full-time gun writer with thirty years of experience, it steps away from the &quot;conventional wisdom&quot; that is often spouted by prepper publishing and takes a hard, honest, look at the reality of the firearms, ammo, tools and training needed to survive at home and on the road. Prepper Guns takes a careful look at each category of firearms, ammo, sights, and accessories. Other topics include gun care and maintenance, as well as some simple gunsmithing and reloading to keep firearms repaired and ammo on hand. Finally, Prepper Guns has training suggestions and drills, plus a look at the psychology of survival, using the expertise of some of the top people in the world in these fields. If you are worried that bad things are coming and are trying to prepare, this book is the most important piece of gear you can buy. Because if you can't protect your family, your food and your home, nothing else really matters","torrent":{"xt":"urn:btih:ebc5bc3382a46b4bd1fbd72280816dbedfc00e23","amp;dn":"Prepper+Guns+%282016%29+%28Epub%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebc5bc3382a46b4bd1fbd72280816dbedfc00e23","infoHashBuffer":{"type":"Buffer","data":[235,197,188,51,130,164,107,75,209,251,215,34,128,129,109,190,223,192,14,35]},"announce":[],"urlList":[]}}