{"title":"Chief Architect Premier X8 18.1.1.4 (x64) Incl Patch + Portable","uid":13836257,"size":460018205,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:eda5ff8f329093f42d8335a563c0e06b1f799f26&amp;dn=Chief+Architect+Premier+X8+18.1.1.4+%28x64%29+Incl+Patch+%2B+Portable&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":40,"leechers":0,"uploader":"SadeemPC","files":2,"time":1457761646,"description":"Chief Architect Premier X8 18.1.1.4 (x64)\r\n\r\nFor all aspects of residential and light commercial design. As you draw walls and place smart architectural objects like doors and windows, the program creates a 3D model, generates a Materials List, and with the use of powerful building tools, helps produce Construction Documents with Site Plans, Framing Plans, Section Details, and Elevations.\t\r\n\r\nDiscover the Power of Chief Architect\r\nChief Architect is 3D architectural software for residential and light commercial design. Discover why millions of people use Chief Architect as the home design software product of choice for 2D and 3D design.\r\n\r\nBuilding &amp; Design Tools\r\nUse powerful building and drafting tools to quickly create plans according to standard building practices and make the design process efficient and productive. Automatic and Manual Building tools allow you to create a variety of Roof styles, Stairs, Framing - both stick and truss, Schedules and Materials Lists for Cut, Buy and Estimating, Dimensioning, Cross-Sections, Elevations and CAD tools. \r\n\r\nKitchen, Bath &amp; Interior Design\r\nChief Architect uses smart design objects, such as cabinets, to quickly and easily create various styles, shapes and sizes. Chief Architect partners with specific manufacturers (cabinets, appliances, doors, windows, countertops and flooring) so that styles, finishes and other product-specific design details can be accurately drawn and rendered.\r\n\r\n3D Design and Modeling Tools\r\nAs you draw walls, the program automatically creates a 3D model and supports full 3D editing. With Chief Architect, you can design in any view for seamless and simultaneous editing between 2D &amp; 3D. Advanced rendering provides both Photo Realistic and Artistic styles such as Line Drawing and Watercolor. An extensive 3D Library of architectural objects and tools make it easy to detail and accessorize your designs so that styles, finishes and other product-specific design details can be accurately rendered. \r\n\r\nCAD Tools for Productivity &amp; Precision\r\nChief Architect has a powerful CAD software engine that includes tools for lines, polylines, splines, arcs and solids to produce objects that range from custom entry columns to a deck ledger detail. Quickly manipulate objects with multiple copy, align, reflect and replicate at specific intervals. A CAD-to-Walls tool imports AutoCAD® files and provides mapping for layers so you can quickly see the model in 3D. Draw custom CAD details, import as DWG/DXF/PDF, or choose from over 500 CAD details in the premium SSA catalog to overlay on your design.\r\n\r\nPlans Sets &amp; Construction Drawings\r\n3D renderings and virtual tours help you sell the project and construction drawings help you specify, permit and build. All views in your project - Floor Plans, Framing, Electrical, Section Details and Elevations have a user defined scale and link to a specific drawing that updates as your design changes. Layers control what displays for each of the drawing pages to help create professional detailed construction drawings.\r\n\r\nSite Planning, Terrain, Decks &amp; Landscaping\r\nCreate site plans for single or multiple lots. Import terrain survey data or create with the Terrain Modeling tools - terrain data can then be used for a 2D site plan or viewed in 3D to show the specific topology. Road, Sidewalk, Hill and Valley tools provide added detail. For Landscaping, there's over 4,000 plants with detailed information about each plant including integrated Hardiness Zone Maps. Define a North pointer and seasonal settings for shadow effects and overlays. Decking tools include automatic and manual deck framing; customize deck planking and materials.\r\n\r\nSystem Requirements:\r\n- Multi-Core Processor CPU\r\n- 2 GB of Memory (32 bit)\r\n- 4 GB of Memory (64 bit)\r\n\r\nVideo Card:\r\n- OpenGL 2.1 or higher\r\n- Dedicated Video Card with 512 MB memory, e.g., NVIDIA or ATI\r\n- — OR —\r\n- Integrated Graphics, e.g., Intel HD Graphics (driver needs to be 2014 or newer)\r\n- How can I tell what video card I have?\r\n- 5 GB of available hard disk space\r\n- Internet Access *\r\n\r\nWhat's New in Chief Architect Premier X8 \nhttps://www.chiefarchitect.com/products/upgrade.html","torrent":{"xt":"urn:btih:eda5ff8f329093f42d8335a563c0e06b1f799f26","amp;dn":"Chief+Architect+Premier+X8+18.1.1.4+%28x64%29+Incl+Patch+%2B+Portable","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eda5ff8f329093f42d8335a563c0e06b1f799f26","infoHashBuffer":{"type":"Buffer","data":[237,165,255,143,50,144,147,244,45,131,53,165,99,192,224,107,31,121,159,38]},"announce":[],"urlList":[]}}