{"title":"The Beatles - Abbey Road [320k MP3]","uid":7714606,"size":115470755,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:eea2f846ea8f23d774a28136265da1e1508cf8c7&amp;dn=The+Beatles+-+Abbey+Road+%5B320k+MP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":42,"leechers":3,"uploader":"smbdownload","files":-1,"time":1349895569,"description":"Abbey Road is the 11th studio album released by the English rock band The Beatles. It is their last recorded album, although Let It Be was the last album released before the band's dissolution in 1970. Work on Abbey Road began in April 1969, and the album was released on 26 September 1969 in the United Kingdom, and 1 October 1969 in the United States.\n\nAbbey Road is widely regarded as one of The Beatles' most tightly constructed albums, although the band was barely operating as a functioning unit at the time. Despite the tensions within the band, Abbey Road was released to near universal acclaim and is considered to be one of the greatest albums of all time. In 2012, Abbey Road was voted 14th on Rolling Stone magazine's list of the &quot;500 Greatest Albums of All Time&quot;. In 2009, readers of the magazine also named Abbey Road the greatest Beatles album\n\nAbbey Road, The Beatles (partially) and Let It Be were the only Beatles albums to be recorded on professional eight-track reel to reel tape machines, rather than the four-track machines that were used for prior Beatles albums starting with the single &quot;I Want to Hold Your Hand&quot; in 1963 and the album A Hard Day's Night in 1964. EMI's management had not approved the use of their then-new 3M eight-track deck until shortly after the sessions for their 1968 single &quot;Hey Jude&quot;. Also, the Moog is prominently featured, not merely as a background effect, but sometimes playing a central role, as in &quot;Because&quot; where it is used for the middle 8. It is also prominent on &quot;Maxwell's Silver Hammer&quot; (played using a ribbon strip) and &quot;Here Comes the Sun&quot;. The instrument was introduced to the band by Harrison who, earlier in 1969, had used one to create his Electronic Sound album.\n\nAbbey Road was also the first and only Beatles album to be entirely recorded through a solid state transistor mixing desk as opposed to thermionic valve.\n\n2009 REMASTER - Track Listing [320k MP3]\n\n01. \t&quot;Come Together&quot;   \n02. \t&quot;Something&quot; \n03. \t&quot;Maxwell's Silver Hammer&quot;  \n04. \t&quot;Oh! Darling&quot;   \t\n05. \t&quot;Octopus's Garden&quot; \n06. \t&quot;I Want You (She's So Heavy)&quot;   \t\n07. \t&quot;Here Comes the Sun&quot; (Harrison) \n08. \t&quot;Because&quot;   \t\n09. \t&quot;You Never Give Me Your Money&quot;   \t\n10. \t&quot;Sun King&quot;   \t\n11. \t&quot;Mean Mr. Mustard&quot;   \t\n12. \t&quot;Polythene Pam&quot;   \t\n13. \t&quot;She Came In Through the Bathroom Window&quot;   \n14. \t&quot;Golden Slumbers&quot;   \t\n15. \t&quot;Carry That Weight&quot;   \t\t\n16. \t&quot;The End&quot;   \t\n07. \t&quot;Her Majesty&quot;   \t","torrent":{"xt":"urn:btih:eea2f846ea8f23d774a28136265da1e1508cf8c7","amp;dn":"The+Beatles+-+Abbey+Road+%5B320k+MP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eea2f846ea8f23d774a28136265da1e1508cf8c7","infoHashBuffer":{"type":"Buffer","data":[238,162,248,70,234,143,35,215,116,162,129,54,38,93,161,225,80,140,248,199]},"announce":[],"urlList":[]}}