{"title":"The Best of Instructables Volume I - Do-It-Yourself Projects","uid":10383885,"size":86878034,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f06a8cb81a92c95016380a6bf6bdddf1f804e7ea&amp;dn=The+Best+of+Instructables+Volume+I+-+Do-It-Yourself+Projects&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":37,"leechers":2,"uploader":"svdinesh","files":2,"time":1403112970,"description":"In just three years, Instructables.com has become one of the hottest destinations for makers and DIY enthusiasts of all stripes. Known as &quot;the world's biggest show &amp; tell,&quot; makers from around the globe post how-to articles on a staggering variety of topics -- from collecting rainwater for lawn care to hacking toy robots to extracting squid ink. \n\nNow, with more than 10,000 articles, the Instructables staff and editors of MAKE: magazine -- with help from the Instructables community -- have put together a collection of solid, time- and user-tested technology and craft projects from the site. The Best of Instructables Volume 1 includes plenty of clear, full-color photographs, complete step-by-step instructions, as well as tips, tricks, and new build techniques you won't find anywhere else -- even material never seen before on Instructables.\n\nSome of the more popular how-to articles include:\n\n*The LED Throwie -- magnetized electronic graffiti that's become a phenomenon\n*How to craft beautiful Japanese bento box lunches\n*Innovative gaming hacks, such as how to add LED lights and custom-molded buttons to a video game controller\n*New twists on personal items, such as the Keyboard Wallet, the Electric Umbrella, and stuffed animal headphones\n\nWhile the book focuses on technology, it also includes such projects as creating cool furniture from cheap components, ways of making your own toys, and killer sci-fi and fantasy costumes and props. Anything but a reference book, The Best of Instructables Volume I embodies the inspirational fun, creativity, and sense of community that has attracted more than 200,000 registered members in just three years. Many of the articles include sidebars that show how other builders have realized or improved upon the same project.\n\nMaking things is cool again: everyone wants to be a creator, not just a consumer. This is the spirit of the &quot;new handy heyday&quot;, fostered by Instructables.com, MAKE: magazine, and others, and celebrated by this incredible book -- The Best of Instructables Volume 1.\n\nThe Best of Instructables Volume I: Do-It-Yourself Projects from the World's Biggest Show &amp; Tell\nBook Language: English\nPages: 328\nFile Type: Pdf\nFile Size: 82.7 MB\n\n[IMG]http://i.imgur.com/xiTXUpE.jpg[/IMG]\n &lt;a href=&quot;\nhttp://i.imgur.com/xiTXUpE.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/xiTXUpE.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:f06a8cb81a92c95016380a6bf6bdddf1f804e7ea","amp;dn":"The+Best+of+Instructables+Volume+I+-+Do-It-Yourself+Projects","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f06a8cb81a92c95016380a6bf6bdddf1f804e7ea","infoHashBuffer":{"type":"Buffer","data":[240,106,140,184,26,146,201,80,22,56,10,107,246,189,221,241,248,4,231,234]},"announce":[],"urlList":[]}}