{
  "title": "Maps: Their Untold Stories",
  "uid": 15890751,
  "size": 228130980,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:f17d7db4b11950969aeb718e2cd488c9e37cd5fe&amp;dn=Maps%3A+Their+Untold+Stories&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 73,
  "leechers": 5,
  "uploader": "marty14",
  "files": 1,
  "time": 1474737895,
  "description": "Maps: Their Untold Stories - Rose Mitchell, Andrew Janes [epub]\r\n\r\nA map is a snapshot of a place, a city, a nation or even the world at a given point in time-fascinating for what they tell us about the way our ancestors saw themselves, their neighbours and their place in the world. This magnificent collection, drawn from seven centuries of maps held in the National Archives at Kew, looks at a variety of maps, from those found in 14th Century manuscripts, through early estate maps, to sea charts, maps used in military campaigns, and maps from treaties.\r\n\r\nThe text explores who the mapmakers were, the purposes for which the maps were made, and what it tells us about the politics of the time. Great images are accompanied by compelling stories. Featured is a woodcut map of 16th Century London, a map of where the bombs fell during the Second World War, and a map the first American settlers drew when they were attempting to establish a new empire on Roanoke Island, off the coast of what is now North Carolina.\r\n\r\nRichly illustrated with large scale reproductions of the maps, the book also includes some of the more amusing or esoteric maps from the National Archives, such as the map of the Great Exhibition in 1851 that was presented on a lady's glove, a London Underground map in the form of a cucumber, and a Treasure Island map used to advertise National Savings.\r\n\r\nThis is a fascinating and unusual journey through the world of maps and mapmakers",
  "parsed": {
    "xt": "urn:btih:f17d7db4b11950969aeb718e2cd488c9e37cd5fe",
    "dn": "Maps: Their Untold Stories",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "f17d7db4b11950969aeb718e2cd488c9e37cd5fe",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        241,
        125,
        125,
        180,
        177,
        25,
        80,
        150,
        154,
        235,
        113,
        142,
        44,
        212,
        136,
        201,
        227,
        124,
        213,
        254
      ]
    },
    "name": "Maps: Their Untold Stories",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 78,
  "peers": 11,
  "last_updated": "2016-12-25T17:51:12.581Z"
}