{"title":"POSTAL 2 Paradise Lost-SKIDROW","uid":11832078,"size":4251172706,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f22670ccf9d9ca753d9e6774074b2d6cfc742557&amp;dn=POSTAL+2+Paradise+Lost-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":81,"leechers":9,"uploader":"Ggamer1","files":3,"time":1429631563,"description":"\nproudly presents\nPOSTAL 2: Paradise Lost (c) Running With Scissors\n\n17-04-2015......Release Date &lt;-&gt; Protection.................Steam\nAction/FPS.........Game Type &lt;-&gt; Disk(s)....................1 DVD\n\nRELEASE NOTES\n\nTen years after his Apocalypse Weekend escapades, The Postal Dude\nfinally returns!\n\nParadise Lost is a full-fledged expansion pack for POSTAL 2 continuing\nthe saga of the POSTAL series. Join the Dude as he ventures back into\nhis former hometown embarking on a quest to find his lost dog. Not all\nis at it seems, as the once tranquil (relatively speaking) town and its\ncitizens have been transformed in the wake of the nuclear destruction\nDare to enter the varied Zones as you cross the Arid Desert, trek\nthrough the dense Rainy Foliage, freeze your nuts off in the Nuclear\nWinter, and roam under the Ashen Skies. Meet the many mysterious\nfactions comprised of the towering, the miniature, the zombified, and\neverything in between and use your radiant people skills to attempt to\nally yourself with their enigmatic leaders, ranging from former child\nstars to terrifying demonic udder-wielding beasts! Fierce Lawmen\ncrazed Bandits, deranged Doomsday Survivalists, and a phallic child's\ntoy mascot await. Do whatever it takes to survive! Wait in lines! Use\nvending machines! Buy toilet paper! Journey to where it all began to\nrescue your loyal companion!\n\nPrepare to delve into the post-apocalyptic world of Paradise Lost!\n\nFeatures:\n\nA complete singleplayer campaign: Brave Monday through Friday with\ntwists and turns each day\n\nFree roam, non-linear, errand-based gameplay: Go do your daily chores\nor just screw around as you aimlessly run amok in the town!\n\nPeaceful vs. Violent decisions: Choose to be a wussy pacifist or wipe\nout everyone in your way. Hey, it's the apocalypse, so you'll probably\nfit in!\n\nNew arsenal and items: Take out some unlucky punks with the Revolver!\nEnact wasteland justice with the Lever-Action Shotgun! Whack some weeds\nand perhaps other meatier subjects with the Weed Whacker!\n\nDual-wielding: Double your fun with double the gun!\nBoss battles: Settle some scores once and for all mano a mano\n\nFull controller support: Piss on strangers from the comfort of your\ncouch!\n\nThe Dude's original voice: No bogus imposters here!\nNOTE: this game is standalone and includes original updated POSTAL 2\ntoo\n\nINSTALL NOTES\n\n1. Unpack the release\n2. Mount or burn image\n3. Install\n4. Copy everything from the SKIDROW folder into the game installation\n5. Block the game in your firewall and mark our cracked content as\nsecure/trusted in your antivirus program\n6. Play the game\n7. Support the companies, which software you actually enjoy!","torrent":{"xt":"urn:btih:f22670ccf9d9ca753d9e6774074b2d6cfc742557","amp;dn":"POSTAL+2+Paradise+Lost-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f22670ccf9d9ca753d9e6774074b2d6cfc742557","infoHashBuffer":{"type":"Buffer","data":[242,38,112,204,249,217,202,117,61,158,103,116,7,75,45,108,252,116,37,87]},"announce":[],"urlList":[]}}