{
  "title": "Lana Del Rey.2014.ULTRAVIOLENCE.(Deluxe Edition).[Mp3].320Kbps.-",
  "uid": 10431719,
  "size": 161513350,
  "categoryP": "audio",
  "categoryS": "other",
  "magnet": "?xt=urn:btih:f23a22200f5eedb793077800b842acf2693f2c5c&amp;dn=Lana+Del+Rey.2014.ULTRAVIOLENCE.%28Deluxe+Edition%29.%5BMp3%5D.320Kbps.-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 49,
  "leechers": 9,
  "uploader": "URBiN4HD",
  "files": -1,
  "time": 1403807310,
  "description": "\n\n\nLana Del Rey - ULTRAVIOLENCE (2014)\n\n\n\nIf ever in need for a definition for musical marmite, look no further than Miss Del Ray. Her fans shout from the rooftops about her uniqueness, the total lack of wanting to be a pop-princess, and her sound being a call back to a different time, if not a different world entirely. Her detractors cry out about her cultivated image, the fact that she is all gloss and no talent, and that all of her songs sound the same. So let's put this to rest right now: you're both right. Happy? Okay, now on to the music.\n\nDel Ray is stuck in a loop of singing about zonked out relationships, almost literally crazy-in-love, but nobody else has a way with drawled out longing quite like she does, either. Even her biggest haterz can't take away from the fact that &quot;Ride&quot;, &quot;Summertime Sadness&quot; and &quot;Blue Jeans&quot; were fantastically constructed, absolutely hypnotic off-kilter pop songs. The downside with Ultraviolence, both for fans and non-fans alike, is that nothing on here quite hits those dizzy heights. The upside is that there are also far fewer duds, and not everything is about a hippy dippy chick hazily exhaling her way through a David Lynch soundtrack.\n\nLead single &quot;West Coast&quot; is the closest you'll find to that Del Ray high, as she barely summons the energy during the verse, before the switching it up for some back-seat loving during the chorus. Whether intentional or not, that highly sexualised approach imbues most of the album's highlights, including the nasty, side-eye glaring &quot;Fucked My Way Up To The Top&quot;, where Del Ray takes pot shots at another female starlet who made fun of her image, only to steal it and subsequently achieve fame due to it. Then there's aching longing in &quot;Shades Of Cool&quot;, which starts out reminiscent of some long forgotten James Bond theme song, before going all The Little Mermaid over the wah-wahing guitar-led chorus.\n\nPerhaps thanks to the more focussed production work - The Black Keys' front man Dan Auerbach oversees eight of the eleven songs - there is more of a cohesive feel than there was in Born To Die, and less likely to get repetitive over the subject matter, but of course it wouldn't be a Lana Del Ray album if she wasn't getting a little weird about the men (and women) in her life. &quot;Brooklyn Baby&quot; was written as an ode to Lou Reed as he died on the day they were due to work together, is a song of mild obsession with her downtown hipster lover and a woman defining herself by the man in her life. &quot;Sad Girl&quot; and &quot;The Other Woman&quot; both deal with infidelity, with Del Ray singing from both within and outside of the relationship on either song.\n\nThere's very little on here that you might hear on any Top 40 radio chart, with Del Ray focusing and reigning in the sound she was still developing on Born To Die, and letting it loose here. Album opener &quot;Cruel World&quot; clocks in at nearly seven minutes, switching up her vocal delivery every few verses, swearing blind here and there, and remaining to sound very much like Lana and very little like anything else out there right now. It's a good measure for the rest of Ultraviolence; an album of singular vision, but due to inspire a prism of reactions.\n\n\n\nGeneral\nFormat                                   : MPEG Audio\nFile size                                : 153 MiB\nDuration                                 : 1h 5mn 31s\nOverall bit rate mode                    : Constant\nOverall bit rate                         : 320 Kbps\nAlbum                                    : Ultraviolence\nAlbum/Performer                          : Lana Del Rey\nPart/Total                               : 1\nTrack name/Total                         : 14\nGrouping                                 : Adult Alternative PopRock/AlternativeIndie Rock\nPerformer                                : Lana Del Rey\nComposer                                 : Rick Nowels/Lana Del Rey\nEncoded by                               : Callixtus\nPublisher                                : Polydor\nGenre                                    : Pop/Rock\nRecorded date                            : 2014\nWriting library                          : LAME3.98r\nCopyright                                : Callixtus\nCover                                    : Yes\nCover type                               : Cover (front)\nCover MIME                               : image/jpeg\nEncoder                                  : Callixtus\n\nAudio\nFormat                                   : MPEG Audio\nFormat version                           : Version 1\nFormat profile                           : Layer 3\nMode                                     : Joint stereo\nMode extension                           : MS Stereo\nDuration                                 : 1h 5mn 31s\nBit rate mode                            : Constant\nBit rate                                 : 320 Kbps\nChannel(s)                               : 2 channels\nSampling rate                            : 44.1 KHz\nCompression mode                         : Lossy\n\n\n\n1 Cruel World\n2 Ultraviolence\n3 Shades of Cool\n4 Brooklyn Baby\n5 West Coast\n6 Sad Girl\n7 Pretty When You Cry\n8 Money Power Glory\n9 Fucked My Way Up to the Top\n10 Old Money\n11 The Other Woman\n12 Black Beauty\n13 Guns and Roses \n14 Florida Kilos\n\n\n",
  "parsed": {
    "xt": "urn:btih:f23a22200f5eedb793077800b842acf2693f2c5c",
    "dn": "Lana Del Rey.2014.ULTRAVIOLENCE.(Deluxe Edition).[Mp3].320Kbps.-",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "f23a22200f5eedb793077800b842acf2693f2c5c",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        242,
        58,
        34,
        32,
        15,
        94,
        237,
        183,
        147,
        7,
        120,
        0,
        184,
        66,
        172,
        242,
        105,
        63,
        44,
        92
      ]
    },
    "name": "Lana Del Rey.2014.ULTRAVIOLENCE.(Deluxe Edition).[Mp3].320Kbps.-",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 58,
  "peers": 12,
  "last_updated": "2016-12-25T17:54:59.236Z"
}