{
  "title": "UDEMY THE COMPLETE PYTHON WEB COURSE LEARN BY BUILDING 8 WEB APP",
  "uid": 12797327,
  "size": 941438060,
  "categoryP": "other",
  "categoryS": "other",
  "magnet": "?xt=urn:btih:f381f913d2b9900cd1c51b01f143d14ffc6486d3&amp;dn=UDEMY+THE+COMPLETE+PYTHON+WEB+COURSE+LEARN+BY+BUILDING+8+WEB+APP&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 47,
  "leechers": 8,
  "uploader": "BarCraft",
  "files": 54,
  "time": 1447990454,
  "description": "This is a new course which got released under a week\r\nago! Because of this, it is at a substantially\r\nlower price until the 1st of December. After, it\r\nwill go up to $199\r\n\r\nThe Complete Python Web Developer Course will lead\r\nyou down a path of understanding and skill that may\r\nwell, with work and patience, result in an income boost or a\r\ncareer change\r\n\r\nIt is a one-stop-shop covering everything you need to start having\r\nideas and creating web applications that engage visitors and\r\nprovide them with value. In addition, I ll always be available\r\nto help you further your learning and explore more avenues for\r\nsuccess\r\n\r\nWhat do you have to do?\r\n\r\nYou ll have immediate access to 8 carefully\r\ndesigned sections, each teaching and guiding you\r\ninto creating a web application: your challenge\r\nI ve created thorough, extensive but easy to\r\nfollow content which you ll easily understand and\r\nabsorb\r\n\r\nI recommend taking your time, as software development doesn t\r\nhappen overnight. Each section should take approximately one\r\nweek, including developing the weekly challenge, reading\r\naround the subject, and practising further\r\n\r\n* The course starts with the basics, including Python\r\nfundamentals, programming, and user interaction\r\n* Then we will move onto how the internet works\r\nmaking web requests and parsing webpages to get\r\ndata from them\r\n* Now that you ll have all the knowledge\r\nrequired, we ll introduce our database of choice\r\nMongoDB, and then proceed into creating our first\r\nweb application: a blog where users can register and\r\npublish\r\n* Then we will create a fantastic application to notify you when\r\nprices of items in online stores go down; a really useful app!\r\n* After, we will be creating a more complex application using\r\neverything we know, to allow teachers and students to\r\nregister, create courses, send notifications, and interact with\r\none another\r\n* Finally, we will explore creating a social network, the\r\nchallenges it presents, and how we could solve\r\nthem\r\n\r\nDuring all this, we ll be learning about deploying\r\nour application, making it performing so it can\r\nscale to thousands of users, and usability and\r\nsecurity issues\r\n\r\nOver the entire course you will learn:\r\n\r\n* Python\r\n* HTML\r\n* CSS\r\n* Responsive Design with Bootstrap\r\n* JavaScript\r\n* jQuery\r\n* MongoDB\r\n* Linux (UNIX)\r\n* APIs (both creating them and interacting with\r\nthem)\r\n* Deployments to Heroku and DigitalOcean\r\n\r\nWhat else will you get?\r\n\r\n* A friendly community to support you at all times\r\n* Personal contact with me: I m always available to answer\r\nquestions and help out\r\n* Lifetime access to course materials, even as more are released\r\n* Hands-on learning to ensure you re absorbing everything\r\n* A true understanding of the concepts of software development\r\ndesign, and operations\r\n\r\nBy the time you re done with the course you ll\r\nhave a fantastic set of fundamentals that will allow\r\nyou to easily continue learning and developing\r\nmore and more advanced and engaging web\r\napplications\r\n\r\nIt doesn t matter how old you are or what you do\r\nprofessionally. I guarantee that ANYONE can benefit\r\nfrom learning development, but especially web application\r\ndevelopment\r\n\r\nSo what are you waiting for? Sign up now, and I ll see you on\r\nthe inside!",
  "parsed": {
    "xt": "urn:btih:f381f913d2b9900cd1c51b01f143d14ffc6486d3",
    "dn": "UDEMY THE COMPLETE PYTHON WEB COURSE LEARN BY BUILDING 8 WEB APP",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "f381f913d2b9900cd1c51b01f143d14ffc6486d3",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        243,
        129,
        249,
        19,
        210,
        185,
        144,
        12,
        209,
        197,
        27,
        1,
        241,
        67,
        209,
        79,
        252,
        100,
        134,
        211
      ]
    },
    "name": "UDEMY THE COMPLETE PYTHON WEB COURSE LEARN BY BUILDING 8 WEB APP",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 55,
  "peers": 0,
  "last_updated": "2016-12-25T18:01:50.630Z"
}