{
  "title": "Yes Please - Amy Poehler - Audiobook MP3",
  "uid": 11322759,
  "size": 220641397,
  "categoryP": "audio",
  "categoryS": "audio_books",
  "magnet": "?xt=urn:btih:f5bf7eda1cee510f997fe7ee7093d81bdd97831c&amp;dn=Yes+Please+-+Amy+Poehler+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 95,
  "leechers": 4,
  "uploader": "Squiddy82",
  "files": -1,
  "time": 1414611386,
  "description": "MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nYes Please\n\nWritten by: Amy Poehler\nNarrated by: Amy Poehler, Carol Burnett, Seth Meyers, Mike Schur, Eileen Poehler, William Poehler, Patrick Stewart, Kathleen Turner\nLength: 7 hrs and 31 mins\nUnabridged Audiobook\nRelease Date:10-29-14\n\nAmy Poehler is hosting a dinner party and you're invited! Welcome to the audiobook edition of Amy Poehler's Yes Please. The guest list is star-studded with vocal appearances from Carol Burnett, Seth Meyers, Michael Schur, Patrick Stewart, Kathleen Turner, and even Amy's parents - Yes Please is the ultimate audiobook extravaganza.\n\nAlso included? A one-night-only live performance at Poehler's Upright Citizens Brigade Theater. Hear Amy read a chapter live in front of a young and attractive Los Angeles audience.\n\nWhile listening to Yes Please, you'll laugh, you'll cry, and you'll become convinced that your phone is trying to kill you. Don't miss this collection of stories, thoughts, ideas, lists, and haikus from the mind of one of our most beloved entertainers. Offering Amy's thoughts on everything from her &quot;too safe&quot; childhood outside of Boston to her early days in New York City, her ideas about Hollywood and &quot;the biz&quot;, the demon that looks back at all of us in the mirror, and her joy at being told she has a &quot;face for wigs&quot; - Yes Please is chock-full of words, and wisdom, to live by",
  "parsed": {
    "xt": "urn:btih:f5bf7eda1cee510f997fe7ee7093d81bdd97831c",
    "dn": "Yes Please - Amy Poehler - Audiobook MP3",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "f5bf7eda1cee510f997fe7ee7093d81bdd97831c",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        245,
        191,
        126,
        218,
        28,
        238,
        81,
        15,
        153,
        127,
        231,
        238,
        112,
        147,
        216,
        27,
        221,
        151,
        131,
        28
      ]
    },
    "name": "Yes Please - Amy Poehler - Audiobook MP3",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 99,
  "peers": 29,
  "last_updated": "2016-12-25T18:15:14.214Z"
}