{
  "title": "Oriental Empires (Early Access)",
  "uid": 15869537,
  "size": 513552749,
  "categoryP": "games",
  "categoryS": "pc",
  "magnet": "?xt=urn:btih:f62f509a7a2953b7685f9e7949d2cfffbdf416e4&amp;dn=Oriental+Empires+%28Early+Access%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 45,
  "leechers": 5,
  "uploader": "dauphong",
  "files": 1,
  "time": 1474412353,
  "description": "\nAbout This Game\r\nStep into the world of the ancient Orient. Control a city or tribe from the dawn of Chinese history, and turn it into a great empire. Develop your land, create great cities, raise huge armies and fight epic wars. Advance your technology, culture and religion to create one of mankind’s great civilizations. All the action takes place on one spectacular game map that brings to life the mountains, forests, plains and deserts of China. Zoom in close to review your troops and see your peasants toiling, or zoom out for a strategic overview. Plan your battles, end your turn, and then watch as your armies obey your orders, with hundreds of soldiers battling right on the game map.\r\n\r\nFEATURES\r\n\r\n    Start out as a single nation or tribe, starting from humble beginnings with a single settlement and expand your empire and develop your culture with the aim of becoming the universally recognized Son of Heaven and ruler of the world.\r\n    Persuade the other factions to recognize you as such by either military force, or by diplomatic persuasion.\r\n    Play as one of 16 different factions each with their own special bonuses or penalties.\r\n    Vast beautifully rendered map featuring an attractive and authentic depiction of the landscape of China and Mongolia.\r\n    Large scale battles with hundreds or thousands of soldiers, depicted in detail right on the game map. Watch skilled armies and reinforcements go to battle, according to the battle orders and formations set by the player.\r\n    Fully animated 3D models, with variations in face and clothing for each model, including infantry, cavalry, chariot and artillery units, as well as naval forces.\r\n    Long seamless zoom range lets you step right into the game world or zoom out for a strategic overview.\r\n    Develop your settlements by constructing buildings and developing the landscape around them, build markets and ports to enable trade by land and water.\r\n    Elaborate research tree including technology as well as cultural, philosophical and religious developments.\r\n    Many other elements will determine the outcome of you quest for dominance such as Leaders, Sieges, Unrest and Rebellion, and Authority and Culture ratings.\r\n    As Emperor, set edicts, laws and decrees to balance power and move into a glorious new Era, with new technologies and military units that change the game!",
  "parsed": {
    "xt": "urn:btih:f62f509a7a2953b7685f9e7949d2cfffbdf416e4",
    "dn": "Oriental Empires (Early Access)",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "infoHash": "f62f509a7a2953b7685f9e7949d2cfffbdf416e4",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        246,
        47,
        80,
        154,
        122,
        41,
        83,
        183,
        104,
        95,
        158,
        121,
        73,
        210,
        207,
        255,
        189,
        244,
        22,
        228
      ]
    },
    "name": "Oriental Empires (Early Access)",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.leechers-paradise.org:6969",
      "udp://zer0day.ch:1337"
    ],
    "urlList": []
  },
  "previous": 50,
  "peers": 56,
  "last_updated": "2016-12-25T18:17:48.645Z"
}