{"title":"We Happy Few (GOG)","uid":15410850,"size":3668851771,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f68aeb7ef48a1fa91aa925ca4700beb1018d3dd6&amp;dn=We+Happy+Few+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":225,"leechers":10,"uploader":"mercs215","files":4,"time":1469554133,"description":"Install instructions:\r\nTHIS GAME IS CURRENTLY IN DEVELOPMENT\r\n- Run &quot;setup_we_happy_few_2.0.0.2.exe&quot;\r\n- Play\r\nPLEASE REMEMBER TO SEED, MANY OTHERS WANT THIS! :)\r\nIf you like this game, support the developers and BUY IT!\r\n\r\nTitle: WE HAPPY FEW\r\nGenre: Adventure - Action - Survival\r\nWorks on: Windows (7, 8, 10)\r\nLanguages: Audio and text: English. Text only: français\r\nFeatures: single-player - in development\r\nSize: 3.5 GB\r\nCompany: Compulsion Games / Compulsion Games\r\nStore page: https://www.gog.com/game/we_happy_few\r\n\r\nAbout:\r\nWe Happy Few is the tale of a plucky bunch of moderately terrible people trying to escape from a lifetime of cheerful denial in the city of Wellington Wells. Set in a drug-fuelled, retrofuturistic city in an alternative 1960s England, you’ll have to blend in with its other inhabitants, who don’t take kindly to people who don’t abide by their not-so-normal rules.\r\n1960s Dystopian England \r\nSet in a retrofuturistic 1960s, you will find a city ravaged by war and rebuilt by delusionally happy people. Everything appears to be happy in Wellington Wells, including the roads, the people, and its omnipresent television personality, Uncle Jack! However, it’s a beautiful world on the brink of collapse. You will discover the history of this world, and how it came to be just so beguilingly happy.\r\nSuspicion and Joy \r\nWe Happy Few is about surviving in and escaping from a procedurally generated world, where you must learn to hide in plain sight. If you act out of turn, or you’re not on Joy (the local happy pills), the locals will become suspicious and will rapidly turn your frown upside down! Forcefully. You will need to practice conformity, stealth and combat if you want to survive long enough to escape.\r\nA Mature Story \r\nWe Happy Few’s characters are not typical video game heroes. They are flawed and not particularly heroic, warped by the trauma their world has been through. Each character has their own storyline that reacts to the events of the world around them, and their place within it. Our stories are definitely not appropriate for children, but are laced with dark humour, hope, and even a spot of redemption.\r\nIn We Happy Few, you will experience: \r\n- a procedurally generated world, meaning that everyone’s experience will be unique,\r\n- a range of difficulties for new and experienced players alike, permadeath, if you want to satisfy all your masochistic needs\r\n- three modes: sandbox, story and Wellie mode\r\n- a unique soundtrack, and\r\n- a fully voiced, cinematic, first person story\r\nAnd you can play it in your own style: \r\n- fill your basic needs (hunger, thirst, and sleep) to survive,\r\n- learn how to interact with the other members of your society, and choose stealth, conformity or combat,\r\n- encounter dozens of in-game unique events,\r\n- conform to the specific local habits by learning to behave accordingly, and taking your Joy,\r\n- collect recipes, scavenge items and craft dozens of weapons, tools and devices,\r\n- fight with your bare hands or the crazy weapons you create,\r\n- watch out for traps, or learn how to use them to your advantage.\r\nNote: Not all of these features will be available during Games in Development! They will become available as we develop them, leading up to the full release of the game.\r\n\r\nMinimum system requirements - Windows: 7 (64-bit) or higher\r\nProcessor: Triple-core Intel or AMD, 2.0 GHz or faster\r\nMemory: 8 GB RAM\r\nGraphics: NVIDIA GeForce 460 GTX or AMD Radeon 5870 HD series or higher Mobile: NVIDIA GeForce GTX 580M or higher.\r\nDirectX: Version 11\r\nStorage: 6 GB available space \r\nMouse &amp; Keyboard\r\n\r\nRecommended system requirements - Windows: 7 (64-bit) or higher\r\nProcessor: Quad-core Intel or AMD, 2.5 GHz or faster\r\nMemory: 8 GB RAM\r\nGraphics: NVIDIA GeForce 660 GTX or AMD Radeon 7870 HD series or higher\r\nDirectX: Version 11\r\nStorage: 6 GB available space \r\nMouse &amp; Keyboard","torrent":{"xt":"urn:btih:f68aeb7ef48a1fa91aa925ca4700beb1018d3dd6","amp;dn":"We+Happy+Few+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f68aeb7ef48a1fa91aa925ca4700beb1018d3dd6","infoHashBuffer":{"type":"Buffer","data":[246,138,235,126,244,138,31,169,26,169,37,202,71,0,190,177,1,141,61,214]},"announce":[],"urlList":[]}}