{"title":"Medieval.2.Total.War-RELOADED","uid":3560529,"size":6937080577,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f73e00db00bdc30947d1776a56936403caf194ba&amp;dn=Medieval.2.Total.War-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":66,"leechers":20,"uploader":"Bernhard","files":144,"time":1163946797,"description":"Medieval II: Total War (c) Sega\n\n11/2006 :..... RELEASE.DATE .. PROTECTION .......: Safedisc\n2 :.......... DISC(S) .. GAME.TYPE ........: Strategy\n\nMedieval 2 is the latest and greatest game to be released in the best\nselling and award-winning Total War series. Set in the years 1080-1530 the\nmost turbulent period in European history, the game combines a vast, deep-\nthinking turn-based strategy campaign with the most cinematic, epic and\nbrutal real-time battles ever seen in the genre.\n\nA vastly enhanced version of the Total War engine vividly portrays the pure\nbloodlust of Medieval warfare with massive battles of more than 10,000 troops\nsplayed across new graphically rich environments. For the first time in the\nTotal War series each troop is an individual, garbed with the rich heraldic\ncolours and glinting arms and armour of the period.\n\nOn the battlefield theyll survey their surroundings for threats and\nincoming opponents and react accordingly. When engaged theyll string\ntogether a series of devastating moves as Medieval 2s new combat animation\nbrings the conflict to life like never before. Total War has never been so\nferocious or realistic.\n\nThe Medieval 2 grand campaign will hand you the reins of one of an emerging\nfaction as you set about sweeping throughout Europe, conquering all before\nyou. Expand your borders and develop your lands for wealth and prosperity by\nbuilding cities or swell your army by constructing vast castles to protect\nyour land and keep your rivals quaking with fear.\n\nUse Princesses for diplomatic gain, Priests to spread the influence of your\nreligious beliefs and Merchants to fill your coffers for your war effort.\nAll the time the Pope and the Papal States watch over the Christian world,\nassessing the strength of your faith and making demands to prove your\nloyalty. Do you cater to his whims and avoid excommunication or plot his\ndownfall and rig the papal elections to place your own Pope in power?\n\n1. Unrar.\n2. Burn or mount with Daemon tools.\n3. Install the game.\n4. When asked for serial enter S3U6-W8R9-D26N-X34L\n5. Copy the cracked files located in the Crack directory on DVD1 to your\ninstallation directory.\n6. Play the game.","torrent":{"xt":"urn:btih:f73e00db00bdc30947d1776a56936403caf194ba","amp;dn":"Medieval.2.Total.War-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f73e00db00bdc30947d1776a56936403caf194ba","infoHashBuffer":{"type":"Buffer","data":[247,62,0,219,0,189,195,9,71,209,119,106,86,147,100,3,202,241,148,186]},"announce":[],"urlList":[]}}