{
  "title": "Violent Python - A Cookbook for Hackers, Forensic Analysts, Pene",
  "uid": 7882887,
  "size": 8211835,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:f7bad5a8350350a7479a504555a3cc147032e7ff&amp;dn=Violent+Python+-+A+Cookbook+for+Hackers%2C+Forensic+Analysts%2C+Pene&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 54,
  "leechers": 0,
  "uploader": "NepsterJay",
  "files": 1,
  "time": 1354541375,
  "description": "[img]http://covers.booktopia.com.au/big/9781597499576/violent-python.jpg[/img]\n\n[b]Violent Python[/b] shows you how to move from a theoretical understanding of offensive computing concepts to a practical implementation. Instead of relying on another attacker's tools, this book will teach you to forge your own weapons using the Python programming language. This book demonstrates how to write Python scripts to automate large-scale network attacks, extract metadata, and investigate forensic artifacts. It also shows how to write code to intercept and analyze network traffic using Python, craft and spoof wireless frames to attack wireless and Bluetooth devices, and how to data-mine popular social media websites and evade modern anti-virus.\n\n- Demonstrates how to write Python scripts to automate large-scale network attacks, extract metadata, and investigate forensic artifacts.\n\n- Write code to intercept and analyze network traffic using Python. Craft and spoof wireless frames to attack wireless and Bluetooth devices.\n\n- Data-mine popular social media websites and evade modern anti-virus.\n\n\n[b]Review[/b]\n&quot;When it comes to Python and penetration testing, TJ O'Connor is the grand Python master. This is the book that keeps on giving. From building penetration testing Python scripts, to antivirus-evading penetration testing malware, to interrogating the Windows Registry and investigating other forensic artifacts...O'Connor masterfully walks the reader from basic to advanced penetration testing techniques with sample code throughout.&quot;\n\n-Ove Carroll, SANS Certified Instructor, Co-Author of SANS Forensics 408 - Windows In Depth\n\n&quot;Violent Python is chalked full of practical examples and is for all security professionals. It covers the spectrum - knowledge for pen testers to forensic analysts, beginner to advanced and offensive to defensive tasks. If you are involved in information security and are looking for a Python book, this is an excellent source.&quot;\n\n-James Shewmaker, Security Analyst, Bluenotch Corporation\n\n&quot;The best hackers know when to write their own tools. Violent Python is a very relevant collection of examples to seed your personal hacking toolbox. From offensive actions to digital forensics, this book has useful bits for everyone.&quot;\n\n-Raphael Mudge, Creator of Armitage\n\n[b]About the Author[/b]\nTJ O'Connor is a Department of Defense expert on information security and a US Army paratrooper. While assigned as an assistant professor at the US Military Academy, TJ taught undergraduate courses on forensics, exploitation and information assurance. He twice co-coached the winning team at the National Security Agency's annual Cyber Defense Exercise and won the National Defense University's first annual Cyber Challenge. He has served on multiple red teams, including twice on the Northeast Regional Team for the National Collegiate Cyber Defense Competition.\n\nTJ holds a Master of Science degree in Computer Science from North Carolina State, a Master of Science degree in Information Security Engineering from the SANS Technical Institute, and a Bachelor of Science degree in Computer Science from the US Military Academy. He has published technical research at USENIX workshops, ACM conferences, security conferences, the SANS Reading Room, the Internet Storm Center, the Army Magazine, and the Armed Forces Journal. He holds expert cyber security credentials, including the prestigious GIAC Security Expert (GSE) and Offensive Security Certified Expert (OSCE). TJ is a member of the elite SANS Red and Blue Team Cyber Guardians.\n\n[b]Product Details[/b]\nPaperback: 288 pages\nPublisher: Syngress; 1 edition (November 22, 2012)\nLanguage: English\nISBN-10: 1597499579\nISBN-13: 978-1597499576",
  "parsed": {
    "xt": "urn:btih:f7bad5a8350350a7479a504555a3cc147032e7ff",
    "dn": "Violent Python - A Cookbook for Hackers, Forensic Analysts, Pene",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "f7bad5a8350350a7479a504555a3cc147032e7ff",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        247,
        186,
        213,
        168,
        53,
        3,
        80,
        167,
        71,
        154,
        80,
        69,
        85,
        163,
        204,
        20,
        112,
        50,
        231,
        255
      ]
    },
    "name": "Violent Python - A Cookbook for Hackers, Forensic Analysts, Pene",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 54,
  "peers": 39,
  "last_updated": "2016-12-25T18:26:26.170Z"
}