{"title":"Michael Breen (Advanced NLP Skills) - Conversational Trance: How","uid":8546806,"size":110474794,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f8967bc638da7283eba029d4972cc482f4c36d17&amp;dn=Michael+Breen+%28Advanced+NLP+Skills%29+-+Conversational+Trance%3A+How&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":54,"leechers":2,"uploader":"yTSa6","files":-1,"time":1370544455,"description":" &lt;a href=&quot;http://www.nlptimes.com/SalesPages/Advanced_Language_Patterns.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.nlptimes.com/SalesPages/Advanced_Language_Patterns.php&lt;/a&gt;\n\nThis unique training is designed to teach you how to evoke trance conversationally, anytime, anywhere. Inside this training you will learn how most formal hypnotic processes and trainings are based around the ritual of &quot;eyes-closed&quot; processes. Yet you don't need to get someone to close their eyes or use a hypnotic voice tone in order to evoke trance!\n\nMichael has been teaching and training people in hypnotic processes for over 20 years and ran his first conversational trance workshop in 1989. He co-delivered trainings with celebrity hypnotist Paul McKenna for many years along with Dr. Richard Bandler and works extensively in business contexts where being able to use trance processes is highly desirable. Time and again he has taken NLP and Hypnotic processes and figured out how to make the work really well in everyday conversational contexts and now you can learn how to use trance too, for everyday purposes without needling to do &quot;formal&quot; hypnosis.\n\nThis is an ideal skill to have if you work with friends, family, NLP or hypnosis averse clients or need to get results in non therapeutic contexts such as coaching, training, managing etc.\n\n\n   And five masterfully edited tracks so you've got quick access to the information that is of most interest to you\n\nLearn the skills to master conversational trance today. When you master what is taught in this intensive training program you will be able to hook and hold people's attention, use trance as an everyday tool you use intentionally to create powerful results - from creating conversational change, being more persuasive or have a friend, family member or client act on the suggestions you put forward.\n\n","torrent":{"xt":"urn:btih:f8967bc638da7283eba029d4972cc482f4c36d17","amp;dn":"Michael+Breen+%28Advanced+NLP+Skills%29+-+Conversational+Trance%3A+How","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8967bc638da7283eba029d4972cc482f4c36d17","infoHashBuffer":{"type":"Buffer","data":[248,150,123,198,56,218,114,131,235,160,41,212,151,44,196,130,244,195,109,23]},"announce":[],"urlList":[]}}