{"title":"101 Dalmatians(1996)DVDRip.AC3(ENG)-DROCK","uid":6012222,"size":735059968,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fbb5062b57c5d0c2c809ae38508789d6942a0f4a&amp;dn=101+Dalmatians%281996%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":45,"leechers":1,"uploader":"drock232","files":-1,"time":1291501804,"description":"There are more puppies than you can shake a rolled up newspaper at in this live-action remake of the Disney animated favorite 101 Dalmatians. Roger (Jeff Daniels) is a designer of computer games who shares his home with his pet dalmatian, Pongo. One day, Roger takes Pongo for a walk in the park and the dog sets his eyes on a beautiful female dalmatian named Perdy. Perdy likes Pongo as much as he likes her, and thankfully Perdy\\\\\\'s mistress, a fashion designer named Anita (Joely Richardson), is quite taken with Roger. Romance blooms between the human and canine couples, and Roger and Anita tie the knot (Pongo and Perdy are apparently still living in sin). Anita works for Cruella De Vil (Glenn Close), an intense fashion maven whose lust for fur doubtless places her high on PETA\\\\\\'s hit list. Inspired by her dogs, Anita finds herself working up a design for a fur coat made with spotted fur, and Cruella leaps on the idea of making garments out of real dalmatians. But where to get the animals? Cruella has two nasty but not especially intelligent henchmen, Jasper (Hugh Laurie) and Horace (Mark Williams), who\\\\\\'ve been known to kill the odd endangered species at madame\\\\\\'s request. Now they\\\\\\'re sent on a mission to round up dalmatians, and when they fall a bit short of their goal, it comes to Cruella\\\\\\'s attention that Perdy has just given birth to a litter of 15 pups. For this version, a number of real dalmatian puppies were combined with computer-generated animation and animatronic creatures from Jim Henson\\\\\\'s Workshop, who respond better to direction (and are doubtless easier to clean up after) than the real thing. \n\nRipped with DVD Decrypter and Autogk.\t\t","torrent":{"xt":"urn:btih:fbb5062b57c5d0c2c809ae38508789d6942a0f4a","amp;dn":"101+Dalmatians%281996%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fbb5062b57c5d0c2c809ae38508789d6942a0f4a","infoHashBuffer":{"type":"Buffer","data":[251,181,6,43,87,197,208,194,200,9,174,56,80,135,137,214,148,42,15,74]},"announce":[],"urlList":[]}}