{
  "title": "SketchUp 2014 -14.0.4899",
  "uid": 9789503,
  "size": 121983083,
  "categoryP": "applications",
  "categoryS": "mac",
  "magnet": "?xt=urn:btih:fc914ae2c30b80ff6202d23bf2d29dc9bd218851&amp;dn=SketchUp+2014+-14.0.4899&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 46,
  "leechers": 1,
  "uploader": "failzone",
  "files": 1,
  "time": 1395226006,
  "description": "SketchUp is an easy-to-learn 3D modeling program that enables you to explore the world in 3D.\n\nWith just a few simple tools, you can create 3D models of houses, sheds, decks, home additions, woodworking projects - even space ships. And once you've built your models, you can place them in Google Earth, post them to the 3D Warehouse, or print hard copies.\n\n\nWhat's New Version 13.0.3688:New Features and FYI's: \n\nAn Extension Warehouse has been created and integrated with SketchUp. Users can now manage hundreds of extensions installed on their computer via the Extension Warehouse. \nThe word &quot;SketchUp&quot; now refers to a product family of which there are two members: SketchUp Pro and SketchUp Make. \nToolbars for SketchUp on Windows operating systems have been improved. They are now customizable and more reliably stay put once they have been docked. \nScene-based animations can now be exported to high-quality video from SketchUp. \nToolbars and cursors have been updated and made consistent between SketchUp, LayOut, Style Builder and SketchUp Viewer. \nWe have a new SDK. See the &quot;getting_started.html&quot; and &quot;migration_guide.html&quot; in the SDK package for details. \nLots of little tweaks, bugs fixes and improvements were made to existing features. \nSketchUp no longer will take a long time to open and close with an unstable Internet connection. \n(Mac) SketchUp does not support OS X 10.6 and older versions of OS X. Users with these platforms will see an error on launch. \nExtension Warehouse / Ruby Plug-Ins: \n\nWe are installing only the following extensions with the product : Advanced Camera Tools, Dynamic Components, Sandbox Tools, Photo Textures. The other SketchUp 8 extensions (Ruby Script Examples, Ocean Modeling, Utilities Tools, Shadow Strings Fix toolbar, Solar North toolbar) are available for download on the Extension Warehouse. \nThe plugins directory on the Mac has moved to ~/Library/Application Support/SketchUp 2013/SketchUp. We no longer install anything into the Macintosh HD/Library/Application Support/SketchUp directory. \nKnown Issues: \n\nPhoto texture dialog turns black when switching faces. The workaround is to disable HWA in Safari. See this article for how to do that. \nThe &quot;Create new Style&quot; button does not create a style with a unique name. To workaround this issue, rename new styles to have unique names. \n(Localization) Function names for some dynamic components functions are incorrectly translated in some languages. When selecting these functions via the Dynamic Component interface, users will need to re-name them to their proper English names for them to work. \nWhen using the drac-select feature to select things, ghost artifacts can be seen. \nSection planes are not immediately visible when they are copied into a new document. Work around this issue by toggling on section planes in the Styles dialog box (View &gt; Section Planes) \nSolid, body, and region entities can not be imported by the DWG importer. Not a regression. \nGoogle login is sometimes shown when selecting File &gt; Generate Report or when selecting Window &gt; Photo Textures. Logging in to your Google account when selecting Window &gt; Photo Textures appears to be a workaround that fixes both the Photo Textures and Generate Report functionality. \n(Extension Warehouse) Translations still not 100% complete throughout the site. \n(Extension Warehouse) When you submit a developer application, you sometimes see an error &quot;Email was not sent.&quot; But we should have received the application anyway. \n(Extension Warehouse) Mouse scroll wheel doesn't work until you click into the dialog. \nLayout: \n\nGeneral: \n\nChanges were made to improve overall performance with LayOut. \nShapes can now be filled with image-based patterns in addition to solid colors. This is called Pattern Fill. \nLayOut now has the ability to create multi-copy arrays, similar to the way SketchUp works. \nText leader lines can now be curved. \nUsers can now zoom in to a document up to 10,000%. \nTo better reflect standards, dimensions now have dashes to separate feet from inches. \n\nKnown Issues: \n\n(Localization) LayOut will continue to use Templates, Scrapbooks, and Pattern Fills from the previous install of LayOut after upgrading or reinstalling. This will only become apparent if the user has gone from one language version of LayOut to a different language version. It will appear as if there are no templates to choose from in the getting started screen. Navigate to Preferences &gt; Folders and click on restore defaults for Templates and Scrapbooks and restart LayOut. After, the application will work as designed. \nThe thumbnail images shown by the Pattern Fill inspector will have a white background by default, which is visible for any non-opaque pixels in the image. For some types of pattern images that use white linework, it is necessary to override this default white background with something darker to make the white linework visible. This can be achieved by saving the PNG file with a bKGD chunk (background color). Gimp is free and supports this option when exporting PNG files. \nLayOut's page draw performance is noticeably slower on a Macbook pro with retina display than it was on previous generation non-retina Macbook pros. With the retina display, there are 4 times as many pixels to fill every time the page is drawn, but the processing power of this first generation of the Macbook Pro retina is not 4 times better than its non-retina predecessor. For users working with very complex pages in a LayOut document that suffer from sluggish performance, there is a setting that allows the user to force an application to run in low resolution on a retina display. See the section &quot;I'm noticing functional or visual issues with an application. How can I make it work better?&quot; here: http://support.apple.com/kb/HT5266\n\nVersion 13.0.4123:\n\nSketchUp:\n* (Windows) Ruby toolbars have been fixed so that they dock in the right place, as opposed to behind other toolbars.\n* (Mac) Dynamic Components Options and Attributes dialogs have been fixed so that they no longer display an empty window.\n* (Mac) Corrected WebDialog.get_element_value to properly support HTML elements.\n\nLayOut:\n* (Windows) Copying geometry from SketchUp and pasting it into LayOut is supported again.\n\nStyle Builder:\n* (English and French) The Style Name label has been given extra padding to eliminate an overlap with the input box in the Stroke Settings panel.",
  "parsed": {
    "xt": "urn:btih:fc914ae2c30b80ff6202d23bf2d29dc9bd218851",
    "dn": "SketchUp 2014 -14.0.4899",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "fc914ae2c30b80ff6202d23bf2d29dc9bd218851",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        252,
        145,
        74,
        226,
        195,
        11,
        128,
        255,
        98,
        2,
        210,
        59,
        242,
        210,
        157,
        201,
        189,
        33,
        136,
        81
      ]
    },
    "name": "SketchUp 2014 -14.0.4899",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 47,
  "peers": 4,
  "last_updated": "2016-12-25T18:53:17.880Z"
}