{"title":"Dan Auerbach-Keep It Hid-2009-blues","uid":4665655,"size":121886268,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:fd5756d9f8edfc93e7d78ad5dc1fb7e5f6e76769&amp;dn=Dan+Auerbach-Keep+It+Hid-2009-blues&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":41,"leechers":0,"uploader":"SecondOpinion","files":-1,"time":1232556892,"description":"((((((((((((((((((((((((   D..E..M..U..N..O..I..D   ))))))))))))))))))))))))\n\n\nI get all my releases from the above tracker follow the forwarded url to check out the latest zero day releases!!!!\n\n                          &lt;a href=&quot; http://www.btzip.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.btzip.com&lt;/a&gt;\n\n     [[[  another fine release by the D..E..M..U..N..O..I..D   Team   ]]]\n\n\n   .....................................INFO................................\n\nDaniel Q. Auerbach (born May 14, 1979) is a multi-instrumentalist best known as the guitarist and vocalist for the Black Keys, a blues rock band from Akron, Ohio.\nAuerbach grew up in a family with strong musical roots. His cousin is the late Robert Quine. Auerbach became infatuated with blues music after listening to his father's old vinyl records during his childhood. He was influenced early-on by his mother's side of the family, notably his cousin who played bluegrass music. He was heavily influenced by Junior Kimbrough in college, eventually resulting in him dropping out to pursue the guitar more seriously. &quot;I've listened to him so much, it's just how I hear it... I studied him so much... Getting F's in college, when I should've been studying, I was listening to Junior Kimbrough's music instead&quot;. Major influences include: Junior Kimbrough, Robert Johnson, Robert Nighthawk, T-Model Ford, Hound Dog Taylor, Mississippi Fred McDowell, Kokomo Arnold\nIn a technique similar to many early blues players, Auerbach often uses a fingerpick on his index finger along with his thumb to play chords. Dan claims to prefer vacuum-tube amplifiers over solid-state.\n\nIn recent years, Auerbach has set up his own recording studio in Akron called Akron Analog where he has engineered and produced recordings from Radio Moscow (Ames, IA), Brimstone Howl (Lincoln, NE), Patrick Sweany (Massillon, OH), as well as the forthcoming &quot;with blasphemy so heartfelt&quot; album by Dan's 18 year old protege Jessica Lea Mayfield from Kent, Ohio.\n\n","torrent":{"xt":"urn:btih:fd5756d9f8edfc93e7d78ad5dc1fb7e5f6e76769","amp;dn":"Dan+Auerbach-Keep+It+Hid-2009-blues","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd5756d9f8edfc93e7d78ad5dc1fb7e5f6e76769","infoHashBuffer":{"type":"Buffer","data":[253,87,86,217,248,237,252,147,231,215,138,213,220,31,183,229,246,231,103,105]},"announce":[],"urlList":[]}}