{"title":"Final Fantasy X [Ntsc] Ps2","uid":4307200,"size":3816277318,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:fda46282415c7149cf6bc5b76060701cbe895ef1&amp;dn=Final+Fantasy+X+%5BNtsc%5D+Ps2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":50,"leechers":14,"uploader":"Big_dude","files":-1,"time":1216614903,"description":"Here is Final Fantasy X Ntsc version for Ps2\n\nFormat:        Dvd5 Ntsc\nLanguage:      English\nDiscs:         1\nImage:         MDS/ISO\nRequirements:  Modded/Chipped ps2, or Swap Magic disc method.\n\n(You could try the homebrew exploit to (Free Mc Boot - Also known as soft modding for ps2), if your ps2 system isn't hard modded with a chip or if Swap Magic isn't working as a last resort. There are ps2 emulators but its not 100% &amp; the quality isn't as good as playing your game on your ps2 console.)\n\nIf your using swap magic and don't have a flip top, you'll need to first\nremove the front cover of the disc tray for use of the slide card.\n\nHere's a link for how to remove the front cover...\n     &lt;a href=&quot;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&lt;/a&gt;\n\nAnd here's some links on using the slide tool to open the tray to swap in your ps2 copy or backup game.\n     &lt;a href=&quot;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&lt;/a&gt;\n    &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&lt;/a&gt;\n    &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&lt;/a&gt;\n\nThose that don't have a modded Ps2 Here's a few links for Free MC Boot &amp; how to use it to soft mod your ps2 so you can be able to play burned games. Free Mc Boot won't work on newer models of ps2 you'll have to use an older version the tutorial explains this.\n\n-- &lt;a href=&quot; http://bootleg.sksapps.com/tutorials/fmcb/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bootleg.sksapps.com/tutorials/fmcb/&lt;/a&gt;\n\nYou will also need to patch the iso (the PS2 game) with ESR disc patcher GUI v0.24a if your using free mc boot with ESR Elf to boot your p2 copies or backups (No-swapping required for esr method).\n\nAfter patching burn the iso with Imgburn or Dvd Decrypter to respectable media\nthen use the ESR through fmcb after you installed everything to boot your game.\n\nYou will still need to use the proper media for the game to run or load properly regardless if your using fmcb, a modded ps2, or swap magic. Try Verbatim DVD+R (Booktype to DVD-ROM), or Tayio Yuden, burn at 8x if its a 16x max. You really can't use Maxell DVD+R for example or some other brand as it more than likely will not work.\n\nNote: If fmcb isn't working and your Ps2 isn't Modded, Try Swap Magic to load the game.\n\n\nCompressed with Winrar.\n\n\nUploaded this because most torrents were either in Pal format,\nand other torrents in the usa version were dead or just to slow.\n\n\nThis is an awesome rpg game, and should be shared properly.\n\n\nTorrent also includes game pics.\n\nNote sometimes this game has glitches or will freeze or crash, its not from my end\nit's how they made the game itself, I have the orginal game and sometimes it does this. Oh and by the way my original game is brand new and rarely been used its free of dust or scratches, so its not from that trust me its how they made the game. If it does glitch just retry and it should work it doesn't always do this.\nGame is %100 fully working though, so don't worry.\n \nAlso note that after the ps2 logo appears the screen will be dark and pause for a short while then game loads just be patient while waiting, again this is how they made the game.\n\nBurn with DVD Decrypter, or ImgBurn.\n\nBest to burn at half speed..if 16x then burn at 8x etc.\n\nIf Imgburn doesn't work or game freezes or won't load try DVD Decrypter.\n\nUse good media like Verbatim DVD+R (Booktype to DVD-ROM), or Tayio Yuden.\n\nRemeber to seed this.\n\n\nGame ripped straight from the original Disc.\n\n\nAny Problems with it post a comment, don't trash the game if it hangs, works regardless just retry.  Assumming your using high quality media to burn with.\n\n\n\nEnjoy!\n\n\nYou guys and anyone else downloading this need to seed don't just leech, I can't seed all the time.","torrent":{"xt":"urn:btih:fda46282415c7149cf6bc5b76060701cbe895ef1","amp;dn":"Final+Fantasy+X+%5BNtsc%5D+Ps2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fda46282415c7149cf6bc5b76060701cbe895ef1","infoHashBuffer":{"type":"Buffer","data":[253,164,98,130,65,92,113,73,207,107,197,183,96,96,112,28,190,137,94,241]},"announce":[],"urlList":[]}}