{
  "title": "Hard Disk Sentinel Pro 4.50 Build 6845 Final",
  "uid": 9544509,
  "size": 18799416,
  "categoryP": "applications",
  "categoryS": "windows",
  "magnet": "?xt=urn:btih:fe13ff9b6e214d51ccb4da1ff9f9fef701992e59&amp;dn=Hard+Disk+Sentinel+Pro+4.50+Build+6845+Final&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 49,
  "leechers": 1,
  "uploader": "nikita200",
  "files": -1,
  "time": 1391104426,
  "description": "Here are some key features of &quot;Hard Disk Sentinel Professional&quot;:\n Â· Easy to use interface\n Â· All information are displayed in the main window of the application. Quick controls allow easy navigation to access all hard disks, partitions and different information. Intuitive user interface elements display information by using green/yellow/red color to indicate the level of problem. Detailed text description and context sensitive help guides the user thru the features and options.\n Â· 1. Install &gt; 2. Configure &gt; 3. Stay protected\n Â· Just install, configure alerts and backup options and your system is now safe. You'll be notified about the problems - but if everything is correct, Hard Disk Sentinel just sits on tray and displays current status. The data is protected even in 24 hours daily, 7 days a week.\n Â· Instant S.M.A.R.T. analysing - Hard Disk Sentinel can communicate with IDE, Serial ATA and SCSI hard disks to detect their status and temperature. Disk status are displayed immediately as you launch the application, there is no need to analyse disks for a long period. It displays the current and maximum temperature for the hard disk.\n Â· It can read all general and vendor-specific attributes and monitor their values. For advanced users, all raw data are displayed also including power-on hours or number of read/write errors. Hard Disk Sentinel interprets the performance and fitness related S.M.A.R.T. values and displays the calculated Performance and Health percentage, total power on time and estimated lifetime remaining.\n Â· Disk status in Windows Explorer - View the current health status and used space in Windows Explorer or in any other application, so you'll always know the amount of used space for each partitions and the disk condition.\n Â· Information on demand - It can display current hard disk temperatures and health on the system tray, in a small status window and on the desktop itself. Average and maximum temperatures are logged for all hard disks and these informations are displayed in graphs for statistical purposes.\n Â· Logging - Hard Disk Sentinel logs all degradations in all SMART parameters. For example, if a new uncorrectable sector is found on your hard disk, you will be notified.\n Â· Alerts - Hard Disk Sentinel can make different kind of alerts upon different problems. It can execute various tasks (even external applications) in case of a problem. There is an option to send daily emails about current status.\n Â· Hard Disk Details - Detects and displays every information about the hard disk, from the revision number and buffer size to all features it has. The maximum available and current transfer modes are also displayed.\n Â· Hard Disk Performance - Logs how much data were read from or written to the hard disk. Displays current transfer rates for both reading and writing and estimates the maximum available (theoretical) transfer rate for a particular hard disk.\n Â· Hard Disk Partitions - Displays partitions for each physical hard disks and type and usage informations about them so you cannot run out of space. Hard Disk Sentinel sends this information automatically in alert/status messages.\n Â· Shutdown - It offers option to shut down the computer on failure, overheat or parameter degradation. This option can be used to prevent further data loss.\n Â· Acoustic Management - It offers option to control the acoustic level of IDE/S-ATA hard disk. It is possible to increase performance or make the disks more silent.\n Â· Clock Synchronization - It offers option to synchronize the PC clock with an atomic clock via NTP (Network Time Protocol).\n Â· Improvements - Hard Disk Sentinel is constantly improving. More features will be available soon. If you have any idea which can be useful, just let us know.\n\nHome Page: www.hdsentinel.com\nInterface: multilingual \n",
  "parsed": {
    "xt": "urn:btih:fe13ff9b6e214d51ccb4da1ff9f9fef701992e59",
    "dn": "Hard Disk Sentinel Pro 4.50 Build 6845 Final",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "fe13ff9b6e214d51ccb4da1ff9f9fef701992e59",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        254,
        19,
        255,
        155,
        110,
        33,
        77,
        81,
        204,
        180,
        218,
        31,
        249,
        249,
        254,
        247,
        1,
        153,
        46,
        89
      ]
    },
    "name": "Hard Disk Sentinel Pro 4.50 Build 6845 Final",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 50,
  "peers": 18,
  "last_updated": "2016-12-25T19:00:21.118Z"
}