{"title":"Homeland Season 1 and Season 2 Complete HDTVRip x264 AAC [VectoR","uid":9098281,"size":4152800718,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:fe151151ba5b3a839e54c26c8099812f6f322b4d&amp;dn=Homeland+Season+1+and+Season+2+Complete+HDTVRip+x264+AAC+%5BVectoR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":181,"leechers":103,"uploader":"asdwiv","files":50,"time":1382730198,"description":"Homeland Season 1 and Season 2 Complete HDTVRip x264 AAC [VectoR]\n\nHomeland is an American psychological thriller television series based on the Israeli series Hatufim, also known as Prisoners of War.\n\nThe series follows Carrie Mathison, a CIA operations officer who, after conducting an unauthorized operation in Iraq, is put on probation and reassigned to the CIA's counterterrorism center in Langley, Virginia. While she was conducting the operation in Iraq, Carrie was warned by an asset that an American prisoner of war had been turned by Al-Qaeda. Carrie's job is complicated when her boss, Director of the Counterterrorism Center David Estes, calls Carrie and her colleagues in for an emergency briefing. It is then that Carrie learns that Nicholas Brody, a U.S. Marine Sergeant who had been reported as missing in action since 2003, has been rescued during a Delta Force raid on a compound belonging to terrorist Abu Nazir. Carrie comes to believe that Brody is the American prisoner of war that her asset in Iraq was talking about. However, the federal government and her superiors at the CIA consider Nicholas Brody a war hero. Realizing it would be next to impossible to convince her boss, David Estes, to place Brody under surveillance, Carrie approaches the only other person she can trust, Saul Berenson. The two must now work together to investigate Brody and prevent another terrorist attack on American soil.\n\nEpisodes: Season 1(Ep1-12)\n                 Season 2(Ep1-12)\n\nSpoken Lamguage:English\nSubtitles:English(.srt)\nFile Size:150/160MB\nFormat:mkv/mp4\nOverall Bitra/*te :400-500kbps\nResolution:640*352/640*368/848*480\n","torrent":{"xt":"urn:btih:fe151151ba5b3a839e54c26c8099812f6f322b4d","amp;dn":"Homeland+Season+1+and+Season+2+Complete+HDTVRip+x264+AAC+%5BVectoR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe151151ba5b3a839e54c26c8099812f6f322b4d","infoHashBuffer":{"type":"Buffer","data":[254,21,17,81,186,91,58,131,158,84,194,108,128,153,129,47,111,50,43,77]},"announce":[],"urlList":[]}}