{
  "title": "Black Sabbath - The Black Box (Discography 1970 - 1978) ak6103",
  "uid": 11624193,
  "size": 806288075,
  "categoryP": "audio",
  "categoryS": "music",
  "magnet": "?xt=urn:btih:febaa2f8953d243ec97220828c1b791796e4a89d&amp;dn=Black+Sabbath+-+The+Black+Box+%28Discography+1970+-+1978%29+ak6103&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 76,
  "leechers": 25,
  "uploader": "analogkid6103",
  "files": 69,
  "time": 1417598021,
  "description": "Uploader Speaks: The True Heavy Metal Band. I have posted most of these albums but I came across this and since its mp3 320k I say post. Enjoy and seed this, its the perfect Black Sabbath primer. And yes I thought about adding Reunion and 13 but thats not what this is about, this is the basics of a Sabbath collection. The backbone so to speak,bottom line these albums are Sabbath.\nDescription:\tA box set comprising of the Ozzy Osbourne years of Black Sabbath, the albums &quot;Black Sabbath&quot; through  &quot;Never Say Die&quot;. 320 bitrate. Old school heavy doom metal. The first proper metal band.\n\nBiography:\n\nQuote:\nBlack Sabbath are an English heavy metal band from Birmingham, England. Formed in 1968 by Ozzy Osbourne (lead vocals), Tony Iommi (guitar), Geezer Butler (bass guitar), and Bill Ward (drums and percussion), the band has since experienced multiple lineup changes, with a total of twenty-two former members. Originally formed as a heavy blues-rock band named Earth, the band began incorporating occult- and horror-inspired lyrics with tuned-down guitars, changing their name to Black Sabbath and releasing multiple gold and platinum records in the 1970s.\n\nAs one of the most influential heavy metal bands of all time, Black Sabbath helped define the genre with releases such as 1970's quadruple-platinum Paranoid. Black Sabbath has sold more than 100 million albums worldwide, and were ranked number one on MTV's Greatest Metal Bands countdown. Ozzy Osbourne was fired from the band in 1979, and while initially replaced by former Rainbow vocalist Ronnie James Dio, Black Sabbath would see a revolving lineup in the 1980s and 1990s that included vocalists Ian Gillan, Glenn Hughes, Ray Gillen and Tony Martin. The original lineup reunited with Osbourne in 1997 and released a live album, Reunion, which spawned the Grammy Award-winning single &quot;Iron Man&quot; in 2000, thirty years after the song's initial release on Paranoid.\n\nLine up throughout albums:\nOzzy Osbourne - Vocals (Iommi (guest), The Prospectors, The Black Panthers, Approach, Music Machine, Rare Breed)\nTony Iommi - Guitars (Heaven And Hell (UK), The In Crowd, The Birds and the Bees, The Rockin' Chevrolets, The Rest, Mythology, Jethro Tull)\nTerrance &quot;Geezer&quot; Butler - Bass (Heaven And Hell (UK), Rare Breed, Ozzy Osbourne)\nBill Ward - Drums (The Rest, Mythology, Iommi)\nAdam Wakeman - Keyboards\n\nThis torrent contains the albums:\nBlack Sabbath (1970)\nParanoid (1970)\nMaster of Reality (1971)\nBlack Sabbath, Vol. 4 (1972)\nSabbath Bloody Sabbath (1973)\nSabotage (1975)\nTechnical Ecstasy (1976)\nNever Say Die! (1978)\n\nSeed it forever\n\n\n\nIf this is allowed to die, I will lose my faith,in Metal. And with faith lost, uploading will end. People who would let this die are unworthy of service. Strong words huh? I mean every one,Peace and stay Heavy.  analogkid6103 12/03 2014\nGenre:\tHeavy\nSubgenre:\tOriginal Doom / Stoner Metal\nBitrate:\t320 k\nSize:\t768.94 MB\nShow/Hide Files: \t\n69 files  Uploader Speaks: My 1 year anniversary will be on 01/02/2015. I hope to have many more of em. Metal has stayed consistantly Good and I have no problems finding good content. To share with the true believers and supporters of my metal program. Thanks for the people who have been payin attention to my pages, and you know who you are,And so do I, wolfymain,zoso5150,Flyfisher61,and others but these guys have been watching since I began A special thanks to them",
  "parsed": {
    "xt": "urn:btih:febaa2f8953d243ec97220828c1b791796e4a89d",
    "dn": "Black Sabbath - The Black Box (Discography 1970 - 1978) ak6103",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "febaa2f8953d243ec97220828c1b791796e4a89d",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        254,
        186,
        162,
        248,
        149,
        61,
        36,
        62,
        201,
        114,
        32,
        130,
        140,
        27,
        121,
        23,
        150,
        228,
        168,
        157
      ]
    },
    "name": "Black Sabbath - The Black Box (Discography 1970 - 1978) ak6103",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 101,
  "peers": 16,
  "last_updated": "2016-12-25T19:03:25.669Z"
}