{"title":"VMware Workstation 10.0.3 Build 1895310 - ZWT","uid":10473507,"size":515196238,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ff4714e9fc6ec3677441b831b37183e6cba40ae1&amp;dn=VMware+Workstation+10.0.3+Build+1895310+-+ZWT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":65,"leechers":3,"uploader":"murphy78","files":-1,"time":1404290277,"description":"*NOTE* This is not a ZWT release, but since I used their keygen, I give\nthem credit. I downloaded the exe direct from vmware\n\nFile: VMware-workstation-full-10.0.3-1895310.exe\nSize: 491 MB\nSHA1: F7826612CECCADF2F6B09B24305C16C32865E48E\n\nKeygen file: zwt-keygen.exe\nSize: 50.6 KB\nSHA-1: 487A10C8758E2AF4A7EED68533C16BC3D6C6E9F6\nIt was their keygen.exe from 10.0.0 release, just renamed.\n\nHere's a few keys if you don't trust the keygen:\nMU20T-8X15J-RZYY9-QH07M-1270P\nNG63J-4KLD1-HZP49-P8CQM-12Q2J\nNV6EA-21K8L-NZ6M8-P19Q0-CCL0Q\n4F4W7-6624N-CZVN0-03AQ0-03TPR\n\nVMware Workstation 10.0.3 has been updated to the OPENSSL library version\nopenssl-0.9.8za where necessary to address CVE-2014-0224, CVE-2014-0198,\nCVE-2010-5298, and CVE-2014-3470.\n\nVMware Workstation 10 delivers best-in-class Windows 8 support, and innovative\nnew features that transform the way technical professionals work with virtual\nmachines, whether they reside on their PCs or on private enterprise clouds.\n   \n*New Operating System Support\n Support has been added for: \n-Windows 8.1\n-Windows 8.1 Enterprise\n-Windows Server 2012 R2\n-Ubuntu 13.10\nAs well as for the latest Fedora, CentOS, Red Hat and OpenSUSE releases.\n\n*VMware Hardware Version 10\nThis version of VMware Workstation includes VMware hardware Version 10 and is\ncompatible with vSphere 5.5. Hardware versions introduce new virtual hardware\nfunctionality and new features while enabling VMware to run legacy operating\nsystems in our virtual machines. New features included in this hardware\nversion:\n\n*16 vCPUs\nVirtual machines can now run with up to 16 virtual CPUs. This enables very\nprocessor intensive applications to be run in a virtual machine.\nNote: Running virtual machines with 16 vCPUs requires that both your host\nand guest operating system support 16 logical processors. Your physical\nmachine must have at least 8 cores with hyper-threading enabled to power\non a virtual machine with this configuration.\n\n*8 Terabyte Disks \nVirtual machines can now include virtual disks greater than 2 Terabytes.\nGiven the limitations of most operating systems to boot from disks greater\nthan 2 Terabytes, These large disks are most useful as secondary drives for\nfile storage.\n\nNote: To use a disk greater than 2TB for a boot disk, your guest operating\nsystem would need to boot using EFI in order to read a GPT formatted disk\nwhich is required to access all of the sectors on a disk of this size.\nAdditionally, the Buslogic controller is not capable of supporting a disk\ngreater than 2TB.\n\nExtra murphy78 note: To enable EFI boot mode, edit the .VMX file and add:\nfirmware = &quot;efi&quot;\nAlternatively, to set it back to bios (legacy) boot, change to:\nfirmware = &quot;bios&quot;\n\n10.0.2 Fixes Changelog:\nThe following issues are resolved in this release of VMware Workstation.\n\nBetter audio performance and compatibility with certain USB audio/video devices.\nThe compatibility and performance of USB audio and video devices with virtual machines has been improved.\n\nUSB devices can be connected to the Linux RHEL 5 guest operating system.\nResolved an issue that prevents a USB device from being connected to Linux RHEL 5 guest operating system.\n\nWindows 8.1 Update 1 and Windows Server 2012 R2 are supported as guest operating system through easy install.\nEasy installation option supports Windows 8.1 Update 1 and Windows Server 2012 R2 as a guest operating system.\n\nOpenSUSE 13.1 is officially supported as a host operating system. \nOpenSUSE 13.1 is now supported as a host operating system.\n\nBlueray drives can burn CDs when connected to the virtual machine.\nResolved an issue causing burning CDs with Blueray drives to fail while connected to the virtual machine.\n\nUsing Microsoft Word and Excel in unity mode no longer produces a beep.\nResolved an issue that caused using Microsoft Word and Excel in unity mode causes a beep.\n\nThe UAC dialog of the Windows 8 virtual machine no longer causes the host application windows to be blanked out on Linux Host.\nResolved an issue causing host application windows to be blanked out in the UAC dialog on the Linux host of the Windows 8 virtual machine.\n\nThe sound card can be automatically added to a virtual machine on a Linux host at power up. \nResolved an issue that prevented the Sound Card from being automatically added to the VM when powering on the virtual machine on a Linux host.\n\nWindows 8.1 guest operating system no longer display a black screen when launching Metro style applications from the launch menu.\nResolved an issue that could cause a Windows 8.1 guest operating system to display a black screen when launching Metro style applications in the launch menu.\n\nHotkeys can be used in the Preference dialog in KVM mode.\nResolved a hotkey conflict in the Preference dialog of the KVM mode.\n\nImproved compatibility of GL renderer with new Nvidia drivers.\nResolved a compatibility issue of GL renderer with some new Nvidia drivers.\n\nImproved graphics quality with Solidworks applications.\nResolved graphics errors with for Solidworks applications.\n\nVirtual machines imported from a physical PC no longer crash on startup.\nResolved an issue causing virtual machines imported from a physical PC to crash on startup.\n\nReading and writing to a file using two threads with a shared folder has been improved.\nResolved an issue about shared folder when the user read and write file using two threads.\n\nLinux virtual machines access updated contents when using shared folders.\nResolved an issue that caused Linux virtual machines to see stale file contents when using shared folders.\n\nImproved performance of the virtual machine using the E1000e adapter.\nResolved the virtual machine performance issues when using the E1000e adapter.\n\nWorkstation now launches on Ubuntu 14.04.\nResolved an issue preventing Workstation from starting on Ubuntu 14.04.","torrent":{"xt":"urn:btih:ff4714e9fc6ec3677441b831b37183e6cba40ae1","amp;dn":"VMware+Workstation+10.0.3+Build+1895310+-+ZWT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff4714e9fc6ec3677441b831b37183e6cba40ae1","infoHashBuffer":{"type":"Buffer","data":[255,71,20,233,252,110,195,103,116,65,184,49,179,113,131,230,203,164,10,225]},"announce":[],"urlList":[]}}