{
  "title": "Becoming a Supple Leopard.pdf Gooner",
  "uid": 8574808,
  "size": 31101786,
  "categoryP": "other",
  "categoryS": "e_books",
  "magnet": "?xt=urn:btih:ff5e16c8e315d06c67b1dbd695853c2b554a09e6&amp;dn=Becoming+a+Supple+Leopard.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969",
  "seeders": 55,
  "leechers": 0,
  "uploader": "GoonerTPB",
  "files": 1,
  "time": 1371249015,
  "description": "Becoming a Supple Leopard: The Ultimate Guide to Resolving Pain, Preventing Injury, and Optimizing Athletic Performance by Kelly Starrett (Author), Glen Cordoza (Author)\n\nImprove your athletic performance, extend your athletic career, treat body stiffness and achy joints, and rehabilitate injuries all without having to seek out a coach, doctor, chiropractor, physical therapist, or masseur. In Becoming a Supple Leopard, Kelly Starrett founder of MobilityWod.com shares his revolutionary approach to mobility and maintenance of the human body and teaches you how to hack your own human movement, allowing you to live a healthy, happier, more fulfilling life\n\nPerformance is what drives the human animal, but the human animal can be brought to an abrupt halt by dysfunctional movement patterns. Oftentimes, the factors that impede performance are invisible to not only the untrained eye, but also the majority of athletes and coaches. Becoming a Supple Leopard, makes the invisible visible. In this one of a kind training manual, Starrett maps out a detailed system comprised of more than two hundred techniques and illuminates common movement errors that cause injury and rob you of speed, power, endurance, and strength. Whether you are a professional athlete, a weekend warrior, or simply someone wanting to live healthy and free from restrictions, Becoming a Supple Leopard, will teach you how to maintain your body and harness your genetic potential\n\nLearn How to:\n\nprevent and rehabilitate common athletic injuries\n\noverhaul your movement habits\n\nquickly identify, diagnose, and fix inefficient movement patterns\n\nproblem solve for pain and dysfunction in austere environments with little equipment\n\nfix poor mechanics that rob power, bleed force, and dump torque\n\nunlock reservoirs of athletic capacity you didn't know you had\n\nidentify and fix poor movement patterns in children\n\nreverse the aging process\n\ndevelop strategies that restore function to your joints and tissues\n\naccelerate recovery after training sessions and competition\n\ncreate personalized mobility prescriptions to improve movement efficiency\n\nimprove your quality of life through regained work capacity\n\nrun faster, jump higher, and throw farther",
  "parsed": {
    "xt": "urn:btih:ff5e16c8e315d06c67b1dbd695853c2b554a09e6",
    "dn": "Becoming a Supple Leopard.pdf Gooner",
    "tr": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "infoHash": "ff5e16c8e315d06c67b1dbd695853c2b554a09e6",
    "infoHashBuffer": {
      "type": "Buffer",
      "data": [
        255,
        94,
        22,
        200,
        227,
        21,
        208,
        108,
        103,
        177,
        219,
        214,
        149,
        133,
        60,
        43,
        85,
        74,
        9,
        230
      ]
    },
    "name": "Becoming a Supple Leopard.pdf Gooner",
    "announce": [
      "udp://exodus.desync.com:6969",
      "udp://open.demonii.com:1337",
      "udp://tracker.coppersurfer.tk:6969",
      "udp://tracker.openbittorrent.com:80"
    ],
    "urlList": []
  },
  "previous": 55,
  "peers": 16,
  "last_updated": "2016-12-25T19:06:44.251Z"
}